import Mathlib.Basic.Real.Basic
import Mathlib.Tactic.Linarith
import Mathlib.Tactic.Push
import Mathlib.Tactic.Tauto
set_option maxRecDepth 10000
set_option maxHeartbeats 1000000
namespace ElevenTheory

theorem theory3120 (t x_1_6 x_1_7 x_3_6 x_6_7 x_7_10 : ℝ) : (¬ ((t + ((-1) * x_1_6) + x_3_6) ≥ 1)) ∨ (¬ ((x_3_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_1_7 + ((-1) * x_7_10)) ≥ 1)) ∨ (¬ ((x_1_6 + ((-1) * x_1_7)) ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_6_7 + ((-1) * x_7_10)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3121 (t x_0_1 x_1_6 x_1_8 x_3_6 x_6_8 : ℝ) : (¬ ((t + ((-1) * x_1_6) + x_3_6) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_6)) ≤ (-1))) ∨ (¬ ((x_1_8 + ((-1) * x_6_8)) ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_3_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3122 (t x_0_2 x_0_5 x_0_6 x_3_6 x_4_5 x_5_8 x_5_9 x_6_7 x_6_9 : ℝ) : (¬ ((x_0_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_0_2) + x_0_5) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_9) + x_6_9) ≥ 1)) ∨ (¬ ((x_3_6 + ((-1) * x_6_9)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_3_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_0_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_0_6)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((x_4_5 + ((-1) * x_5_9)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3123 (t x_1_3 x_1_7 x_3_4 x_3_7 x_7_9 : ℝ) : (¬ ((t + ((-1) * x_3_4) + x_3_7) ≥ 1)) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_1_3 + ((-1) * x_1_7)) ≥ 0)) ∨ (¬ ((x_1_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_3_7 + ((-1) * x_7_9)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3125 (t x_0_5 x_1_3 x_2_3 x_2_5 x_3_5 x_5_6 : ℝ) : (t ≥ 4) ∨ (¬ ((t + ((-1) * x_1_3) + x_2_3) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_3_5)) ≤ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_5)) ≥ 1)) ∨ (¬ ((x_2_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_2_5)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3126 (t x_0_2 x_1_3 x_2_3 x_2_5 x_3_5 : ℝ) : (t ≥ 4) ∨ (¬ ((x_2_5 + ((-1) * x_3_5)) ≤ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_5)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_5)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_1_3) + x_2_3) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_3)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3127 (t x_0_6 x_1_3 x_2_3 x_2_6 x_3_6 x_6_8 : ℝ) : (¬ ((x_1_3 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((x_2_3 + ((-1) * x_2_6)) ≤ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_0_6 + ((-1) * x_3_6)) ≤ 0)) ∨ (¬ ((t + ((-1) * x_1_3) + x_2_3) ≥ 1)) ∨ (¬ ((x_0_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((x_2_6 + ((-1) * x_6_8)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3130 (t x_1_4 x_1_6 x_4_5 x_4_6 x_6_10 : ℝ) : (¬ ((x_1_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((x_4_6 + ((-1) * x_6_10)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_1_6 + ((-1) * x_6_10)) ≥ 1)) ∨ (¬ ((x_1_4 + ((-1) * x_1_6)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_4_5) + x_4_6) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3131 (t x_0_4 x_1_2 x_2_4 x_2_8 x_4_8 : ℝ) : (¬ ((t + x_0_4 + ((-1) * x_2_4)) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_2_8)) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_2_4)) ≤ (-1))) ∨ (¬ ((x_2_8 + ((-1) * x_4_8)) ≥ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (t ≥ 4) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3132 (t x_4_6 x_4_9 x_6_7 x_6_9 x_9_10 : ℝ) : (t ≥ 4) ∨ (¬ ((x_4_6 + ((-1) * x_4_9)) ≤ 0)) ∨ (¬ ((t + x_6_7 + ((-1) * x_6_9)) ≥ 1)) ∨ (¬ ((x_6_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((x_4_9 + ((-1) * x_9_10)) ≤ (-1))) ∨ (¬ ((x_4_6 + ((-1) * x_6_7)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3133 (t x_0_8 x_1_2 x_2_6 x_2_8 x_5_6 x_6_8 : ℝ) : (¬ ((x_1_2 + ((-1) * x_2_8)) ≥ 1)) ∨ (¬ ((x_0_8 + ((-1) * x_2_8)) ≤ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_0_8 + ((-1) * x_6_8)) ≥ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_1_2 + ((-1) * x_2_6)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_2_6) + x_5_6) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3134 (t x_2_4 x_2_7 x_3_4 x_4_7 x_7_10 : ℝ) : (¬ ((t + ((-1) * x_2_4) + x_3_4) ≥ 1)) ∨ (¬ ((x_4_7 + ((-1) * x_7_10)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_2_7)) ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_3_4 + ((-1) * x_4_7)) ≤ (-1))) ∨ (¬ ((x_2_7 + ((-1) * x_7_10)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3135 (t x_2_5 x_4_5 x_4_9 x_5_9 x_9_10 : ℝ) : (t ≥ 4) ∨ (¬ ((x_5_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((x_4_9 + ((-1) * x_9_10)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((x_4_5 + ((-1) * x_4_9)) ≤ 0)) ∨ (¬ ((t + ((-1) * x_2_5) + x_4_5) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3137 (x_3_5 x_5_9 : ℝ) : (¬ ((x_3_5 + ((-1) * x_5_9)) ≤ (-1))) ∨ (¬ ((x_3_5 + ((-1) * x_5_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1⟩
  linarith

theorem theory3138 (t x_1_3 x_3_6 x_3_7 x_6_7 x_6_8 : ℝ) : (t ≥ 4) ∨ (¬ ((x_3_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((x_1_3 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_6_7) + x_6_8) ≥ 1)) ∨ (¬ ((x_3_7 + ((-1) * x_6_7)) ≤ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_7)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3139 (t x_0_1 x_0_6 x_1_2 x_2_4 x_4_8 x_6_7 x_6_8 x_7_8 x_8_9 : ℝ) : (¬ ((x_6_7 + ((-1) * x_6_8)) ≥ 0)) ∨ (¬ ((x_1_2 + ((-1) * x_2_4)) ≤ (-1))) ∨ (¬ ((x_0_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_8) + x_7_8) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((t + x_0_1 + ((-1) * x_0_6)) ≥ 1)) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_2)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3141 (t x_0_2 x_0_5 x_2_3 x_3_4 x_4_8 x_5_8 x_7_8 x_8_9 : ℝ) : (¬ ((x_3_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_5_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_8) + x_7_8) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((t + x_0_2 + ((-1) * x_0_5)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_3)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_3_4)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8⟩
  linarith

theorem theory3142 (t x_0_1 x_0_3 x_1_2 x_1_3 x_1_8 x_3_7 x_7_8 x_8_10 x_8_9 : ℝ) : (¬ ((x_1_8 + ((-1) * x_8_10)) ≥ 1)) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_8)) ≥ 1)) ∨ (¬ ((x_3_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_1_3)) ≥ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_1_2)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((t + ((-1) * x_8_9) + x_8_10) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_7)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3143 (t x_0_1 x_0_3 x_0_5 x_3_8 x_4_8 x_5_6 x_6_7 x_7_8 x_8_9 : ℝ) : (¬ ((t + ((-1) * x_4_8) + x_7_8) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_8)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_0_3)) ≤ 0)) ∨ (¬ ((x_6_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_3_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_4_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_5_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((t + x_0_1 + ((-1) * x_0_5)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_6)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3144 (t x_0_1 x_0_5 x_1_2 x_1_5 x_1_7 x_5_6 x_6_7 x_7_8 x_7_9 : ℝ) : (¬ ((x_1_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((x_0_5 + ((-1) * x_1_5)) ≤ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_1_7)) ≤ (-1))) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_5)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_1 + ((-1) * x_1_2)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((x_6_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((x_5_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((t + x_7_8 + ((-1) * x_7_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3146 (t x_0_2 x_0_3 x_2_5 x_3_7 x_5_9 x_7_8 x_8_10 x_9_10 : ℝ) : (¬ ((t + ((-1) * x_0_2) + x_0_3) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_2 + ((-1) * x_2_5)) ≥ 1)) ∨ (¬ ((x_7_8 + ((-1) * x_8_10)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_8_10) + x_9_10) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_7)) ≤ (-1))) ∨ (¬ ((x_5_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((x_2_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((x_3_7 + ((-1) * x_7_8)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8⟩
  linarith

theorem theory3147 (t x_0_3 x_0_5 x_1_2 x_1_3 x_1_5 x_2_5 x_3_4 x_4_8 x_5_7 x_5_9 x_8_9 : ℝ) : (¬ ((x_1_2 + ((-1) * x_1_5)) ≥ 0)) ∨ (¬ ((x_0_5 + ((-1) * x_1_5)) ≤ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (¬ ((t + x_5_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_2_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_4_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_1_3)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_5_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10, h11⟩
  linarith

theorem theory3149 (t x_0_2 x_0_5 x_1_2 x_1_5 x_2_3 x_3_6 x_5_7 x_6_10 x_7_9 x_9_10 : ℝ) : (t ≥ 4) ∨ (¬ ((t + ((-1) * x_6_10) + x_9_10) ≥ 1)) ∨ (¬ ((x_3_6 + ((-1) * x_6_10)) ≤ (-1))) ∨ (¬ ((x_0_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_3)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≥ 0)) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_5)) ≥ 1)) ∨ (¬ ((x_7_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_1_5)) ≤ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10⟩
  linarith

theorem theory3150 (t x_0_1 x_0_4 x_1_2 x_1_4 x_1_5 x_4_8 : ℝ) : (¬ ((x_0_1 + ((-1) * x_0_4)) ≥ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_5)) ≤ (-1))) ∨ (¬ ((x_1_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (¬ ((x_1_2 + ((-1) * x_1_4)) ≤ 0)) ∨ (t ≥ 4) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_5)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3152 (t x_0_1 x_0_2 x_1_2 x_1_3 x_2_7 : ℝ) : (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_0_2)) ≤ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_2 + ((-1) * x_2_7)) ≤ (-1))) ∨ (¬ ((x_1_2 + ((-1) * x_2_7)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3153 (t x_0_1 x_0_6 x_1_2 x_1_6 x_6_8 : ℝ) : (t ≥ 4) ∨ (¬ ((x_1_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_2)) ≤ (-1))) ∨ (¬ ((x_0_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_6) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_0_6)) ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3154 (t x_4_6 x_4_8 x_6_7 x_6_8 x_8_10 : ℝ) : (¬ ((x_4_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((t + ((-1) * x_6_7) + x_6_8) ≥ 1)) ∨ (¬ ((x_4_8 + ((-1) * x_8_10)) ≥ 1)) ∨ (¬ ((x_6_8 + ((-1) * x_8_10)) ≤ (-1))) ∨ (¬ ((x_4_6 + ((-1) * x_4_8)) ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3156 (t x_0_1 x_0_2 x_1_2 x_1_3 x_1_8 x_2_7 x_7_8 x_8_10 x_8_9 : ℝ) : (¬ ((x_0_1 + ((-1) * x_1_8)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((t + ((-1) * x_8_9) + x_8_10) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_7)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≤ 0)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ (¬ ((x_1_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_7_8 + ((-1) * x_8_10)) ≥ 1)) ∨ (¬ ((x_2_7 + ((-1) * x_7_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3158 (t x_0_1 x_0_2 x_0_4 x_1_2 x_1_3 x_1_7 x_4_6 x_6_7 x_7_8 x_7_9 : ℝ) : (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_0_4)) ≥ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≤ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) ∨ (¬ ((x_4_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((x_1_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((t + x_7_8 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_7)) ≤ (-1))) ∨ (¬ ((x_6_7 + ((-1) * x_7_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10⟩
  linarith

theorem theory3159 (t x_0_2 x_0_4 x_1_2 x_1_4 x_2_3 x_3_8 x_4_6 x_6_9 x_8_10 x_9_10 : ℝ) : (¬ ((t + x_1_2 + ((-1) * x_1_4)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_1_4)) ≤ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≥ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_8_10) + x_9_10) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_3_8 + ((-1) * x_8_10)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_2_3)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_3_8)) ≤ (-1))) ∨ (¬ ((x_6_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((x_4_6 + ((-1) * x_6_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10⟩
  linarith

theorem theory3160 (t x_0_2 x_0_4 x_1_2 x_1_4 x_2_3 x_3_8 x_4_5 x_5_9 x_8_10 x_9_10 : ℝ) : (¬ ((x_5_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((x_4_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_8_10) + x_9_10) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≥ 0)) ∨ (¬ ((x_3_8 + ((-1) * x_8_10)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_2_3)) ≤ (-1))) ∨ (¬ ((x_0_4 + ((-1) * x_1_4)) ≤ 0)) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_4)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_2_3 + ((-1) * x_3_8)) ≤ (-1))) ∨ (t ≥ 4) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10⟩
  linarith

theorem theory3161 (t x_0_1 x_0_6 x_1_2 x_1_4 x_1_6 x_6_8 : ℝ) : (t ≥ 4) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_4)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_4)) ≤ (-1))) ∨ (¬ ((x_0_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_1_6)) ≤ 0)) ∨ (¬ ((x_1_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_0_6)) ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3162 (t x_0_1 x_0_2 x_1_2 x_1_4 x_1_9 x_2_6 x_6_8 x_8_10 x_9_10 : ℝ) : (t ≥ 4) ∨ (¬ ((x_2_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_4)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_2_6)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≥ 0)) ∨ (¬ ((x_1_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_9)) ≥ 1)) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_4)) ≥ 1)) ∨ (¬ ((x_6_8 + ((-1) * x_8_10)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_8_10) + x_9_10) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3163 (t x_0_2 x_0_3 x_0_4 x_2_9 x_3_9 x_4_5 x_5_7 x_7_9 x_9_10 : ℝ) : (¬ ((t + ((-1) * x_2_9) + x_7_9) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_0_3)) ≤ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((x_3_9 + ((-1) * x_9_10)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((t + x_0_2 + ((-1) * x_0_4)) ≥ 1)) ∨ (¬ ((x_2_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_3 + ((-1) * x_3_9)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3164 (t x_0_2 x_0_3 x_0_4 x_2_3 x_3_8 x_3_9 x_4_5 x_5_7 x_7_9 : ℝ) : (¬ ((x_0_2 + ((-1) * x_0_3)) ≤ 0)) ∨ (¬ ((t + ((-1) * x_3_9) + x_7_9) ≥ 1)) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_8)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((t + x_0_2 + ((-1) * x_0_4)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_2_3 + ((-1) * x_3_9)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_3_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3165 (t x_0_2 x_0_4 x_2_3 x_3_7 x_4_5 x_5_7 x_7_8 x_7_9 : ℝ) : (¬ ((t + x_7_8 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_5_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((x_2_3 + ((-1) * x_3_7)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((t + x_0_2 + ((-1) * x_0_4)) ≥ 1)) ∨ (¬ ((x_3_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_2_3)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8⟩
  linarith

theorem theory3166 (t x_0_2 x_0_3 x_0_4 x_1_2 x_1_4 x_2_6 x_3_6 x_4_5 x_5_7 x_6_8 x_7_9 x_8_9 : ℝ) : (¬ ((x_0_4 + ((-1) * x_1_4)) ≤ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_0_3)) ≤ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_4)) ≥ 1)) ∨ (¬ ((x_2_6 + ((-1) * x_3_6)) ≥ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((t + x_7_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_2_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10, h11, h12⟩
  linarith

theorem theory3167 (t x_0_1 x_0_2 x_1_2 x_1_4 x_1_7 x_2_6 x_4_7 x_6_7 x_7_8 x_7_9 : ℝ) : (t ≥ 4) ∨ (¬ ((x_1_7 + ((-1) * x_4_7)) ≥ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_1_7)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_4)) ≤ (-1))) ∨ (¬ ((t + x_7_8 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≥ 0)) ∨ (¬ ((x_2_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_2_6)) ≤ (-1))) ∨ (¬ ((x_4_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_4)) ≥ 1)) ∨ (¬ ((x_6_7 + ((-1) * x_7_9)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10⟩
  linarith

theorem theory3171 (t x_2_4 x_4_6 x_4_7 x_6_7 x_6_9 : ℝ) : (¬ ((x_2_4 + ((-1) * x_4_6)) ≤ (-1))) ∨ (¬ ((x_4_7 + ((-1) * x_6_7)) ≥ 0)) ∨ (¬ ((t + x_6_7 + ((-1) * x_6_9)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((x_4_6 + ((-1) * x_6_9)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3172 (t x_0_2 x_0_3 x_2_5 x_3_8 x_5_6 x_6_10 x_8_9 x_9_10 : ℝ) : (¬ ((x_8_9 + ((-1) * x_9_10)) ≤ (-1))) ∨ (¬ ((t + x_6_10 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_2) + x_0_3) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_5)) ≥ 1)) ∨ (¬ ((x_3_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_8)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_5_6 + ((-1) * x_6_10)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8⟩
  linarith

theorem theory3173 (t x_2_4 x_4_6 x_4_7 x_5_7 x_6_10 x_6_7 : ℝ) : (¬ ((x_5_7 + ((-1) * x_6_7)) ≥ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_4_6)) ≤ (-1))) ∨ (¬ ((x_4_7 + ((-1) * x_5_7)) ≥ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((t + x_6_7 + ((-1) * x_6_10)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_4_6 + ((-1) * x_6_10)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3174 (t x_0_1 x_0_2 x_1_2 x_1_3 x_1_8 x_2_5 x_5_6 x_6_9 x_8_9 : ℝ) : (¬ ((x_0_2 + ((-1) * x_2_5)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_2_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≤ 0)) ∨ (¬ ((t + x_6_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_5_6 + ((-1) * x_6_9)) ≥ 1)) ∨ (¬ ((x_1_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_8)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3176 (t x_0_1 x_1_7 x_1_9 x_3_7 x_7_9 : ℝ) : (¬ ((x_3_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((t + x_1_7 + ((-1) * x_3_7)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_1 + ((-1) * x_1_9)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_7)) ≥ 1)) ∨ (¬ ((x_1_9 + ((-1) * x_7_9)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3177 (t x_0_2 x_0_3 x_2_4 x_3_9 x_4_6 x_6_9 x_8_9 x_9_10 : ℝ) : (¬ ((x_0_3 + ((-1) * x_3_9)) ≤ (-1))) ∨ (¬ ((t + x_6_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_4_6 + ((-1) * x_6_9)) ≥ 1)) ∨ (¬ ((x_2_4 + ((-1) * x_4_6)) ≥ 1)) ∨ (¬ ((x_8_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((x_3_9 + ((-1) * x_9_10)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_0_2) + x_0_3) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_4)) ≥ 1)) ∨ (t ≥ 4) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8⟩
  linarith

theorem theory3178 (t x_0_1 x_0_3 x_1_2 x_1_3 x_3_7 : ℝ) : (¬ ((x_0_1 + ((-1) * x_1_2)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_0_1 + ((-1) * x_0_3)) ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_7)) ≥ 1)) ∨ (¬ ((x_1_3 + ((-1) * x_3_7)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3179 (t x_0_1 x_1_3 x_1_4 x_3_4 x_3_7 : ℝ) : (¬ ((x_1_4 + ((-1) * x_3_4)) ≤ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_0_1 + ((-1) * x_1_4)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ (¬ ((x_1_3 + ((-1) * x_3_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_4) + x_3_7) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3180 (t x_0_1 x_0_5 x_1_2 x_1_3 x_1_5 x_5_7 : ℝ) : (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_0_5)) ≤ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_1_2 + ((-1) * x_1_5)) ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3181 (t x_0_2 x_0_3 x_1_2 x_1_3 x_2_4 x_3_7 x_4_9 x_7_8 x_8_10 x_9_10 : ℝ) : (¬ ((t + ((-1) * x_8_10) + x_9_10) ≥ 1)) ∨ (¬ ((x_2_4 + ((-1) * x_4_9)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_4)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_7)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_1_3)) ≥ 0)) ∨ (¬ ((x_3_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≤ 0)) ∨ (¬ ((x_4_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_7_8 + ((-1) * x_8_10)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10⟩
  linarith

theorem theory3182 (t x_1_7 x_2_4 x_4_7 x_4_9 x_7_9 : ℝ) : (¬ ((t + ((-1) * x_1_7) + x_4_7) ≥ 1)) ∨ (¬ ((x_1_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((x_2_4 + ((-1) * x_4_9)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_4_9 + ((-1) * x_7_9)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3184 (t x_0_1 x_0_5 x_1_2 x_1_3 x_1_5 x_5_9 : ℝ) : (t ≥ 4) ∨ (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_1_5)) ≥ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_0_5)) ≤ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_9)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3185 (t x_0_2 x_0_3 x_1_2 x_1_3 x_2_4 x_3_6 x_4_5 x_5_9 x_6_8 x_8_9 : ℝ) : (¬ ((t + x_5_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_1_3)) ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_4_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_3_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_2_4)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_2_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10⟩
  linarith

theorem theory3186 (t x_0_2 x_0_3 x_1_2 x_1_3 x_2_4 x_3_6 x_4_9 x_6_8 x_8_10 x_9_10 : ℝ) : (¬ ((t + ((-1) * x_1_2) + x_1_3) ≥ 1)) ∨ (¬ ((x_6_8 + ((-1) * x_8_10)) ≤ (-1))) ∨ (¬ ((x_3_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((t + ((-1) * x_8_10) + x_9_10) ≥ 1)) ∨ (¬ ((x_4_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_2 + ((-1) * x_1_2)) ≤ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_1_3)) ≥ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_4_9)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_4)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10⟩
  linarith

theorem theory3188 (t x_3_8 x_4_6 x_6_10 x_6_8 x_8_10 : ℝ) : (¬ ((t + ((-1) * x_3_8) + x_6_8) ≥ 1)) ∨ (¬ ((x_4_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((x_3_8 + ((-1) * x_8_10)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_4_6 + ((-1) * x_6_10)) ≤ (-1))) ∨ (¬ ((x_6_10 + ((-1) * x_8_10)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3189 (t x_0_1 x_0_4 x_1_5 x_2_4 x_4_6 x_4_8 x_5_7 x_7_8 : ℝ) : (¬ ((x_5_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((t + x_4_8 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_1_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_4_6)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_5)) ≤ (-1))) ∨ (¬ ((t + x_0_1 + ((-1) * x_0_4)) ≥ 1)) ∨ (¬ ((x_2_4 + ((-1) * x_4_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8⟩
  linarith

theorem theory3190 (t x_0_8 x_1_7 x_2_4 x_4_7 x_4_8 x_7_8 : ℝ) : (¬ ((t + ((-1) * x_1_7) + x_4_7) ≥ 1)) ∨ (¬ ((x_0_8 + ((-1) * x_7_8)) ≤ 0)) ∨ (¬ ((x_0_8 + ((-1) * x_4_8)) ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((x_2_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (¬ ((x_1_7 + ((-1) * x_7_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3191 (t x_0_3 x_3_4 x_3_5 x_4_5 x_4_8 : ℝ) : (¬ ((x_3_5 + ((-1) * x_4_5)) ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_3_5)) ≥ 1)) ∨ (¬ ((x_3_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (¬ ((t + x_4_5 + ((-1) * x_4_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3194 (t x_0_4 x_0_5 x_2_4 x_4_5 x_5_8 : ℝ) : (¬ ((x_0_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_0_5)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((t + ((-1) * x_0_4) + x_2_4) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3195 (t x_0_3 x_2_9 x_3_7 x_3_9 x_5_7 x_7_9 : ℝ) : (¬ ((x_2_9 + ((-1) * x_7_9)) ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_7)) ≤ (-1))) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((x_2_9 + ((-1) * x_3_9)) ≤ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_9)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((t + ((-1) * x_3_7) + x_5_7) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3198 (t x_1_5 x_1_7 x_5_6 x_5_7 x_7_9 : ℝ) : (¬ ((x_1_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((t + x_5_6 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_1_5 + ((-1) * x_1_7)) ≤ 0)) ∨ (¬ ((x_1_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3199 (t x_0_1 x_1_5 x_1_7 x_3_5 x_5_7 : ℝ) : (t ≥ 4) ∨ (¬ ((x_1_7 + ((-1) * x_5_7)) ≤ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_1_5)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_7)) ≤ (-1))) ∨ (¬ ((t + x_1_5 + ((-1) * x_3_5)) ≥ 1)) ∨ (¬ ((x_3_5 + ((-1) * x_5_7)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3201 (t x_0_1 x_1_5 x_1_9 x_3_5 x_5_9 : ℝ) : (¬ ((x_3_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_5)) ≥ 1)) ∨ (¬ ((x_1_9 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((t + x_1_5 + ((-1) * x_3_5)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_9)) ≤ (-1))) ∨ (t ≥ 4) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3203 (t x_0_2 x_0_3 x_0_4 x_2_4 x_3_6 x_4_7 x_4_9 x_6_8 x_8_9 : ℝ) : (¬ ((x_3_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_0_4 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((x_2_4 + ((-1) * x_4_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_2) + x_0_3) ≥ 1)) ∨ (¬ ((t + x_4_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_0_2 + ((-1) * x_0_4)) ≥ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8, h9⟩
  linarith

theorem theory3204 (x_0_1 x_0_4 x_0_6 : ℝ) : ((x_0_1 + ((-1) * x_0_6)) ≥ 0) ∨ (¬ ((x_0_4 + ((-1) * x_0_6)) ≥ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_0_4)) ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2⟩
  linarith

theorem theory3205 (t x_0_2 x_0_3 x_2_5 x_3_4 x_4_6 x_5_8 x_6_9 x_8_9 : ℝ) : (¬ ((t + ((-1) * x_6_9) + x_8_9) ≥ 1)) ∨ (¬ ((x_4_6 + ((-1) * x_6_9)) ≤ (-1))) ∨ (¬ ((x_3_4 + ((-1) * x_4_6)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((t + ((-1) * x_0_2) + x_0_3) ≥ 1)) ∨ (¬ ((x_5_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_5)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7, h8⟩
  linarith

theorem theory3206 (t x_3_5 x_5_7 x_5_8 x_7_10 x_7_8 : ℝ) : (¬ ((x_3_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (¬ ((x_3_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_7_8) + x_7_10) ≥ 1)) ∨ (¬ ((x_5_7 + ((-1) * x_7_10)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_5_8 + ((-1) * x_7_8)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3207 (t x_0_1 x_1_8 x_1_9 x_5_8 x_8_9 : ℝ) : (¬ ((x_0_1 + ((-1) * x_1_8)) ≥ 1)) ∨ (¬ ((x_5_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_9)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_1_9 + ((-1) * x_8_9)) ≤ 0)) ∨ (¬ ((t + x_1_8 + ((-1) * x_5_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3208 (t x_0_1 x_1_7 x_1_9 x_4_7 x_7_9 : ℝ) : (¬ ((t + ((-1) * x_1_7) + x_4_7) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_9)) ≥ 1)) ∨ (¬ ((x_4_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_1_9 + ((-1) * x_7_9)) ≥ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_1_7)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5⟩
  linarith

theorem theory3209 (t x_0_8 x_0_9 x_8_9 : ℝ) : (((((x_0_8 + ((-1) * x_0_9)) ≤ 0) ∧ ((x_0_9 + ((-1) * x_8_9)) ≤ 0) ∧ ((x_0_8 + ((-1) * x_8_9)) ≤ (-1)) ∧ ((t + x_0_8 + ((-1) * x_0_9)) ≥ 1) ∧ ((t + x_0_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (((x_0_9 + ((-1) * x_8_9)) ≥ 0) ∧ ((x_0_8 + ((-1) * x_0_9)) ≥ 0) ∧ ((x_0_8 + ((-1) * x_8_9)) ≥ 1) ∧ ((t + ((-1) * x_0_8) + x_0_9) ≥ 1) ∧ ((t + ((-1) * x_0_9) + x_8_9) ≥ 1))) ↔ ((¬ ((¬ ((x_0_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_0_9 + ((-1) * x_8_9)) ≤ 0)) ∨ (¬ ((x_0_8 + ((-1) * x_0_9)) ≤ 0)) ∨ (¬ ((t + x_0_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((t + x_0_8 + ((-1) * x_0_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_0_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_0_8 + ((-1) * x_0_9)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_0_8) + x_0_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_9) + x_8_9) ≥ 1)) ∨ (¬ ((x_0_9 + ((-1) * x_8_9)) ≥ 0)))))) := by
  classical
  have e0 : ((x_0_8 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * x_0_8 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_8 + ((-1) * x_0_9)) ≤ 0) ↔ (((1) * x_0_8 + (-1) * x_0_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_0_9 + ((-1) * x_8_9)) ≤ 0) ↔ (((1) * x_0_9 + (-1) * x_8_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_8 + ((-1) * x_8_9)) ≤ (-1)) ↔ (((1) * x_0_8 + (-1) * x_8_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_0_8 + ((-1) * x_0_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_8 + (-1) * x_0_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_0_9 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_9 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_9 + ((-1) * x_8_9)) ≥ 0) ↔ (¬ (((1) * x_0_9 + (-1) * x_8_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_8 + ((-1) * x_0_9)) ≥ 0) ↔ (¬ (((1) * x_0_8 + (-1) * x_0_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_0_8) + x_0_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_8 + (1) * x_0_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_0_9) + x_8_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_9 + (1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3210 (t x_0_2 x_1_2 x_2_6 x_2_8 x_6_7 : ℝ) : (¬ (x_6_7 ≥ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_2_6)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_8)) ≤ (-1))) ∨ (¬ ((x_1_2 + ((-1) * x_2_8)) ≥ 1)) ∨ (t ≥ 4) ∨ ((t + ((-1) * x_1_2)) ≤ 0) ∨ (¬ ((x_2_6 + ((-1) * x_6_7)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3211 (t x_2_6 x_2_7 x_6_7 : ℝ) : (((((x_2_6 + ((-1) * x_2_7)) ≤ 0) ∧ ((x_2_7 + ((-1) * x_6_7)) ≤ 0) ∧ ((x_2_6 + ((-1) * x_6_7)) ≤ (-1)) ∧ ((t + x_2_6 + ((-1) * x_2_7)) ≥ 1) ∧ ((t + x_2_7 + ((-1) * x_6_7)) ≥ 1)) ∨ (((x_2_7 + ((-1) * x_6_7)) ≥ 0) ∧ ((x_2_6 + ((-1) * x_2_7)) ≥ 0) ∧ ((x_2_6 + ((-1) * x_6_7)) ≥ 1) ∧ ((t + ((-1) * x_2_6) + x_2_7) ≥ 1) ∧ ((t + ((-1) * x_2_7) + x_6_7) ≥ 1))) ↔ ((¬ ((¬ ((x_2_7 + ((-1) * x_6_7)) ≤ 0)) ∨ (¬ ((x_2_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_2_6 + ((-1) * x_2_7)) ≤ 0)) ∨ (¬ ((t + x_2_6 + ((-1) * x_2_7)) ≥ 1)) ∨ (¬ ((t + x_2_7 + ((-1) * x_6_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_7 + ((-1) * x_6_7)) ≥ 0)) ∨ (¬ ((x_2_6 + ((-1) * x_2_7)) ≥ 0)) ∨ (¬ ((x_2_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_6) + x_2_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_7) + x_6_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_6 + ((-1) * x_6_7)) ≥ 1) ↔ (¬ (((1) * x_2_6 + (-1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_7 + ((-1) * x_6_7)) ≥ 0) ↔ (¬ (((1) * x_2_7 + (-1) * x_6_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_6 + ((-1) * x_2_7)) ≥ 0) ↔ (¬ (((1) * x_2_6 + (-1) * x_2_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_2_6) + x_2_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_6 + (1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_7) + x_6_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_7 + (1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_6 + ((-1) * x_2_7)) ≤ 0) ↔ (((1) * x_2_6 + (-1) * x_2_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_7 + ((-1) * x_6_7)) ≤ 0) ↔ (((1) * x_2_7 + (-1) * x_6_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_6 + ((-1) * x_6_7)) ≤ (-1)) ↔ (((1) * x_2_6 + (-1) * x_6_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_2_6 + ((-1) * x_2_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_6 + (-1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_7 + ((-1) * x_6_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_7 + (-1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3212 (t x_0_2 x_0_5 x_2_5 : ℝ) : (¬ (x_0_2 ≥ 0)) ∨ ((t + ((-1) * x_0_5)) ≤ 0) ∨ (¬ ((x_0_2 + ((-1) * x_2_5)) ≤ (-1))) ∨ ((t + ((-1) * x_0_5) + x_2_5) ≥ 1) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3213 (t x_0_5 x_0_6 x_5_6 : ℝ) : (((((x_0_5 + ((-1) * x_0_6)) ≤ 0) ∧ ((x_0_6 + ((-1) * x_5_6)) ≤ 0) ∧ ((x_0_5 + ((-1) * x_5_6)) ≤ (-1)) ∧ ((t + x_0_5 + ((-1) * x_0_6)) ≥ 1) ∧ ((t + x_0_6 + ((-1) * x_5_6)) ≥ 1)) ∨ (((x_0_6 + ((-1) * x_5_6)) ≥ 0) ∧ ((x_0_5 + ((-1) * x_0_6)) ≥ 0) ∧ ((x_0_5 + ((-1) * x_5_6)) ≥ 1) ∧ ((t + ((-1) * x_0_5) + x_0_6) ≥ 1) ∧ ((t + ((-1) * x_0_6) + x_5_6) ≥ 1))) ↔ ((¬ ((¬ ((t + x_0_6 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((t + x_0_5 + ((-1) * x_0_6)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_0_6)) ≤ 0)) ∨ (¬ ((x_0_6 + ((-1) * x_5_6)) ≤ 0)))) ∨ (¬ ((¬ ((t + ((-1) * x_0_6) + x_5_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_5) + x_0_6) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_0_6)) ≥ 0)) ∨ (¬ ((x_0_6 + ((-1) * x_5_6)) ≥ 0)))))) := by
  classical
  have e0 : ((x_0_5 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * x_0_5 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((t + ((-1) * x_0_6) + x_5_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_6 + (1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + ((-1) * x_0_5) + x_0_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_5 + (1) * x_0_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_5 + ((-1) * x_0_6)) ≥ 0) ↔ (¬ (((1) * x_0_5 + (-1) * x_0_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_0_6 + ((-1) * x_5_6)) ≥ 0) ↔ (¬ (((1) * x_0_6 + (-1) * x_5_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_5 + ((-1) * x_0_6)) ≤ 0) ↔ (((1) * x_0_5 + (-1) * x_0_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_6 + ((-1) * x_5_6)) ≤ 0) ↔ (((1) * x_0_6 + (-1) * x_5_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_5 + ((-1) * x_5_6)) ≤ (-1)) ↔ (((1) * x_0_5 + (-1) * x_5_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_0_5 + ((-1) * x_0_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_5 + (-1) * x_0_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_0_6 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_6 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3214 (t x_1_5 x_1_8 x_5_8 : ℝ) : (((((x_1_5 + ((-1) * x_1_8)) ≤ 0) ∧ ((x_1_8 + ((-1) * x_5_8)) ≤ 0) ∧ ((x_1_5 + ((-1) * x_5_8)) ≤ (-1)) ∧ ((t + x_1_5 + ((-1) * x_1_8)) ≥ 1) ∧ ((t + x_1_8 + ((-1) * x_5_8)) ≥ 1)) ∨ (((x_1_8 + ((-1) * x_5_8)) ≥ 0) ∧ ((x_1_5 + ((-1) * x_1_8)) ≥ 0) ∧ ((x_1_5 + ((-1) * x_5_8)) ≥ 1) ∧ ((t + ((-1) * x_1_5) + x_1_8) ≥ 1) ∧ ((t + ((-1) * x_1_8) + x_5_8) ≥ 1))) ↔ ((¬ ((¬ ((x_1_8 + ((-1) * x_5_8)) ≤ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (¬ ((x_1_5 + ((-1) * x_1_8)) ≤ 0)) ∨ (¬ ((t + x_1_5 + ((-1) * x_1_8)) ≥ 1)) ∨ (¬ ((t + x_1_8 + ((-1) * x_5_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_8 + ((-1) * x_5_8)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_1_8)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_5) + x_1_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_8) + x_5_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_5 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * x_1_5 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_5 + ((-1) * x_1_8)) ≤ 0) ↔ (((1) * x_1_5 + (-1) * x_1_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_8 + ((-1) * x_5_8)) ≤ 0) ↔ (((1) * x_1_8 + (-1) * x_5_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_1_5 + ((-1) * x_5_8)) ≤ (-1)) ↔ (((1) * x_1_5 + (-1) * x_5_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_1_5 + ((-1) * x_1_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_5 + (-1) * x_1_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_1_8 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_8 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_8 + ((-1) * x_5_8)) ≥ 0) ↔ (¬ (((1) * x_1_8 + (-1) * x_5_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_5 + ((-1) * x_1_8)) ≥ 0) ↔ (¬ (((1) * x_1_5 + (-1) * x_1_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_5) + x_1_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_5 + (1) * x_1_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_8) + x_5_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_8 + (1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3215 (t x_6_7 x_6_8 x_7_8 : ℝ) : (((((x_6_7 + ((-1) * x_6_8)) ≤ 0) ∧ ((x_6_8 + ((-1) * x_7_8)) ≤ 0) ∧ ((x_6_7 + ((-1) * x_7_8)) ≤ (-1)) ∧ ((t + x_6_7 + ((-1) * x_6_8)) ≥ 1) ∧ ((t + x_6_8 + ((-1) * x_7_8)) ≥ 1)) ∨ (((x_6_8 + ((-1) * x_7_8)) ≥ 0) ∧ ((x_6_7 + ((-1) * x_6_8)) ≥ 0) ∧ ((x_6_7 + ((-1) * x_7_8)) ≥ 1) ∧ ((t + ((-1) * x_6_7) + x_6_8) ≥ 1) ∧ ((t + ((-1) * x_6_8) + x_7_8) ≥ 1))) ↔ ((¬ ((¬ ((x_6_8 + ((-1) * x_7_8)) ≤ 0)) ∨ (¬ ((x_6_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((x_6_7 + ((-1) * x_6_8)) ≤ 0)) ∨ (¬ ((t + x_6_7 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((t + x_6_8 + ((-1) * x_7_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_6_8 + ((-1) * x_7_8)) ≥ 0)) ∨ (¬ ((x_6_7 + ((-1) * x_6_8)) ≥ 0)) ∨ (¬ ((x_6_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_6_7) + x_6_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_6_8) + x_7_8) ≥ 1)))))) := by
  classical
  have e0 : ((t + x_6_7 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_6_7 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_6_8 + ((-1) * x_7_8)) ≥ 0) ↔ (¬ (((1) * x_6_8 + (-1) * x_7_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_6_7 + ((-1) * x_6_8)) ≥ 0) ↔ (¬ (((1) * x_6_7 + (-1) * x_6_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_6_7 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * x_6_7 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_6_7) + x_6_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_6_7 + (1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + ((-1) * x_6_8) + x_7_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_6_8 + (1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_6_7 + ((-1) * x_6_8)) ≤ 0) ↔ (((1) * x_6_7 + (-1) * x_6_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_6_8 + ((-1) * x_7_8)) ≤ 0) ↔ (((1) * x_6_8 + (-1) * x_7_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((x_6_7 + ((-1) * x_7_8)) ≤ (-1)) ↔ (((1) * x_6_7 + (-1) * x_7_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_6_8 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_6_8 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3216 (t x_5_6 x_5_8 x_6_8 : ℝ) : (((((x_5_6 + ((-1) * x_5_8)) ≤ 0) ∧ ((x_5_8 + ((-1) * x_6_8)) ≤ 0) ∧ ((x_5_6 + ((-1) * x_6_8)) ≤ (-1)) ∧ ((t + x_5_6 + ((-1) * x_5_8)) ≥ 1) ∧ ((t + x_5_8 + ((-1) * x_6_8)) ≥ 1)) ∨ (((x_5_8 + ((-1) * x_6_8)) ≥ 0) ∧ ((x_5_6 + ((-1) * x_5_8)) ≥ 0) ∧ ((x_5_6 + ((-1) * x_6_8)) ≥ 1) ∧ ((t + ((-1) * x_5_6) + x_5_8) ≥ 1) ∧ ((t + ((-1) * x_5_8) + x_6_8) ≥ 1))) ↔ ((¬ ((¬ ((x_5_8 + ((-1) * x_6_8)) ≤ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_5_6 + ((-1) * x_5_8)) ≤ 0)) ∨ (¬ ((t + x_5_6 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((t + x_5_8 + ((-1) * x_6_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_5_8 + ((-1) * x_6_8)) ≥ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_5_8)) ≥ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_6) + x_5_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_8) + x_6_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_5_8 + ((-1) * x_6_8)) ≤ 0) ↔ (((1) * x_5_8 + (-1) * x_6_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_5_6 + ((-1) * x_6_8)) ≤ (-1)) ↔ (((1) * x_5_6 + (-1) * x_6_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_5_6 + ((-1) * x_5_8)) ≤ 0) ↔ (((1) * x_5_6 + (-1) * x_5_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_5_6 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_6 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_5_8 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_8 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_5_6 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * x_5_6 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_5_8 + ((-1) * x_6_8)) ≥ 0) ↔ (¬ (((1) * x_5_8 + (-1) * x_6_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_5_6 + ((-1) * x_5_8)) ≥ 0) ↔ (¬ (((1) * x_5_6 + (-1) * x_5_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_5_6) + x_5_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_6 + (1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_5_8) + x_6_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_8 + (1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3217 (t x_1_5 x_1_6 x_5_6 : ℝ) : (((((x_1_5 + ((-1) * x_1_6)) ≤ 0) ∧ ((x_1_6 + ((-1) * x_5_6)) ≤ 0) ∧ ((x_1_5 + ((-1) * x_5_6)) ≤ (-1)) ∧ ((t + x_1_5 + ((-1) * x_1_6)) ≥ 1) ∧ ((t + x_1_6 + ((-1) * x_5_6)) ≥ 1)) ∨ (((x_1_6 + ((-1) * x_5_6)) ≥ 0) ∧ ((x_1_5 + ((-1) * x_1_6)) ≥ 0) ∧ ((x_1_5 + ((-1) * x_5_6)) ≥ 1) ∧ ((t + ((-1) * x_1_5) + x_1_6) ≥ 1) ∧ ((t + ((-1) * x_1_6) + x_5_6) ≥ 1))) ↔ ((¬ ((¬ ((x_1_5 + ((-1) * x_1_6)) ≤ 0)) ∨ (¬ ((x_1_6 + ((-1) * x_5_6)) ≤ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((t + x_1_5 + ((-1) * x_1_6)) ≥ 1)) ∨ (¬ ((t + x_1_6 + ((-1) * x_5_6)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_6 + ((-1) * x_5_6)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_1_6)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_5) + x_1_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_6) + x_5_6) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_5 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * x_1_5 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_6 + ((-1) * x_5_6)) ≥ 0) ↔ (¬ (((1) * x_1_6 + (-1) * x_5_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_5 + ((-1) * x_1_6)) ≥ 0) ↔ (¬ (((1) * x_1_5 + (-1) * x_1_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_1_5) + x_1_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_5 + (1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_1_6) + x_5_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_6 + (1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_5 + ((-1) * x_1_6)) ≤ 0) ↔ (((1) * x_1_5 + (-1) * x_1_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_6 + ((-1) * x_5_6)) ≤ 0) ↔ (((1) * x_1_6 + (-1) * x_5_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_5 + ((-1) * x_5_6)) ≤ (-1)) ↔ (((1) * x_1_5 + (-1) * x_5_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_1_5 + ((-1) * x_1_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_5 + (-1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_1_6 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_6 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3218 (t x_0_1 x_1_3 x_1_5 x_4_5 x_5_6 : ℝ) : (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ ((t + ((-1) * x_4_5)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ (x_1_3 ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_5)) ≤ (-1))) ∨ (¬ ((x_1_5 + ((-1) * x_5_6)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3219 (t x_0_1 x_0_5 x_1_5 : ℝ) : (((((x_0_1 + ((-1) * x_0_5)) ≤ 0) ∧ ((x_0_5 + ((-1) * x_1_5)) ≤ 0) ∧ ((x_0_1 + ((-1) * x_1_5)) ≤ (-1)) ∧ ((t + x_0_1 + ((-1) * x_0_5)) ≥ 1) ∧ ((t + x_0_5 + ((-1) * x_1_5)) ≥ 1)) ∨ (((x_0_5 + ((-1) * x_1_5)) ≥ 0) ∧ ((x_0_1 + ((-1) * x_0_5)) ≥ 0) ∧ ((x_0_1 + ((-1) * x_1_5)) ≥ 1) ∧ ((t + ((-1) * x_0_1) + x_0_5) ≥ 1) ∧ ((t + ((-1) * x_0_5) + x_1_5) ≥ 1))) ↔ ((¬ ((¬ ((x_0_1 + ((-1) * x_0_5)) ≤ 0)) ∨ (¬ ((x_0_5 + ((-1) * x_1_5)) ≤ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_1_5)) ≤ (-1))) ∨ (¬ ((t + x_0_1 + ((-1) * x_0_5)) ≥ 1)) ∨ (¬ ((t + x_0_5 + ((-1) * x_1_5)) ≥ 1)))) ∨ (¬ ((¬ ((x_0_1 + ((-1) * x_1_5)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_1) + x_0_5) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_1_5)) ≥ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_0_5)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_0_5) + x_1_5) ≥ 1)))))) := by
  classical
  have e0 : ((x_0_1 + ((-1) * x_1_5)) ≤ (-1)) ↔ (((1) * x_0_1 + (-1) * x_1_5 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_1 + ((-1) * x_0_5)) ≤ 0) ↔ (((1) * x_0_1 + (-1) * x_0_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_0_5 + ((-1) * x_1_5)) ≤ 0) ↔ (((1) * x_0_5 + (-1) * x_1_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_0_1 + ((-1) * x_0_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_1 + (-1) * x_0_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_0_5 + ((-1) * x_1_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_5 + (-1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_1 + ((-1) * x_1_5)) ≥ 1) ↔ (¬ (((1) * x_0_1 + (-1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_5 + ((-1) * x_1_5)) ≥ 0) ↔ (¬ (((1) * x_0_5 + (-1) * x_1_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_1 + ((-1) * x_0_5)) ≥ 0) ↔ (¬ (((1) * x_0_1 + (-1) * x_0_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_0_1) + x_0_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_1 + (1) * x_0_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_0_5) + x_1_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_5 + (1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3220 (x_0_5 x_0_8 x_1_5 x_5_8 : ℝ) : (¬ ((x_0_5 + ((-1) * x_1_5)) ≥ 0)) ∨ (¬ ((x_0_5 + ((-1) * x_0_8)) ≤ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((x_0_8 + ((-1) * x_5_8)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3221 (t x_0_5 x_0_8 x_5_8 : ℝ) : (((((x_0_5 + ((-1) * x_0_8)) ≤ 0) ∧ ((x_0_8 + ((-1) * x_5_8)) ≤ 0) ∧ ((x_0_5 + ((-1) * x_5_8)) ≤ (-1)) ∧ ((t + x_0_5 + ((-1) * x_0_8)) ≥ 1) ∧ ((t + x_0_8 + ((-1) * x_5_8)) ≥ 1)) ∨ (((x_0_8 + ((-1) * x_5_8)) ≥ 0) ∧ ((x_0_5 + ((-1) * x_0_8)) ≥ 0) ∧ ((x_0_5 + ((-1) * x_5_8)) ≥ 1) ∧ ((t + ((-1) * x_0_5) + x_0_8) ≥ 1) ∧ ((t + ((-1) * x_0_8) + x_5_8) ≥ 1))) ↔ ((¬ ((¬ ((x_0_5 + ((-1) * x_0_8)) ≤ 0)) ∨ (¬ ((x_0_8 + ((-1) * x_5_8)) ≤ 0)) ∨ (¬ ((x_0_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (¬ ((t + x_0_8 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((t + x_0_5 + ((-1) * x_0_8)) ≥ 1)))) ∨ (¬ ((¬ ((t + ((-1) * x_0_5) + x_0_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_8) + x_5_8) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_0_8)) ≥ 0)) ∨ (¬ ((x_0_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((x_0_8 + ((-1) * x_5_8)) ≥ 0)))))) := by
  classical
  have e0 : ((x_0_5 + ((-1) * x_0_8)) ≤ 0) ↔ (((1) * x_0_5 + (-1) * x_0_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_8 + ((-1) * x_5_8)) ≤ 0) ↔ (((1) * x_0_8 + (-1) * x_5_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_0_5 + ((-1) * x_5_8)) ≤ (-1)) ↔ (((1) * x_0_5 + (-1) * x_5_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_0_8 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_8 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_0_5 + ((-1) * x_0_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_5 + (-1) * x_0_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_5 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * x_0_5 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_8 + ((-1) * x_5_8)) ≥ 0) ↔ (¬ (((1) * x_0_8 + (-1) * x_5_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_5 + ((-1) * x_0_8)) ≥ 0) ↔ (¬ (((1) * x_0_5 + (-1) * x_0_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_0_5) + x_0_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_5 + (1) * x_0_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_0_8) + x_5_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_8 + (1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3222 (t x_0_4 x_0_5 x_4_5 : ℝ) : (((((x_0_4 + ((-1) * x_0_5)) ≤ 0) ∧ ((x_0_5 + ((-1) * x_4_5)) ≤ 0) ∧ ((x_0_4 + ((-1) * x_4_5)) ≤ (-1)) ∧ ((t + x_0_4 + ((-1) * x_0_5)) ≥ 1) ∧ ((t + x_0_5 + ((-1) * x_4_5)) ≥ 1)) ∨ (((x_0_5 + ((-1) * x_4_5)) ≥ 0) ∧ ((x_0_4 + ((-1) * x_0_5)) ≥ 0) ∧ ((x_0_4 + ((-1) * x_4_5)) ≥ 1) ∧ ((t + ((-1) * x_0_4) + x_0_5) ≥ 1) ∧ ((t + ((-1) * x_0_5) + x_4_5) ≥ 1))) ↔ ((¬ ((¬ ((x_0_5 + ((-1) * x_4_5)) ≤ 0)) ∨ (¬ ((t + x_0_4 + ((-1) * x_0_5)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((t + x_0_5 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_0_5)) ≤ 0)))) ∨ (¬ ((¬ ((t + ((-1) * x_0_4) + x_0_5) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_5) + x_4_5) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_4_5)) ≥ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_0_5)) ≥ 0)))))) := by
  classical
  have e0 : ((t + x_0_5 + ((-1) * x_4_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_5 + (-1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((t + ((-1) * x_0_4) + x_0_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_4 + (1) * x_0_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + ((-1) * x_0_5) + x_4_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_5 + (1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_5 + ((-1) * x_4_5)) ≥ 0) ↔ (¬ (((1) * x_0_5 + (-1) * x_4_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_0_4 + ((-1) * x_4_5)) ≥ 1) ↔ (¬ (((1) * x_0_4 + (-1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_4 + ((-1) * x_0_5)) ≥ 0) ↔ (¬ (((1) * x_0_4 + (-1) * x_0_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_4 + ((-1) * x_0_5)) ≤ 0) ↔ (((1) * x_0_4 + (-1) * x_0_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_5 + ((-1) * x_4_5)) ≤ 0) ↔ (((1) * x_0_5 + (-1) * x_4_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((x_0_4 + ((-1) * x_4_5)) ≤ (-1)) ↔ (((1) * x_0_4 + (-1) * x_4_5 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_0_4 + ((-1) * x_0_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_4 + (-1) * x_0_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3223 (t x_0_4 x_0_5 x_4_5 : ℝ) : (¬ (x_0_5 ≥ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ ((t + ((-1) * x_0_4)) ≤ 0) ∨ ((t + x_0_5 + ((-1) * x_4_5)) ≥ 1) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3224 (t x_3_7 x_3_8 x_7_8 : ℝ) : (((((x_3_7 + ((-1) * x_3_8)) ≤ 0) ∧ ((x_3_8 + ((-1) * x_7_8)) ≤ 0) ∧ ((x_3_7 + ((-1) * x_7_8)) ≤ (-1)) ∧ ((t + x_3_7 + ((-1) * x_3_8)) ≥ 1) ∧ ((t + x_3_8 + ((-1) * x_7_8)) ≥ 1)) ∨ (((x_3_8 + ((-1) * x_7_8)) ≥ 0) ∧ ((x_3_7 + ((-1) * x_3_8)) ≥ 0) ∧ ((x_3_7 + ((-1) * x_7_8)) ≥ 1) ∧ ((t + ((-1) * x_3_7) + x_3_8) ≥ 1) ∧ ((t + ((-1) * x_3_8) + x_7_8) ≥ 1))) ↔ ((¬ ((¬ ((x_3_8 + ((-1) * x_7_8)) ≤ 0)) ∨ (¬ ((x_3_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((x_3_7 + ((-1) * x_3_8)) ≤ 0)) ∨ (¬ ((t + x_3_7 + ((-1) * x_3_8)) ≥ 1)) ∨ (¬ ((t + x_3_8 + ((-1) * x_7_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_8 + ((-1) * x_7_8)) ≥ 0)) ∨ (¬ ((x_3_7 + ((-1) * x_3_8)) ≥ 0)) ∨ (¬ ((x_3_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_7) + x_3_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_8) + x_7_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_7 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * x_3_7 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_7 + ((-1) * x_3_8)) ≤ 0) ↔ (((1) * x_3_7 + (-1) * x_3_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_8 + ((-1) * x_7_8)) ≤ 0) ↔ (((1) * x_3_8 + (-1) * x_7_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_3_7 + ((-1) * x_7_8)) ≤ (-1)) ↔ (((1) * x_3_7 + (-1) * x_7_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_3_7 + ((-1) * x_3_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_7 + (-1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_3_8 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_8 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_8 + ((-1) * x_7_8)) ≥ 0) ↔ (¬ (((1) * x_3_8 + (-1) * x_7_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_7 + ((-1) * x_3_8)) ≥ 0) ↔ (¬ (((1) * x_3_7 + (-1) * x_3_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_3_7) + x_3_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_7 + (1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_3_8) + x_7_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_8 + (1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3225 (t x_5_6 x_5_7 x_6_7 : ℝ) : (((((x_5_6 + ((-1) * x_5_7)) ≤ 0) ∧ ((x_5_7 + ((-1) * x_6_7)) ≤ 0) ∧ ((x_5_6 + ((-1) * x_6_7)) ≤ (-1)) ∧ ((t + x_5_6 + ((-1) * x_5_7)) ≥ 1) ∧ ((t + x_5_7 + ((-1) * x_6_7)) ≥ 1)) ∨ (((x_5_7 + ((-1) * x_6_7)) ≥ 0) ∧ ((x_5_6 + ((-1) * x_5_7)) ≥ 0) ∧ ((x_5_6 + ((-1) * x_6_7)) ≥ 1) ∧ ((t + ((-1) * x_5_6) + x_5_7) ≥ 1) ∧ ((t + ((-1) * x_5_7) + x_6_7) ≥ 1))) ↔ ((¬ ((¬ ((x_5_7 + ((-1) * x_6_7)) ≤ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_5_6 + ((-1) * x_5_7)) ≤ 0)) ∨ (¬ ((t + x_5_6 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((t + x_5_7 + ((-1) * x_6_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_5_7 + ((-1) * x_6_7)) ≥ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_5_7)) ≥ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_6) + x_5_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_7) + x_6_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_5_6 + ((-1) * x_6_7)) ≥ 1) ↔ (¬ (((1) * x_5_6 + (-1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_5_7 + ((-1) * x_6_7)) ≥ 0) ↔ (¬ (((1) * x_5_7 + (-1) * x_6_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_5_6 + ((-1) * x_5_7)) ≥ 0) ↔ (¬ (((1) * x_5_6 + (-1) * x_5_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_5_6) + x_5_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_6 + (1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_5_7) + x_6_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_7 + (1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_5_6 + ((-1) * x_5_7)) ≤ 0) ↔ (((1) * x_5_6 + (-1) * x_5_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_5_7 + ((-1) * x_6_7)) ≤ 0) ↔ (((1) * x_5_7 + (-1) * x_6_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_5_6 + ((-1) * x_6_7)) ≤ (-1)) ↔ (((1) * x_5_6 + (-1) * x_6_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_5_6 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_6 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_5_7 + ((-1) * x_6_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_7 + (-1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3226 (t x_3_5 x_3_6 x_5_6 : ℝ) : (((((x_3_5 + ((-1) * x_3_6)) ≤ 0) ∧ ((x_3_6 + ((-1) * x_5_6)) ≤ 0) ∧ ((x_3_5 + ((-1) * x_5_6)) ≤ (-1)) ∧ ((t + x_3_5 + ((-1) * x_3_6)) ≥ 1) ∧ ((t + x_3_6 + ((-1) * x_5_6)) ≥ 1)) ∨ (((x_3_6 + ((-1) * x_5_6)) ≥ 0) ∧ ((x_3_5 + ((-1) * x_3_6)) ≥ 0) ∧ ((x_3_5 + ((-1) * x_5_6)) ≥ 1) ∧ ((t + ((-1) * x_3_5) + x_3_6) ≥ 1) ∧ ((t + ((-1) * x_3_6) + x_5_6) ≥ 1))) ↔ ((¬ ((¬ ((x_3_6 + ((-1) * x_5_6)) ≤ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((x_3_5 + ((-1) * x_3_6)) ≤ 0)) ∨ (¬ ((t + x_3_5 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((t + x_3_6 + ((-1) * x_5_6)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_6 + ((-1) * x_5_6)) ≥ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_3_6)) ≥ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_5) + x_3_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_6) + x_5_6) ≥ 1)))))) := by
  classical
  have e0 : ((t + ((-1) * x_3_6) + x_5_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_6 + (1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_6 + ((-1) * x_5_6)) ≤ 0) ↔ (((1) * x_3_6 + (-1) * x_5_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_5 + ((-1) * x_5_6)) ≤ (-1)) ↔ (((1) * x_3_5 + (-1) * x_5_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_3_5 + ((-1) * x_3_6)) ≤ 0) ↔ (((1) * x_3_5 + (-1) * x_3_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_3_5 + ((-1) * x_3_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_5 + (-1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_3_6 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_6 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_5 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * x_3_5 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_6 + ((-1) * x_5_6)) ≥ 0) ↔ (¬ (((1) * x_3_6 + (-1) * x_5_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((x_3_5 + ((-1) * x_3_6)) ≥ 0) ↔ (¬ (((1) * x_3_5 + (-1) * x_3_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_3_5) + x_3_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_5 + (1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3227 (t x_3_5 x_3_6 x_5_6 : ℝ) : (¬ (x_3_5 ≥ 0)) ∨ ((t + ((-1) * x_3_6)) ≤ 0) ∨ (¬ ((x_3_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ ((t + ((-1) * x_3_6) + x_5_6) ≥ 1) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3228 (t x_3_6 x_3_7 x_6_7 : ℝ) : (((((x_3_6 + ((-1) * x_3_7)) ≤ 0) ∧ ((x_3_7 + ((-1) * x_6_7)) ≤ 0) ∧ ((x_3_6 + ((-1) * x_6_7)) ≤ (-1)) ∧ ((t + x_3_6 + ((-1) * x_3_7)) ≥ 1) ∧ ((t + x_3_7 + ((-1) * x_6_7)) ≥ 1)) ∨ (((x_3_7 + ((-1) * x_6_7)) ≥ 0) ∧ ((x_3_6 + ((-1) * x_3_7)) ≥ 0) ∧ ((x_3_6 + ((-1) * x_6_7)) ≥ 1) ∧ ((t + ((-1) * x_3_6) + x_3_7) ≥ 1) ∧ ((t + ((-1) * x_3_7) + x_6_7) ≥ 1))) ↔ ((¬ ((¬ ((x_3_7 + ((-1) * x_6_7)) ≤ 0)) ∨ (¬ ((x_3_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_3_6 + ((-1) * x_3_7)) ≤ 0)) ∨ (¬ ((t + x_3_6 + ((-1) * x_3_7)) ≥ 1)) ∨ (¬ ((t + x_3_7 + ((-1) * x_6_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_7 + ((-1) * x_6_7)) ≥ 0)) ∨ (¬ ((x_3_6 + ((-1) * x_3_7)) ≥ 0)) ∨ (¬ ((x_3_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_6) + x_3_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_7) + x_6_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_6 + ((-1) * x_3_7)) ≥ 0) ↔ (¬ (((1) * x_3_6 + (-1) * x_3_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_7 + ((-1) * x_6_7)) ≥ 0) ↔ (¬ (((1) * x_3_7 + (-1) * x_6_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_6 + ((-1) * x_6_7)) ≥ 1) ↔ (¬ (((1) * x_3_6 + (-1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_3_6) + x_3_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_6 + (1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_3_7) + x_6_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_7 + (1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_3_6 + ((-1) * x_3_7)) ≤ 0) ↔ (((1) * x_3_6 + (-1) * x_3_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_7 + ((-1) * x_6_7)) ≤ 0) ↔ (((1) * x_3_7 + (-1) * x_6_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_6 + ((-1) * x_6_7)) ≤ (-1)) ↔ (((1) * x_3_6 + (-1) * x_6_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_3_6 + ((-1) * x_3_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_6 + (-1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_3_7 + ((-1) * x_6_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_7 + (-1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3229 (t x_0_3 x_0_6 x_3_6 : ℝ) : (((((x_0_3 + ((-1) * x_0_6)) ≤ 0) ∧ ((x_0_6 + ((-1) * x_3_6)) ≤ 0) ∧ ((x_0_3 + ((-1) * x_3_6)) ≤ (-1)) ∧ ((t + x_0_3 + ((-1) * x_0_6)) ≥ 1) ∧ ((t + x_0_6 + ((-1) * x_3_6)) ≥ 1)) ∨ (((x_0_6 + ((-1) * x_3_6)) ≥ 0) ∧ ((x_0_3 + ((-1) * x_0_6)) ≥ 0) ∧ ((x_0_3 + ((-1) * x_3_6)) ≥ 1) ∧ ((t + ((-1) * x_0_3) + x_0_6) ≥ 1) ∧ ((t + ((-1) * x_0_6) + x_3_6) ≥ 1))) ↔ ((¬ ((¬ ((x_0_6 + ((-1) * x_3_6)) ≤ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_0_6)) ≤ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((t + x_0_3 + ((-1) * x_0_6)) ≥ 1)) ∨ (¬ ((t + x_0_6 + ((-1) * x_3_6)) ≥ 1)))) ∨ (¬ ((¬ ((x_0_6 + ((-1) * x_3_6)) ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_0_6)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_0_3) + x_0_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_6) + x_3_6) ≥ 1)))))) := by
  classical
  have e0 : ((x_0_6 + ((-1) * x_3_6)) ≥ 0) ↔ (¬ (((1) * x_0_6 + (-1) * x_3_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_3 + ((-1) * x_3_6)) ≥ 1) ↔ (¬ (((1) * x_0_3 + (-1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_0_3 + ((-1) * x_0_6)) ≥ 0) ↔ (¬ (((1) * x_0_3 + (-1) * x_0_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_0_3) + x_0_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_3 + (1) * x_0_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_0_6) + x_3_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_6 + (1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_3 + ((-1) * x_0_6)) ≤ 0) ↔ (((1) * x_0_3 + (-1) * x_0_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_6 + ((-1) * x_3_6)) ≤ 0) ↔ (((1) * x_0_6 + (-1) * x_3_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_3 + ((-1) * x_3_6)) ≤ (-1)) ↔ (((1) * x_0_3 + (-1) * x_3_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_0_3 + ((-1) * x_0_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_3 + (-1) * x_0_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_0_6 + ((-1) * x_3_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_6 + (-1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3230 (t x_0_7 x_0_8 x_7_8 : ℝ) : (((((x_0_7 + ((-1) * x_0_8)) ≤ 0) ∧ ((x_0_8 + ((-1) * x_7_8)) ≤ 0) ∧ ((x_0_7 + ((-1) * x_7_8)) ≤ (-1)) ∧ ((t + x_0_7 + ((-1) * x_0_8)) ≥ 1) ∧ ((t + x_0_8 + ((-1) * x_7_8)) ≥ 1)) ∨ (((x_0_8 + ((-1) * x_7_8)) ≥ 0) ∧ ((x_0_7 + ((-1) * x_0_8)) ≥ 0) ∧ ((x_0_7 + ((-1) * x_7_8)) ≥ 1) ∧ ((t + ((-1) * x_0_7) + x_0_8) ≥ 1) ∧ ((t + ((-1) * x_0_8) + x_7_8) ≥ 1))) ↔ ((¬ ((¬ ((x_0_7 + ((-1) * x_0_8)) ≤ 0)) ∨ (¬ ((x_0_8 + ((-1) * x_7_8)) ≤ 0)) ∨ (¬ ((t + x_0_7 + ((-1) * x_0_8)) ≥ 1)) ∨ (¬ ((x_0_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((t + x_0_8 + ((-1) * x_7_8)) ≥ 1)))) ∨ (¬ ((¬ ((t + ((-1) * x_0_7) + x_0_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_8) + x_7_8) ≥ 1)) ∨ (¬ ((x_0_8 + ((-1) * x_7_8)) ≥ 0)) ∨ (¬ ((x_0_7 + ((-1) * x_0_8)) ≥ 0)) ∨ (¬ ((x_0_7 + ((-1) * x_7_8)) ≥ 1)))))) := by
  classical
  have e0 : ((x_0_7 + ((-1) * x_7_8)) ≤ (-1)) ↔ (((1) * x_0_7 + (-1) * x_7_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_7 + ((-1) * x_0_8)) ≤ 0) ↔ (((1) * x_0_7 + (-1) * x_0_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_0_8 + ((-1) * x_7_8)) ≤ 0) ↔ (((1) * x_0_8 + (-1) * x_7_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_0_7 + ((-1) * x_0_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_7 + (-1) * x_0_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_0_8 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_8 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_7 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * x_0_7 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_8 + ((-1) * x_7_8)) ≥ 0) ↔ (¬ (((1) * x_0_8 + (-1) * x_7_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_7 + ((-1) * x_0_8)) ≥ 0) ↔ (¬ (((1) * x_0_7 + (-1) * x_0_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_0_7) + x_0_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_7 + (1) * x_0_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_0_8) + x_7_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_8 + (1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3231 (t x_4_6 x_4_8 x_6_8 : ℝ) : (((((x_4_6 + ((-1) * x_4_8)) ≤ 0) ∧ ((x_4_8 + ((-1) * x_6_8)) ≤ 0) ∧ ((x_4_6 + ((-1) * x_6_8)) ≤ (-1)) ∧ ((t + x_4_6 + ((-1) * x_4_8)) ≥ 1) ∧ ((t + x_4_8 + ((-1) * x_6_8)) ≥ 1)) ∨ (((x_4_8 + ((-1) * x_6_8)) ≥ 0) ∧ ((x_4_6 + ((-1) * x_4_8)) ≥ 0) ∧ ((x_4_6 + ((-1) * x_6_8)) ≥ 1) ∧ ((t + ((-1) * x_4_6) + x_4_8) ≥ 1) ∧ ((t + ((-1) * x_4_8) + x_6_8) ≥ 1))) ↔ ((¬ ((¬ ((x_4_8 + ((-1) * x_6_8)) ≤ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_4_6 + ((-1) * x_4_8)) ≤ 0)) ∨ (¬ ((t + x_4_6 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((t + x_4_8 + ((-1) * x_6_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_8 + ((-1) * x_6_8)) ≥ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_4_8)) ≥ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_6) + x_4_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_8) + x_6_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_4_6 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * x_4_6 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_8 + ((-1) * x_6_8)) ≤ 0) ↔ (((1) * x_4_8 + (-1) * x_6_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_6 + ((-1) * x_6_8)) ≤ (-1)) ↔ (((1) * x_4_6 + (-1) * x_6_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_4_6 + ((-1) * x_4_8)) ≤ 0) ↔ (((1) * x_4_6 + (-1) * x_4_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_4_6 + ((-1) * x_4_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_6 + (-1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_4_8 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_8 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_4_8 + ((-1) * x_6_8)) ≥ 0) ↔ (¬ (((1) * x_4_8 + (-1) * x_6_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_4_6 + ((-1) * x_4_8)) ≥ 0) ↔ (¬ (((1) * x_4_6 + (-1) * x_4_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_4_6) + x_4_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_6 + (1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_4_8) + x_6_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_8 + (1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3232 (t x_0_4 x_4_6 x_5_6 x_6_7 x_6_8 : ℝ) : (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) ∨ (¬ ((x_5_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (t ≥ 4) ∨ ((t + ((-1) * x_0_4)) ≤ 0) ∨ (¬ ((x_5_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ (x_6_7 ≥ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_6_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3233 (t x_3_6 x_3_7 x_6_7 : ℝ) : (¬ (x_3_6 ≥ 0)) ∨ ((t + ((-1) * x_3_7) + x_6_7) ≥ 1) ∨ (¬ ((x_3_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ ((t + ((-1) * x_3_7)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3234 (t x_6_8 x_6_9 x_8_9 : ℝ) : (((((x_6_8 + ((-1) * x_6_9)) ≤ 0) ∧ ((x_6_9 + ((-1) * x_8_9)) ≤ 0) ∧ ((x_6_8 + ((-1) * x_8_9)) ≤ (-1)) ∧ ((t + x_6_8 + ((-1) * x_6_9)) ≥ 1) ∧ ((t + x_6_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (((x_6_9 + ((-1) * x_8_9)) ≥ 0) ∧ ((x_6_8 + ((-1) * x_6_9)) ≥ 0) ∧ ((x_6_8 + ((-1) * x_8_9)) ≥ 1) ∧ ((t + ((-1) * x_6_8) + x_6_9) ≥ 1) ∧ ((t + ((-1) * x_6_9) + x_8_9) ≥ 1))) ↔ ((¬ ((¬ ((x_6_9 + ((-1) * x_8_9)) ≤ 0)) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_6_8 + ((-1) * x_6_9)) ≤ 0)) ∨ (¬ ((t + x_6_8 + ((-1) * x_6_9)) ≥ 1)) ∨ (¬ ((t + x_6_9 + ((-1) * x_8_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_6_9 + ((-1) * x_8_9)) ≥ 0)) ∨ (¬ ((x_6_8 + ((-1) * x_6_9)) ≥ 0)) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_6_8) + x_6_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_6_9) + x_8_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_6_8 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * x_6_8 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_6_8 + ((-1) * x_6_9)) ≤ 0) ↔ (((1) * x_6_8 + (-1) * x_6_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_6_9 + ((-1) * x_8_9)) ≤ 0) ↔ (((1) * x_6_9 + (-1) * x_8_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_6_8 + ((-1) * x_8_9)) ≤ (-1)) ↔ (((1) * x_6_8 + (-1) * x_8_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_6_8 + ((-1) * x_6_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_6_8 + (-1) * x_6_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_6_9 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_6_9 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_6_9 + ((-1) * x_8_9)) ≥ 0) ↔ (¬ (((1) * x_6_9 + (-1) * x_8_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_6_8 + ((-1) * x_6_9)) ≥ 0) ↔ (¬ (((1) * x_6_8 + (-1) * x_6_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_6_8) + x_6_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_6_8 + (1) * x_6_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_6_9) + x_8_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_6_9 + (1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3235 (t x_0_4 x_4_5 x_5_8 x_6_8 x_8_9 : ℝ) : (t ≥ 4) ∨ ((t + ((-1) * x_0_4)) ≤ 0) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_4_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((x_5_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ (x_6_8 ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3236 (t x_0_4 x_4_5 x_5_6 x_6_8 x_8_9 : ℝ) : (¬ ((x_4_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (t ≥ 4) ∨ ((t + ((-1) * x_0_4)) ≤ 0) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_5_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ (x_8_9 ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3237 (t x_4_5 x_4_8 x_5_8 : ℝ) : (((((x_4_5 + ((-1) * x_4_8)) ≤ 0) ∧ ((x_4_8 + ((-1) * x_5_8)) ≤ 0) ∧ ((x_4_5 + ((-1) * x_5_8)) ≤ (-1)) ∧ ((t + x_4_5 + ((-1) * x_4_8)) ≥ 1) ∧ ((t + x_4_8 + ((-1) * x_5_8)) ≥ 1)) ∨ (((x_4_8 + ((-1) * x_5_8)) ≥ 0) ∧ ((x_4_5 + ((-1) * x_4_8)) ≥ 0) ∧ ((x_4_5 + ((-1) * x_5_8)) ≥ 1) ∧ ((t + ((-1) * x_4_5) + x_4_8) ≥ 1) ∧ ((t + ((-1) * x_4_8) + x_5_8) ≥ 1))) ↔ ((¬ ((¬ ((x_4_8 + ((-1) * x_5_8)) ≤ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_4_8)) ≤ 0)) ∨ (¬ ((t + x_4_5 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((t + x_4_8 + ((-1) * x_5_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_8 + ((-1) * x_5_8)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_4_8)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_5) + x_4_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_8) + x_5_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_4_5 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * x_4_5 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_8 + ((-1) * x_5_8)) ≥ 0) ↔ (¬ (((1) * x_4_8 + (-1) * x_5_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_5 + ((-1) * x_4_8)) ≥ 0) ↔ (¬ (((1) * x_4_5 + (-1) * x_4_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_4_5) + x_4_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_5 + (1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_4_8) + x_5_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_8 + (1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_4_5 + ((-1) * x_4_8)) ≤ 0) ↔ (((1) * x_4_5 + (-1) * x_4_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_4_8 + ((-1) * x_5_8)) ≤ 0) ↔ (((1) * x_4_8 + (-1) * x_5_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_4_5 + ((-1) * x_5_8)) ≤ (-1)) ↔ (((1) * x_4_5 + (-1) * x_5_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_4_5 + ((-1) * x_4_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_5 + (-1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_4_8 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_8 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3238 (t x_0_6 x_0_8 x_6_8 : ℝ) : (((((x_0_6 + ((-1) * x_0_8)) ≤ 0) ∧ ((x_0_8 + ((-1) * x_6_8)) ≤ 0) ∧ ((x_0_6 + ((-1) * x_6_8)) ≤ (-1)) ∧ ((t + x_0_6 + ((-1) * x_0_8)) ≥ 1) ∧ ((t + x_0_8 + ((-1) * x_6_8)) ≥ 1)) ∨ (((x_0_8 + ((-1) * x_6_8)) ≥ 0) ∧ ((x_0_6 + ((-1) * x_0_8)) ≥ 0) ∧ ((x_0_6 + ((-1) * x_6_8)) ≥ 1) ∧ ((t + ((-1) * x_0_6) + x_0_8) ≥ 1) ∧ ((t + ((-1) * x_0_8) + x_6_8) ≥ 1))) ↔ ((¬ ((¬ ((x_0_8 + ((-1) * x_6_8)) ≤ 0)) ∨ (¬ ((x_0_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_0_6 + ((-1) * x_0_8)) ≤ 0)) ∨ (¬ ((t + x_0_6 + ((-1) * x_0_8)) ≥ 1)) ∨ (¬ ((t + x_0_8 + ((-1) * x_6_8)) ≥ 1)))) ∨ (¬ ((¬ ((t + ((-1) * x_0_8) + x_6_8) ≥ 1)) ∨ (¬ ((x_0_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_6) + x_0_8) ≥ 1)) ∨ (¬ ((x_0_6 + ((-1) * x_0_8)) ≥ 0)) ∨ (¬ ((x_0_8 + ((-1) * x_6_8)) ≥ 0)))))) := by
  classical
  have e0 : ((x_0_6 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * x_0_6 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((t + ((-1) * x_0_8) + x_6_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_8 + (1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + ((-1) * x_0_6) + x_0_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_6 + (1) * x_0_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_6 + ((-1) * x_0_8)) ≥ 0) ↔ (¬ (((1) * x_0_6 + (-1) * x_0_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_0_8 + ((-1) * x_6_8)) ≥ 0) ↔ (¬ (((1) * x_0_8 + (-1) * x_6_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_6 + ((-1) * x_0_8)) ≤ 0) ↔ (((1) * x_0_6 + (-1) * x_0_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_8 + ((-1) * x_6_8)) ≤ 0) ↔ (((1) * x_0_8 + (-1) * x_6_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_6 + ((-1) * x_6_8)) ≤ (-1)) ↔ (((1) * x_0_6 + (-1) * x_6_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_0_6 + ((-1) * x_0_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_6 + (-1) * x_0_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_0_8 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_8 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3239 (t x_3_5 x_4_6 x_5_6 x_6_7 x_6_8 : ℝ) : (t ≥ 4) ∨ ((t + ((-1) * x_3_5)) ≤ 0) ∨ (¬ ((x_4_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_5_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((x_3_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ (x_6_7 ≥ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_6_7)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3240 (t x_6_7 x_6_9 x_7_9 : ℝ) : (((((x_6_7 + ((-1) * x_6_9)) ≤ 0) ∧ ((x_6_9 + ((-1) * x_7_9)) ≤ 0) ∧ ((x_6_7 + ((-1) * x_7_9)) ≤ (-1)) ∧ ((t + x_6_7 + ((-1) * x_6_9)) ≥ 1) ∧ ((t + x_6_9 + ((-1) * x_7_9)) ≥ 1)) ∨ (((x_6_9 + ((-1) * x_7_9)) ≥ 0) ∧ ((x_6_7 + ((-1) * x_6_9)) ≥ 0) ∧ ((x_6_7 + ((-1) * x_7_9)) ≥ 1) ∧ ((t + ((-1) * x_6_7) + x_6_9) ≥ 1) ∧ ((t + ((-1) * x_6_9) + x_7_9) ≥ 1))) ↔ ((¬ ((¬ ((x_6_9 + ((-1) * x_7_9)) ≤ 0)) ∨ (¬ ((x_6_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((x_6_7 + ((-1) * x_6_9)) ≤ 0)) ∨ (¬ ((t + x_6_7 + ((-1) * x_6_9)) ≥ 1)) ∨ (¬ ((t + x_6_9 + ((-1) * x_7_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_6_9 + ((-1) * x_7_9)) ≥ 0)) ∨ (¬ ((x_6_7 + ((-1) * x_6_9)) ≥ 0)) ∨ (¬ ((x_6_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_6_7) + x_6_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_6_9) + x_7_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_6_9 + ((-1) * x_7_9)) ≤ 0) ↔ (((1) * x_6_9 + (-1) * x_7_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_6_7 + ((-1) * x_7_9)) ≤ (-1)) ↔ (((1) * x_6_7 + (-1) * x_7_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_6_7 + ((-1) * x_6_9)) ≤ 0) ↔ (((1) * x_6_7 + (-1) * x_6_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_6_7 + ((-1) * x_6_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_6_7 + (-1) * x_6_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_6_9 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_6_9 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_6_7 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * x_6_7 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_6_9 + ((-1) * x_7_9)) ≥ 0) ↔ (¬ (((1) * x_6_9 + (-1) * x_7_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_6_7 + ((-1) * x_6_9)) ≥ 0) ↔ (¬ (((1) * x_6_7 + (-1) * x_6_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_6_7) + x_6_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_6_7 + (1) * x_6_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_6_9) + x_7_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_6_9 + (1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3241 (t x_0_4 x_1_4 x_4_5 x_4_6 x_6_7 x_7_9 : ℝ) : (¬ (x_7_9 ≥ 0)) ∨ ((t + ((-1) * x_4_5)) ≤ 0) ∨ (¬ ((x_1_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_4 + ((-1) * x_1_4)) ≤ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((x_6_7 + ((-1) * x_7_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3242 (t x_1_4 x_1_5 x_4_5 : ℝ) : (((((x_1_4 + ((-1) * x_1_5)) ≤ 0) ∧ ((x_1_5 + ((-1) * x_4_5)) ≤ 0) ∧ ((x_1_4 + ((-1) * x_4_5)) ≤ (-1)) ∧ ((t + x_1_4 + ((-1) * x_1_5)) ≥ 1) ∧ ((t + x_1_5 + ((-1) * x_4_5)) ≥ 1)) ∨ (((x_1_5 + ((-1) * x_4_5)) ≥ 0) ∧ ((x_1_4 + ((-1) * x_1_5)) ≥ 0) ∧ ((x_1_4 + ((-1) * x_4_5)) ≥ 1) ∧ ((t + ((-1) * x_1_4) + x_1_5) ≥ 1) ∧ ((t + ((-1) * x_1_5) + x_4_5) ≥ 1))) ↔ ((¬ ((¬ ((x_1_4 + ((-1) * x_1_5)) ≤ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_4_5)) ≤ 0)) ∨ (¬ ((x_1_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((t + x_1_5 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((t + x_1_4 + ((-1) * x_1_5)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_5 + ((-1) * x_4_5)) ≥ 0)) ∨ (¬ ((x_1_4 + ((-1) * x_1_5)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_1_5) + x_4_5) ≥ 1)) ∨ (¬ ((x_1_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_4) + x_1_5) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_4 + ((-1) * x_4_5)) ≤ (-1)) ↔ (((1) * x_1_4 + (-1) * x_4_5 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_4 + ((-1) * x_1_5)) ≤ 0) ↔ (((1) * x_1_4 + (-1) * x_1_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_5 + ((-1) * x_4_5)) ≤ 0) ↔ (((1) * x_1_5 + (-1) * x_4_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_1_5 + ((-1) * x_4_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_5 + (-1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_1_4 + ((-1) * x_1_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_4 + (-1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_4 + ((-1) * x_4_5)) ≥ 1) ↔ (¬ (((1) * x_1_4 + (-1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_5 + ((-1) * x_4_5)) ≥ 0) ↔ (¬ (((1) * x_1_5 + (-1) * x_4_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_4 + ((-1) * x_1_5)) ≥ 0) ↔ (¬ (((1) * x_1_4 + (-1) * x_1_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_4) + x_1_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_4 + (1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_5) + x_4_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_5 + (1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3243 (t x_0_4 x_1_4 x_4_5 x_4_6 x_5_6 x_6_8 : ℝ) : (¬ ((x_5_6 + ((-1) * x_6_8)) ≥ 1)) ∨ ((t + ((-1) * x_1_4)) ≤ 0) ∨ (¬ ((x_1_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_4_6 + ((-1) * x_5_6)) ≥ 0)) ∨ (¬ (x_6_8 ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3244 (t x_4_7 x_4_9 x_7_9 : ℝ) : (((((x_4_7 + ((-1) * x_4_9)) ≤ 0) ∧ ((x_4_9 + ((-1) * x_7_9)) ≤ 0) ∧ ((x_4_7 + ((-1) * x_7_9)) ≤ (-1)) ∧ ((t + x_4_7 + ((-1) * x_4_9)) ≥ 1) ∧ ((t + x_4_9 + ((-1) * x_7_9)) ≥ 1)) ∨ (((x_4_9 + ((-1) * x_7_9)) ≥ 0) ∧ ((x_4_7 + ((-1) * x_4_9)) ≥ 0) ∧ ((x_4_7 + ((-1) * x_7_9)) ≥ 1) ∧ ((t + ((-1) * x_4_7) + x_4_9) ≥ 1) ∧ ((t + ((-1) * x_4_9) + x_7_9) ≥ 1))) ↔ ((¬ ((¬ ((x_4_9 + ((-1) * x_7_9)) ≤ 0)) ∨ (¬ ((x_4_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((x_4_7 + ((-1) * x_4_9)) ≤ 0)) ∨ (¬ ((t + x_4_7 + ((-1) * x_4_9)) ≥ 1)) ∨ (¬ ((t + x_4_9 + ((-1) * x_7_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_9 + ((-1) * x_7_9)) ≥ 0)) ∨ (¬ ((x_4_7 + ((-1) * x_4_9)) ≥ 0)) ∨ (¬ ((x_4_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_7) + x_4_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_9) + x_7_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_4_9 + ((-1) * x_7_9)) ≥ 0) ↔ (¬ (((1) * x_4_9 + (-1) * x_7_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_7 + ((-1) * x_4_9)) ≥ 0) ↔ (¬ (((1) * x_4_7 + (-1) * x_4_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_7 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * x_4_7 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_4_7) + x_4_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_7 + (1) * x_4_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_4_9) + x_7_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_9 + (1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_4_7 + ((-1) * x_4_9)) ≤ 0) ↔ (((1) * x_4_7 + (-1) * x_4_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_4_9 + ((-1) * x_7_9)) ≤ 0) ↔ (((1) * x_4_9 + (-1) * x_7_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_4_7 + ((-1) * x_7_9)) ≤ (-1)) ↔ (((1) * x_4_7 + (-1) * x_7_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_4_7 + ((-1) * x_4_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_7 + (-1) * x_4_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_4_9 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_9 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3245 (t x_4_5 x_4_7 x_5_7 : ℝ) : (((((x_4_5 + ((-1) * x_4_7)) ≤ 0) ∧ ((x_4_7 + ((-1) * x_5_7)) ≤ 0) ∧ ((x_4_5 + ((-1) * x_5_7)) ≤ (-1)) ∧ ((t + x_4_5 + ((-1) * x_4_7)) ≥ 1) ∧ ((t + x_4_7 + ((-1) * x_5_7)) ≥ 1)) ∨ (((x_4_7 + ((-1) * x_5_7)) ≥ 0) ∧ ((x_4_5 + ((-1) * x_4_7)) ≥ 0) ∧ ((x_4_5 + ((-1) * x_5_7)) ≥ 1) ∧ ((t + ((-1) * x_4_5) + x_4_7) ≥ 1) ∧ ((t + ((-1) * x_4_7) + x_5_7) ≥ 1))) ↔ ((¬ ((¬ ((x_4_7 + ((-1) * x_5_7)) ≤ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_4_7)) ≤ 0)) ∨ (¬ ((t + x_4_5 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((t + x_4_7 + ((-1) * x_5_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_7 + ((-1) * x_5_7)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_4_7)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_5) + x_4_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_7) + x_5_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_4_5 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * x_4_5 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_5 + ((-1) * x_4_7)) ≤ 0) ↔ (((1) * x_4_5 + (-1) * x_4_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_7 + ((-1) * x_5_7)) ≤ 0) ↔ (((1) * x_4_7 + (-1) * x_5_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_4_5 + ((-1) * x_5_7)) ≤ (-1)) ↔ (((1) * x_4_5 + (-1) * x_5_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_4_5 + ((-1) * x_4_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_5 + (-1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_4_7 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_7 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_4_7 + ((-1) * x_5_7)) ≥ 0) ↔ (¬ (((1) * x_4_7 + (-1) * x_5_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_4_5 + ((-1) * x_4_7)) ≥ 0) ↔ (¬ (((1) * x_4_5 + (-1) * x_4_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_4_5) + x_4_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_5 + (1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_4_7) + x_5_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_7 + (1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3246 (t x_3_4 x_3_7 x_4_7 : ℝ) : (((((x_3_4 + ((-1) * x_3_7)) ≤ 0) ∧ ((x_3_7 + ((-1) * x_4_7)) ≤ 0) ∧ ((x_3_4 + ((-1) * x_4_7)) ≤ (-1)) ∧ ((t + x_3_4 + ((-1) * x_3_7)) ≥ 1) ∧ ((t + x_3_7 + ((-1) * x_4_7)) ≥ 1)) ∨ (((x_3_7 + ((-1) * x_4_7)) ≥ 0) ∧ ((x_3_4 + ((-1) * x_3_7)) ≥ 0) ∧ ((x_3_4 + ((-1) * x_4_7)) ≥ 1) ∧ ((t + ((-1) * x_3_4) + x_3_7) ≥ 1) ∧ ((t + ((-1) * x_3_7) + x_4_7) ≥ 1))) ↔ ((¬ ((¬ ((x_3_7 + ((-1) * x_4_7)) ≤ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_7)) ≤ (-1))) ∨ (¬ ((x_3_4 + ((-1) * x_3_7)) ≤ 0)) ∨ (¬ ((t + x_3_4 + ((-1) * x_3_7)) ≥ 1)) ∨ (¬ ((t + x_3_7 + ((-1) * x_4_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_7 + ((-1) * x_4_7)) ≥ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_3_7)) ≥ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_4) + x_3_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_7) + x_4_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_4 + ((-1) * x_3_7)) ≥ 0) ↔ (¬ (((1) * x_3_4 + (-1) * x_3_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_7 + ((-1) * x_4_7)) ≥ 0) ↔ (¬ (((1) * x_3_7 + (-1) * x_4_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_4 + ((-1) * x_4_7)) ≥ 1) ↔ (¬ (((1) * x_3_4 + (-1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_3_4) + x_3_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_4 + (1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_3_7) + x_4_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_7 + (1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_3_4 + ((-1) * x_3_7)) ≤ 0) ↔ (((1) * x_3_4 + (-1) * x_3_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_7 + ((-1) * x_4_7)) ≤ 0) ↔ (((1) * x_3_7 + (-1) * x_4_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_4 + ((-1) * x_4_7)) ≤ (-1)) ↔ (((1) * x_3_4 + (-1) * x_4_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_3_4 + ((-1) * x_3_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_4 + (-1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_3_7 + ((-1) * x_4_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_7 + (-1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3247 (t x_3_7 x_3_9 x_7_9 : ℝ) : (((((x_3_7 + ((-1) * x_3_9)) ≤ 0) ∧ ((x_3_9 + ((-1) * x_7_9)) ≤ 0) ∧ ((x_3_7 + ((-1) * x_7_9)) ≤ (-1)) ∧ ((t + x_3_7 + ((-1) * x_3_9)) ≥ 1) ∧ ((t + x_3_9 + ((-1) * x_7_9)) ≥ 1)) ∨ (((x_3_9 + ((-1) * x_7_9)) ≥ 0) ∧ ((x_3_7 + ((-1) * x_3_9)) ≥ 0) ∧ ((x_3_7 + ((-1) * x_7_9)) ≥ 1) ∧ ((t + ((-1) * x_3_7) + x_3_9) ≥ 1) ∧ ((t + ((-1) * x_3_9) + x_7_9) ≥ 1))) ↔ ((¬ ((¬ ((x_3_9 + ((-1) * x_7_9)) ≤ 0)) ∨ (¬ ((x_3_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((x_3_7 + ((-1) * x_3_9)) ≤ 0)) ∨ (¬ ((t + x_3_7 + ((-1) * x_3_9)) ≥ 1)) ∨ (¬ ((t + x_3_9 + ((-1) * x_7_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_9 + ((-1) * x_7_9)) ≥ 0)) ∨ (¬ ((x_3_7 + ((-1) * x_3_9)) ≥ 0)) ∨ (¬ ((x_3_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_7) + x_3_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_9) + x_7_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_7 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * x_3_7 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_9 + ((-1) * x_7_9)) ≥ 0) ↔ (¬ (((1) * x_3_9 + (-1) * x_7_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_7 + ((-1) * x_3_9)) ≥ 0) ↔ (¬ (((1) * x_3_7 + (-1) * x_3_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_3_7) + x_3_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_7 + (1) * x_3_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_3_9) + x_7_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_9 + (1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_3_7 + ((-1) * x_3_9)) ≤ 0) ↔ (((1) * x_3_7 + (-1) * x_3_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_9 + ((-1) * x_7_9)) ≤ 0) ↔ (((1) * x_3_9 + (-1) * x_7_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_7 + ((-1) * x_7_9)) ≤ (-1)) ↔ (((1) * x_3_7 + (-1) * x_7_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_3_7 + ((-1) * x_3_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_7 + (-1) * x_3_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_3_9 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_9 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3248 (t x_7_8 x_7_9 x_8_9 : ℝ) : (((((x_7_8 + ((-1) * x_7_9)) ≤ 0) ∧ ((x_7_9 + ((-1) * x_8_9)) ≤ 0) ∧ ((x_7_8 + ((-1) * x_8_9)) ≤ (-1)) ∧ ((t + x_7_8 + ((-1) * x_7_9)) ≥ 1) ∧ ((t + x_7_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (((x_7_9 + ((-1) * x_8_9)) ≥ 0) ∧ ((x_7_8 + ((-1) * x_7_9)) ≥ 0) ∧ ((x_7_8 + ((-1) * x_8_9)) ≥ 1) ∧ ((t + ((-1) * x_7_8) + x_7_9) ≥ 1) ∧ ((t + ((-1) * x_7_9) + x_8_9) ≥ 1))) ↔ ((¬ ((¬ ((x_7_9 + ((-1) * x_8_9)) ≤ 0)) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_7_8 + ((-1) * x_7_9)) ≤ 0)) ∨ (¬ ((t + x_7_8 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((t + x_7_9 + ((-1) * x_8_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_7_9 + ((-1) * x_8_9)) ≥ 0)) ∨ (¬ ((x_7_8 + ((-1) * x_7_9)) ≥ 0)) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_7_8) + x_7_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_7_9) + x_8_9) ≥ 1)))))) := by
  classical
  have e0 : ((t + ((-1) * x_7_9) + x_8_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_7_9 + (1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_7_9 + ((-1) * x_8_9)) ≤ 0) ↔ (((1) * x_7_9 + (-1) * x_8_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_7_8 + ((-1) * x_8_9)) ≤ (-1)) ↔ (((1) * x_7_8 + (-1) * x_8_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_7_8 + ((-1) * x_7_9)) ≤ 0) ↔ (((1) * x_7_8 + (-1) * x_7_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_7_8 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_7_8 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_7_9 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_7_9 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_7_8 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * x_7_8 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_7_9 + ((-1) * x_8_9)) ≥ 0) ↔ (¬ (((1) * x_7_9 + (-1) * x_8_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((x_7_8 + ((-1) * x_7_9)) ≥ 0) ↔ (¬ (((1) * x_7_8 + (-1) * x_7_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_7_8) + x_7_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_7_8 + (1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3249 (t x_0_4 x_4_5 x_4_8 x_6_8 x_8_9 : ℝ) : (¬ ((x_0_4 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ (x_6_8 ≥ 0)) ∨ ((t + ((-1) * x_4_5)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((x_4_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3250 (x_0_4 x_1_4 x_1_6 x_4_6 : ℝ) : (¬ ((x_0_4 + ((-1) * x_1_4)) ≤ 0)) ∨ (¬ ((x_1_4 + ((-1) * x_1_6)) ≤ 0)) ∨ (¬ ((x_1_6 + ((-1) * x_4_6)) ≤ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3251 (t x_1_4 x_1_8 x_4_8 : ℝ) : (((((x_1_4 + ((-1) * x_1_8)) ≤ 0) ∧ ((x_1_8 + ((-1) * x_4_8)) ≤ 0) ∧ ((x_1_4 + ((-1) * x_4_8)) ≤ (-1)) ∧ ((t + x_1_4 + ((-1) * x_1_8)) ≥ 1) ∧ ((t + x_1_8 + ((-1) * x_4_8)) ≥ 1)) ∨ (((x_1_8 + ((-1) * x_4_8)) ≥ 0) ∧ ((x_1_4 + ((-1) * x_1_8)) ≥ 0) ∧ ((x_1_4 + ((-1) * x_4_8)) ≥ 1) ∧ ((t + ((-1) * x_1_4) + x_1_8) ≥ 1) ∧ ((t + ((-1) * x_1_8) + x_4_8) ≥ 1))) ↔ ((¬ ((¬ ((x_1_4 + ((-1) * x_1_8)) ≤ 0)) ∨ (¬ ((t + x_1_4 + ((-1) * x_1_8)) ≥ 1)) ∨ (¬ ((t + x_1_8 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((x_1_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (¬ ((x_1_8 + ((-1) * x_4_8)) ≤ 0)))) ∨ (¬ ((¬ ((x_1_4 + ((-1) * x_1_8)) ≥ 0)) ∨ (¬ ((x_1_8 + ((-1) * x_4_8)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_1_8) + x_4_8) ≥ 1)) ∨ (¬ ((x_1_4 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_4) + x_1_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_4 + ((-1) * x_4_8)) ≤ (-1)) ↔ (((1) * x_1_4 + (-1) * x_4_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_4 + ((-1) * x_1_8)) ≤ 0) ↔ (((1) * x_1_4 + (-1) * x_1_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + x_1_4 + ((-1) * x_1_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_4 + (-1) * x_1_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_1_8 + ((-1) * x_4_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_8 + (-1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_1_8 + ((-1) * x_4_8)) ≤ 0) ↔ (((1) * x_1_8 + (-1) * x_4_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_4 + ((-1) * x_4_8)) ≥ 1) ↔ (¬ (((1) * x_1_4 + (-1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_8 + ((-1) * x_4_8)) ≥ 0) ↔ (¬ (((1) * x_1_8 + (-1) * x_4_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_4 + ((-1) * x_1_8)) ≥ 0) ↔ (¬ (((1) * x_1_4 + (-1) * x_1_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_4) + x_1_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_4 + (1) * x_1_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_8) + x_4_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_8 + (1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3252 (t x_0_4 x_1_4 x_4_6 x_4_8 x_6_7 : ℝ) : (t ≥ 4) ∨ ((t + ((-1) * x_1_4)) ≤ 0) ∨ (¬ ((x_4_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) ∨ (¬ (x_6_7 ≥ 0)) ∨ (¬ ((x_1_4 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_8)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3253 (t x_4_8 x_4_9 x_8_9 : ℝ) : (((((x_4_8 + ((-1) * x_4_9)) ≤ 0) ∧ ((x_4_9 + ((-1) * x_8_9)) ≤ 0) ∧ ((x_4_8 + ((-1) * x_8_9)) ≤ (-1)) ∧ ((t + x_4_8 + ((-1) * x_4_9)) ≥ 1) ∧ ((t + x_4_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (((x_4_9 + ((-1) * x_8_9)) ≥ 0) ∧ ((x_4_8 + ((-1) * x_4_9)) ≥ 0) ∧ ((x_4_8 + ((-1) * x_8_9)) ≥ 1) ∧ ((t + ((-1) * x_4_8) + x_4_9) ≥ 1) ∧ ((t + ((-1) * x_4_9) + x_8_9) ≥ 1))) ↔ ((¬ ((¬ ((x_4_9 + ((-1) * x_8_9)) ≤ 0)) ∨ (¬ ((x_4_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_4_8 + ((-1) * x_4_9)) ≤ 0)) ∨ (¬ ((t + x_4_8 + ((-1) * x_4_9)) ≥ 1)) ∨ (¬ ((t + x_4_9 + ((-1) * x_8_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_9 + ((-1) * x_8_9)) ≥ 0)) ∨ (¬ ((x_4_8 + ((-1) * x_4_9)) ≥ 0)) ∨ (¬ ((x_4_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_8) + x_4_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_9) + x_8_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_4_8 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * x_4_8 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_9 + ((-1) * x_8_9)) ≥ 0) ↔ (¬ (((1) * x_4_9 + (-1) * x_8_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_8 + ((-1) * x_4_9)) ≥ 0) ↔ (¬ (((1) * x_4_8 + (-1) * x_4_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_4_8) + x_4_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_8 + (1) * x_4_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_4_9) + x_8_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_9 + (1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_4_8 + ((-1) * x_4_9)) ≤ 0) ↔ (((1) * x_4_8 + (-1) * x_4_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_4_9 + ((-1) * x_8_9)) ≤ 0) ↔ (((1) * x_4_9 + (-1) * x_8_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_4_8 + ((-1) * x_8_9)) ≤ (-1)) ↔ (((1) * x_4_8 + (-1) * x_8_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_4_8 + ((-1) * x_4_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_8 + (-1) * x_4_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_4_9 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_9 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3254 (t x_3_4 x_3_5 x_4_5 : ℝ) : (((((x_3_4 + ((-1) * x_3_5)) ≤ 0) ∧ ((x_3_5 + ((-1) * x_4_5)) ≤ 0) ∧ ((x_3_4 + ((-1) * x_4_5)) ≤ (-1)) ∧ ((t + x_3_4 + ((-1) * x_3_5)) ≥ 1) ∧ ((t + x_3_5 + ((-1) * x_4_5)) ≥ 1)) ∨ (((x_3_5 + ((-1) * x_4_5)) ≥ 0) ∧ ((x_3_4 + ((-1) * x_3_5)) ≥ 0) ∧ ((x_3_4 + ((-1) * x_4_5)) ≥ 1) ∧ ((t + ((-1) * x_3_4) + x_3_5) ≥ 1) ∧ ((t + ((-1) * x_3_5) + x_4_5) ≥ 1))) ↔ ((¬ ((¬ ((x_3_5 + ((-1) * x_4_5)) ≤ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((x_3_4 + ((-1) * x_3_5)) ≤ 0)) ∨ (¬ ((t + x_3_4 + ((-1) * x_3_5)) ≥ 1)) ∨ (¬ ((t + x_3_5 + ((-1) * x_4_5)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_5 + ((-1) * x_4_5)) ≥ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_3_5)) ≥ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_4) + x_3_5) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_5) + x_4_5) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_4 + ((-1) * x_4_5)) ≤ (-1)) ↔ (((1) * x_3_4 + (-1) * x_4_5 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_5 + ((-1) * x_4_5)) ≤ 0) ↔ (((1) * x_3_5 + (-1) * x_4_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_4 + ((-1) * x_3_5)) ≤ 0) ↔ (((1) * x_3_4 + (-1) * x_3_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_3_4 + ((-1) * x_3_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_4 + (-1) * x_3_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_3_5 + ((-1) * x_4_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_5 + (-1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_3_4 + ((-1) * x_4_5)) ≥ 1) ↔ (¬ (((1) * x_3_4 + (-1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_5 + ((-1) * x_4_5)) ≥ 0) ↔ (¬ (((1) * x_3_5 + (-1) * x_4_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_4 + ((-1) * x_3_5)) ≥ 0) ↔ (¬ (((1) * x_3_4 + (-1) * x_3_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_3_4) + x_3_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_4 + (1) * x_3_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_3_5) + x_4_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_5 + (1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3255 (t x_0_4 x_3_4 x_4_5 x_4_6 x_6_7 : ℝ) : ((t + ((-1) * x_3_4)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ ((x_3_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((x_4_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ (x_6_7 ≥ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3256 (t x_4_6 x_4_7 x_6_7 : ℝ) : (((((x_4_6 + ((-1) * x_4_7)) ≤ 0) ∧ ((x_4_7 + ((-1) * x_6_7)) ≤ 0) ∧ ((x_4_6 + ((-1) * x_6_7)) ≤ (-1)) ∧ ((t + x_4_6 + ((-1) * x_4_7)) ≥ 1) ∧ ((t + x_4_7 + ((-1) * x_6_7)) ≥ 1)) ∨ (((x_4_7 + ((-1) * x_6_7)) ≥ 0) ∧ ((x_4_6 + ((-1) * x_4_7)) ≥ 0) ∧ ((x_4_6 + ((-1) * x_6_7)) ≥ 1) ∧ ((t + ((-1) * x_4_6) + x_4_7) ≥ 1) ∧ ((t + ((-1) * x_4_7) + x_6_7) ≥ 1))) ↔ ((¬ ((¬ ((x_4_7 + ((-1) * x_6_7)) ≤ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_4_6 + ((-1) * x_4_7)) ≤ 0)) ∨ (¬ ((t + x_4_6 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((t + x_4_7 + ((-1) * x_6_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_7 + ((-1) * x_6_7)) ≥ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_4_7)) ≥ 0)) ∨ (¬ ((x_4_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_6) + x_4_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_7) + x_6_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_4_6 + ((-1) * x_6_7)) ≥ 1) ↔ (¬ (((1) * x_4_6 + (-1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_7 + ((-1) * x_6_7)) ≥ 0) ↔ (¬ (((1) * x_4_7 + (-1) * x_6_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_6 + ((-1) * x_4_7)) ≥ 0) ↔ (¬ (((1) * x_4_6 + (-1) * x_4_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_4_6) + x_4_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_6 + (1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_4_7) + x_6_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_7 + (1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_4_6 + ((-1) * x_4_7)) ≤ 0) ↔ (((1) * x_4_6 + (-1) * x_4_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_4_7 + ((-1) * x_6_7)) ≤ 0) ↔ (((1) * x_4_7 + (-1) * x_6_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_4_6 + ((-1) * x_6_7)) ≤ (-1)) ↔ (((1) * x_4_6 + (-1) * x_6_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_4_6 + ((-1) * x_4_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_6 + (-1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_4_7 + ((-1) * x_6_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_7 + (-1) * x_6_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3257 (t x_4_5 x_4_6 x_5_6 : ℝ) : (((((x_4_5 + ((-1) * x_4_6)) ≤ 0) ∧ ((x_4_6 + ((-1) * x_5_6)) ≤ 0) ∧ ((x_4_5 + ((-1) * x_5_6)) ≤ (-1)) ∧ ((t + x_4_5 + ((-1) * x_4_6)) ≥ 1) ∧ ((t + x_4_6 + ((-1) * x_5_6)) ≥ 1)) ∨ (((x_4_6 + ((-1) * x_5_6)) ≥ 0) ∧ ((x_4_5 + ((-1) * x_4_6)) ≥ 0) ∧ ((x_4_5 + ((-1) * x_5_6)) ≥ 1) ∧ ((t + ((-1) * x_4_5) + x_4_6) ≥ 1) ∧ ((t + ((-1) * x_4_6) + x_5_6) ≥ 1))) ↔ ((¬ ((¬ ((x_4_6 + ((-1) * x_5_6)) ≤ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_4_6)) ≤ 0)) ∨ (¬ ((t + x_4_5 + ((-1) * x_4_6)) ≥ 1)) ∨ (¬ ((t + x_4_6 + ((-1) * x_5_6)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_6 + ((-1) * x_5_6)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_4_6)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_5) + x_4_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_6) + x_5_6) ≥ 1)))))) := by
  classical
  have e0 : ((x_4_5 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * x_4_5 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_5 + ((-1) * x_4_6)) ≥ 0) ↔ (¬ (((1) * x_4_5 + (-1) * x_4_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_6 + ((-1) * x_5_6)) ≥ 0) ↔ (¬ (((1) * x_4_6 + (-1) * x_5_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_4_5 + ((-1) * x_4_6)) ≤ 0) ↔ (((1) * x_4_5 + (-1) * x_4_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_4_6 + ((-1) * x_5_6)) ≤ 0) ↔ (((1) * x_4_6 + (-1) * x_5_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_4_5 + ((-1) * x_5_6)) ≤ (-1)) ↔ (((1) * x_4_5 + (-1) * x_5_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((t + x_4_5 + ((-1) * x_4_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_5 + (-1) * x_4_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((t + x_4_6 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_6 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_4_5) + x_4_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_5 + (1) * x_4_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_4_6) + x_5_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_6 + (1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3258 (t x_0_2 x_0_4 x_2_4 : ℝ) : (((((x_0_2 + ((-1) * x_0_4)) ≤ 0) ∧ ((x_0_4 + ((-1) * x_2_4)) ≤ 0) ∧ ((x_0_2 + ((-1) * x_2_4)) ≤ (-1)) ∧ ((t + x_0_2 + ((-1) * x_0_4)) ≥ 1) ∧ ((t + x_0_4 + ((-1) * x_2_4)) ≥ 1)) ∨ (((x_0_4 + ((-1) * x_2_4)) ≥ 0) ∧ ((x_0_2 + ((-1) * x_0_4)) ≥ 0) ∧ ((x_0_2 + ((-1) * x_2_4)) ≥ 1) ∧ ((t + ((-1) * x_0_2) + x_0_4) ≥ 1) ∧ ((t + ((-1) * x_0_4) + x_2_4) ≥ 1))) ↔ ((¬ ((¬ ((x_0_2 + ((-1) * x_0_4)) ≤ 0)) ∨ (¬ ((t + x_0_2 + ((-1) * x_0_4)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_4)) ≤ (-1))) ∨ (¬ ((t + x_0_4 + ((-1) * x_2_4)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_2_4)) ≤ 0)))) ∨ (¬ ((¬ ((x_0_2 + ((-1) * x_2_4)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_2) + x_0_4) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_2_4)) ≥ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_0_4)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_0_4) + x_2_4) ≥ 1)))))) := by
  classical
  have e0 : ((x_0_2 + ((-1) * x_2_4)) ≥ 1) ↔ (¬ (((1) * x_0_2 + (-1) * x_2_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_2 + ((-1) * x_0_4)) ≤ 0) ↔ (((1) * x_0_2 + (-1) * x_0_4) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_0_4 + ((-1) * x_2_4)) ≤ 0) ↔ (((1) * x_0_4 + (-1) * x_2_4) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_2 + ((-1) * x_2_4)) ≤ (-1)) ↔ (((1) * x_0_2 + (-1) * x_2_4 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_0_2 + ((-1) * x_0_4)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_2 + (-1) * x_0_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_0_4 + ((-1) * x_2_4)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_4 + (-1) * x_2_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_4 + ((-1) * x_2_4)) ≥ 0) ↔ (¬ (((1) * x_0_4 + (-1) * x_2_4) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_2 + ((-1) * x_0_4)) ≥ 0) ↔ (¬ (((1) * x_0_2 + (-1) * x_0_4) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_0_2) + x_0_4) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_2 + (1) * x_0_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_0_4) + x_2_4) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_4 + (1) * x_2_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3259 (t x_0_1 x_0_2 x_1_2 : ℝ) : (((((x_0_1 + ((-1) * x_0_2)) ≤ 0) ∧ ((x_0_2 + ((-1) * x_1_2)) ≤ 0) ∧ ((x_0_1 + ((-1) * x_1_2)) ≤ (-1)) ∧ ((t + x_0_1 + ((-1) * x_0_2)) ≥ 1) ∧ ((t + x_0_2 + ((-1) * x_1_2)) ≥ 1)) ∨ (((x_0_2 + ((-1) * x_1_2)) ≥ 0) ∧ ((x_0_1 + ((-1) * x_0_2)) ≥ 0) ∧ ((x_0_1 + ((-1) * x_1_2)) ≥ 1) ∧ ((t + ((-1) * x_0_1) + x_0_2) ≥ 1) ∧ ((t + ((-1) * x_0_2) + x_1_2) ≥ 1))) ↔ ((¬ ((¬ ((x_0_2 + ((-1) * x_1_2)) ≤ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_1_2)) ≤ (-1))) ∨ (¬ ((t + x_0_1 + ((-1) * x_0_2)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_0_2)) ≤ 0)) ∨ (¬ ((t + x_0_2 + ((-1) * x_1_2)) ≥ 1)))) ∨ (¬ ((¬ ((x_0_2 + ((-1) * x_1_2)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_0_1) + x_0_2) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_2) + x_1_2) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_2)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_0_2)) ≥ 0)))))) := by
  classical
  have e0 : ((x_0_2 + ((-1) * x_1_2)) ≥ 0) ↔ (¬ (((1) * x_0_2 + (-1) * x_1_2) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((t + ((-1) * x_0_1) + x_0_2) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_1 + (1) * x_0_2 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + ((-1) * x_0_2) + x_1_2) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_2 + (1) * x_1_2 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_1 + ((-1) * x_1_2)) ≥ 1) ↔ (¬ (((1) * x_0_1 + (-1) * x_1_2 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_0_1 + ((-1) * x_0_2)) ≥ 0) ↔ (¬ (((1) * x_0_1 + (-1) * x_0_2) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_1 + ((-1) * x_0_2)) ≤ 0) ↔ (((1) * x_0_1 + (-1) * x_0_2) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_2 + ((-1) * x_1_2)) ≤ 0) ↔ (((1) * x_0_2 + (-1) * x_1_2) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_1 + ((-1) * x_1_2)) ≤ (-1)) ↔ (((1) * x_0_1 + (-1) * x_1_2 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_0_1 + ((-1) * x_0_2)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_1 + (-1) * x_0_2 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_0_2 + ((-1) * x_1_2)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_2 + (-1) * x_1_2 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3260 (t x_2_5 x_2_8 x_5_8 : ℝ) : (((((x_2_5 + ((-1) * x_2_8)) ≤ 0) ∧ ((x_2_8 + ((-1) * x_5_8)) ≤ 0) ∧ ((x_2_5 + ((-1) * x_5_8)) ≤ (-1)) ∧ ((t + x_2_5 + ((-1) * x_2_8)) ≥ 1) ∧ ((t + x_2_8 + ((-1) * x_5_8)) ≥ 1)) ∨ (((x_2_8 + ((-1) * x_5_8)) ≥ 0) ∧ ((x_2_5 + ((-1) * x_2_8)) ≥ 0) ∧ ((x_2_5 + ((-1) * x_5_8)) ≥ 1) ∧ ((t + ((-1) * x_2_5) + x_2_8) ≥ 1) ∧ ((t + ((-1) * x_2_8) + x_5_8) ≥ 1))) ↔ ((¬ ((¬ ((x_2_8 + ((-1) * x_5_8)) ≤ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_2_8)) ≤ 0)) ∨ (¬ ((t + x_2_5 + ((-1) * x_2_8)) ≥ 1)) ∨ (¬ ((t + x_2_8 + ((-1) * x_5_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_8 + ((-1) * x_5_8)) ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_2_8)) ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_5) + x_2_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_8) + x_5_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_5 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * x_2_5 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_8 + ((-1) * x_5_8)) ≥ 0) ↔ (¬ (((1) * x_2_8 + (-1) * x_5_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_5 + ((-1) * x_2_8)) ≥ 0) ↔ (¬ (((1) * x_2_5 + (-1) * x_2_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_2_5) + x_2_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_5 + (1) * x_2_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_8) + x_5_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_8 + (1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_5 + ((-1) * x_2_8)) ≤ 0) ↔ (((1) * x_2_5 + (-1) * x_2_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_8 + ((-1) * x_5_8)) ≤ 0) ↔ (((1) * x_2_8 + (-1) * x_5_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_5 + ((-1) * x_5_8)) ≤ (-1)) ↔ (((1) * x_2_5 + (-1) * x_5_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_2_5 + ((-1) * x_2_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_5 + (-1) * x_2_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_8 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_8 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3261 (t x_2_3 x_2_4 x_3_4 : ℝ) : (((((x_2_3 + ((-1) * x_2_4)) ≤ 0) ∧ ((x_2_4 + ((-1) * x_3_4)) ≤ 0) ∧ ((x_2_3 + ((-1) * x_3_4)) ≤ (-1)) ∧ ((t + x_2_3 + ((-1) * x_2_4)) ≥ 1) ∧ ((t + x_2_4 + ((-1) * x_3_4)) ≥ 1)) ∨ (((x_2_4 + ((-1) * x_3_4)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_2_4)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_3_4)) ≥ 1) ∧ ((t + ((-1) * x_2_3) + x_2_4) ≥ 1) ∧ ((t + ((-1) * x_2_4) + x_3_4) ≥ 1))) ↔ ((¬ ((¬ ((x_2_4 + ((-1) * x_3_4)) ≤ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_2_4)) ≤ 0)) ∨ (¬ ((t + x_2_3 + ((-1) * x_2_4)) ≥ 1)) ∨ (¬ ((t + x_2_4 + ((-1) * x_3_4)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_4 + ((-1) * x_3_4)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_2_4)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_4)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_3) + x_2_4) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_4) + x_3_4) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_4 + ((-1) * x_3_4)) ≥ 0) ↔ (¬ (((1) * x_2_4 + (-1) * x_3_4) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_3 + ((-1) * x_2_4)) ≥ 0) ↔ (¬ (((1) * x_2_3 + (-1) * x_2_4) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_3 + ((-1) * x_3_4)) ≥ 1) ↔ (¬ (((1) * x_2_3 + (-1) * x_3_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_2_3) + x_2_4) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_3 + (1) * x_2_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_4) + x_3_4) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_4 + (1) * x_3_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_3 + ((-1) * x_2_4)) ≤ 0) ↔ (((1) * x_2_3 + (-1) * x_2_4) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_4 + ((-1) * x_3_4)) ≤ 0) ↔ (((1) * x_2_4 + (-1) * x_3_4) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_3 + ((-1) * x_3_4)) ≤ (-1)) ↔ (((1) * x_2_3 + (-1) * x_3_4 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_2_3 + ((-1) * x_2_4)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_3 + (-1) * x_2_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_4 + ((-1) * x_3_4)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_4 + (-1) * x_3_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3262 (t x_0_1 x_1_3 x_3_6 x_6_7 x_7_8 : ℝ) : (t ≥ 4) ∨ (¬ (x_0_1 ≥ 0)) ∨ (¬ ((x_3_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_0_1 + ((-1) * x_1_3)) ≤ (-1))) ∨ (¬ ((x_1_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ ((t + ((-1) * x_7_8)) ≤ 0) ∨ (¬ ((x_6_7 + ((-1) * x_7_8)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3263 (t x_1_3 x_1_6 x_3_6 : ℝ) : (((((x_1_3 + ((-1) * x_1_6)) ≤ 0) ∧ ((x_1_6 + ((-1) * x_3_6)) ≤ 0) ∧ ((x_1_3 + ((-1) * x_3_6)) ≤ (-1)) ∧ ((t + x_1_3 + ((-1) * x_1_6)) ≥ 1) ∧ ((t + x_1_6 + ((-1) * x_3_6)) ≥ 1)) ∨ (((x_1_6 + ((-1) * x_3_6)) ≥ 0) ∧ ((x_1_3 + ((-1) * x_1_6)) ≥ 0) ∧ ((x_1_3 + ((-1) * x_3_6)) ≥ 1) ∧ ((t + ((-1) * x_1_3) + x_1_6) ≥ 1) ∧ ((t + ((-1) * x_1_6) + x_3_6) ≥ 1))) ↔ ((¬ ((¬ ((x_1_3 + ((-1) * x_1_6)) ≤ 0)) ∨ (¬ ((t + x_1_6 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((t + x_1_3 + ((-1) * x_1_6)) ≥ 1)) ∨ (¬ ((x_1_6 + ((-1) * x_3_6)) ≤ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_6)) ≤ (-1))))) ∨ (¬ ((¬ ((x_1_3 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_3) + x_1_6) ≥ 1)) ∨ (¬ ((x_1_6 + ((-1) * x_3_6)) ≥ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_1_6)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_1_6) + x_3_6) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_3 + ((-1) * x_3_6)) ≤ (-1)) ↔ (((1) * x_1_3 + (-1) * x_3_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_3 + ((-1) * x_1_6)) ≤ 0) ↔ (((1) * x_1_3 + (-1) * x_1_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + x_1_6 + ((-1) * x_3_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_6 + (-1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_1_3 + ((-1) * x_1_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_3 + (-1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_1_6 + ((-1) * x_3_6)) ≤ 0) ↔ (((1) * x_1_6 + (-1) * x_3_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_3 + ((-1) * x_3_6)) ≥ 1) ↔ (¬ (((1) * x_1_3 + (-1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_6 + ((-1) * x_3_6)) ≥ 0) ↔ (¬ (((1) * x_1_6 + (-1) * x_3_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_3 + ((-1) * x_1_6)) ≥ 0) ↔ (¬ (((1) * x_1_3 + (-1) * x_1_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_3) + x_1_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_3 + (1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_6) + x_3_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_6 + (1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3264 (t x_3_6 x_3_8 x_6_8 : ℝ) : (((((x_3_6 + ((-1) * x_3_8)) ≤ 0) ∧ ((x_3_8 + ((-1) * x_6_8)) ≤ 0) ∧ ((x_3_6 + ((-1) * x_6_8)) ≤ (-1)) ∧ ((t + x_3_6 + ((-1) * x_3_8)) ≥ 1) ∧ ((t + x_3_8 + ((-1) * x_6_8)) ≥ 1)) ∨ (((x_3_8 + ((-1) * x_6_8)) ≥ 0) ∧ ((x_3_6 + ((-1) * x_3_8)) ≥ 0) ∧ ((x_3_6 + ((-1) * x_6_8)) ≥ 1) ∧ ((t + ((-1) * x_3_6) + x_3_8) ≥ 1) ∧ ((t + ((-1) * x_3_8) + x_6_8) ≥ 1))) ↔ ((¬ ((¬ ((x_3_8 + ((-1) * x_6_8)) ≤ 0)) ∨ (¬ ((x_3_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_3_6 + ((-1) * x_3_8)) ≤ 0)) ∨ (¬ ((t + x_3_6 + ((-1) * x_3_8)) ≥ 1)) ∨ (¬ ((t + x_3_8 + ((-1) * x_6_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_8 + ((-1) * x_6_8)) ≥ 0)) ∨ (¬ ((x_3_6 + ((-1) * x_3_8)) ≥ 0)) ∨ (¬ ((x_3_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_6) + x_3_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_8) + x_6_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_6 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * x_3_6 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_8 + ((-1) * x_6_8)) ≥ 0) ↔ (¬ (((1) * x_3_8 + (-1) * x_6_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_6 + ((-1) * x_3_8)) ≥ 0) ↔ (¬ (((1) * x_3_6 + (-1) * x_3_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_3_6) + x_3_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_6 + (1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_3_8) + x_6_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_8 + (1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_3_6 + ((-1) * x_3_8)) ≤ 0) ↔ (((1) * x_3_6 + (-1) * x_3_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_8 + ((-1) * x_6_8)) ≤ 0) ↔ (((1) * x_3_8 + (-1) * x_6_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_6 + ((-1) * x_6_8)) ≤ (-1)) ↔ (((1) * x_3_6 + (-1) * x_6_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_3_6 + ((-1) * x_3_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_6 + (-1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_3_8 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_8 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3265 (t x_2_3 x_2_7 x_3_7 : ℝ) : (((((x_2_3 + ((-1) * x_2_7)) ≤ 0) ∧ ((x_2_7 + ((-1) * x_3_7)) ≤ 0) ∧ ((x_2_3 + ((-1) * x_3_7)) ≤ (-1)) ∧ ((t + x_2_3 + ((-1) * x_2_7)) ≥ 1) ∧ ((t + x_2_7 + ((-1) * x_3_7)) ≥ 1)) ∨ (((x_2_7 + ((-1) * x_3_7)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_2_7)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_3_7)) ≥ 1) ∧ ((t + ((-1) * x_2_3) + x_2_7) ≥ 1) ∧ ((t + ((-1) * x_2_7) + x_3_7) ≥ 1))) ↔ ((¬ ((¬ ((x_2_7 + ((-1) * x_3_7)) ≤ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_7)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_2_7)) ≤ 0)) ∨ (¬ ((t + x_2_3 + ((-1) * x_2_7)) ≥ 1)) ∨ (¬ ((t + x_2_7 + ((-1) * x_3_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_7 + ((-1) * x_3_7)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_2_7)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_3) + x_2_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_7) + x_3_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_3 + ((-1) * x_3_7)) ≥ 1) ↔ (¬ (((1) * x_2_3 + (-1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_3 + ((-1) * x_2_7)) ≤ 0) ↔ (((1) * x_2_3 + (-1) * x_2_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_7 + ((-1) * x_3_7)) ≤ 0) ↔ (((1) * x_2_7 + (-1) * x_3_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_2_3 + ((-1) * x_3_7)) ≤ (-1)) ↔ (((1) * x_2_3 + (-1) * x_3_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_2_3 + ((-1) * x_2_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_3 + (-1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_2_7 + ((-1) * x_3_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_7 + (-1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_7 + ((-1) * x_3_7)) ≥ 0) ↔ (¬ (((1) * x_2_7 + (-1) * x_3_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_3 + ((-1) * x_2_7)) ≥ 0) ↔ (¬ (((1) * x_2_3 + (-1) * x_2_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_2_3) + x_2_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_3 + (1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_2_7) + x_3_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_7 + (1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3266 (t x_0_2 x_0_3 x_2_3 : ℝ) : (((((x_0_2 + ((-1) * x_0_3)) ≤ 0) ∧ ((x_0_3 + ((-1) * x_2_3)) ≤ 0) ∧ ((x_0_2 + ((-1) * x_2_3)) ≤ (-1)) ∧ ((t + x_0_2 + ((-1) * x_0_3)) ≥ 1) ∧ ((t + x_0_3 + ((-1) * x_2_3)) ≥ 1)) ∨ (((x_0_3 + ((-1) * x_2_3)) ≥ 0) ∧ ((x_0_2 + ((-1) * x_0_3)) ≥ 0) ∧ ((x_0_2 + ((-1) * x_2_3)) ≥ 1) ∧ ((t + ((-1) * x_0_2) + x_0_3) ≥ 1) ∧ ((t + ((-1) * x_0_3) + x_2_3) ≥ 1))) ↔ ((¬ ((¬ ((x_0_3 + ((-1) * x_2_3)) ≤ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_2_3)) ≤ (-1))) ∨ (¬ ((t + x_0_3 + ((-1) * x_2_3)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_0_3)) ≤ 0)) ∨ (¬ ((t + x_0_2 + ((-1) * x_0_3)) ≥ 1)))) ∨ (¬ ((¬ ((x_0_3 + ((-1) * x_2_3)) ≥ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_0_3)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_0_3) + x_2_3) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_2_3)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_2) + x_0_3) ≥ 1)))))) := by
  classical
  have e0 : ((x_0_3 + ((-1) * x_2_3)) ≤ 0) ↔ (((1) * x_0_3 + (-1) * x_2_3) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_2 + ((-1) * x_2_3)) ≤ (-1)) ↔ (((1) * x_0_2 + (-1) * x_2_3 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + x_0_3 + ((-1) * x_2_3)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_3 + (-1) * x_2_3 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_2 + ((-1) * x_0_3)) ≤ 0) ↔ (((1) * x_0_2 + (-1) * x_0_3) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_0_2 + ((-1) * x_0_3)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_2 + (-1) * x_0_3 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_2 + ((-1) * x_2_3)) ≥ 1) ↔ (¬ (((1) * x_0_2 + (-1) * x_2_3 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_3 + ((-1) * x_2_3)) ≥ 0) ↔ (¬ (((1) * x_0_3 + (-1) * x_2_3) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_2 + ((-1) * x_0_3)) ≥ 0) ↔ (¬ (((1) * x_0_2 + (-1) * x_0_3) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_0_2) + x_0_3) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_2 + (1) * x_0_3 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_0_3) + x_2_3) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_3 + (1) * x_2_3 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3267 (t x_0_1 x_0_3 x_1_3 x_2_3 : ℝ) : (¬ ((x_0_1 + ((-1) * x_1_3)) ≥ 1)) ∨ (¬ (x_1_3 ≥ 0)) ∨ ((t + ((-1) * x_0_1)) ≤ 0) ∨ ((t + ((-1) * x_0_3) + x_2_3) ≥ 1) ∨ (¬ ((x_0_3 + ((-1) * x_2_3)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4⟩
  linarith

theorem theory3268 (t x_1_2 x_1_7 x_2_7 : ℝ) : (((((x_1_2 + ((-1) * x_1_7)) ≤ 0) ∧ ((x_1_7 + ((-1) * x_2_7)) ≤ 0) ∧ ((x_1_2 + ((-1) * x_2_7)) ≤ (-1)) ∧ ((t + x_1_2 + ((-1) * x_1_7)) ≥ 1) ∧ ((t + x_1_7 + ((-1) * x_2_7)) ≥ 1)) ∨ (((x_1_7 + ((-1) * x_2_7)) ≥ 0) ∧ ((x_1_2 + ((-1) * x_1_7)) ≥ 0) ∧ ((x_1_2 + ((-1) * x_2_7)) ≥ 1) ∧ ((t + ((-1) * x_1_2) + x_1_7) ≥ 1) ∧ ((t + ((-1) * x_1_7) + x_2_7) ≥ 1))) ↔ ((¬ ((¬ ((x_1_7 + ((-1) * x_2_7)) ≤ 0)) ∨ (¬ ((t + x_1_7 + ((-1) * x_2_7)) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_1_7)) ≤ 0)) ∨ (¬ ((x_1_2 + ((-1) * x_2_7)) ≤ (-1))) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_7)) ≥ 1)))) ∨ (¬ ((¬ ((t + ((-1) * x_1_2) + x_1_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_7) + x_2_7) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_1_7)) ≥ 0)) ∨ (¬ ((x_1_2 + ((-1) * x_2_7)) ≥ 1)) ∨ (¬ ((x_1_7 + ((-1) * x_2_7)) ≥ 0)))))) := by
  classical
  have e0 : ((x_1_2 + ((-1) * x_2_7)) ≤ (-1)) ↔ (((1) * x_1_2 + (-1) * x_2_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_7 + ((-1) * x_2_7)) ≤ 0) ↔ (((1) * x_1_7 + (-1) * x_2_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + x_1_7 + ((-1) * x_2_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_7 + (-1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_1_2 + ((-1) * x_1_7)) ≤ 0) ↔ (((1) * x_1_2 + (-1) * x_1_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_1_2 + ((-1) * x_1_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_2 + (-1) * x_1_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_2 + ((-1) * x_2_7)) ≥ 1) ↔ (¬ (((1) * x_1_2 + (-1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_7 + ((-1) * x_2_7)) ≥ 0) ↔ (¬ (((1) * x_1_7 + (-1) * x_2_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_2 + ((-1) * x_1_7)) ≥ 0) ↔ (¬ (((1) * x_1_2 + (-1) * x_1_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_2) + x_1_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_2 + (1) * x_1_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_7) + x_2_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_7 + (1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3270 (t x_2_7 x_2_8 x_7_8 : ℝ) : (((((x_2_7 + ((-1) * x_2_8)) ≤ 0) ∧ ((x_2_8 + ((-1) * x_7_8)) ≤ 0) ∧ ((x_2_7 + ((-1) * x_7_8)) ≤ (-1)) ∧ ((t + x_2_7 + ((-1) * x_2_8)) ≥ 1) ∧ ((t + x_2_8 + ((-1) * x_7_8)) ≥ 1)) ∨ (((x_2_8 + ((-1) * x_7_8)) ≥ 0) ∧ ((x_2_7 + ((-1) * x_2_8)) ≥ 0) ∧ ((x_2_7 + ((-1) * x_7_8)) ≥ 1) ∧ ((t + ((-1) * x_2_7) + x_2_8) ≥ 1) ∧ ((t + ((-1) * x_2_8) + x_7_8) ≥ 1))) ↔ ((¬ ((¬ ((x_2_8 + ((-1) * x_7_8)) ≤ 0)) ∨ (¬ ((x_2_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((x_2_7 + ((-1) * x_2_8)) ≤ 0)) ∨ (¬ ((t + x_2_7 + ((-1) * x_2_8)) ≥ 1)) ∨ (¬ ((t + x_2_8 + ((-1) * x_7_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_8 + ((-1) * x_7_8)) ≥ 0)) ∨ (¬ ((x_2_7 + ((-1) * x_2_8)) ≥ 0)) ∨ (¬ ((x_2_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_7) + x_2_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_8) + x_7_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_7 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * x_2_7 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_8 + ((-1) * x_7_8)) ≥ 0) ↔ (¬ (((1) * x_2_8 + (-1) * x_7_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_7 + ((-1) * x_2_8)) ≥ 0) ↔ (¬ (((1) * x_2_7 + (-1) * x_2_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_2_7) + x_2_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_7 + (1) * x_2_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_8) + x_7_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_8 + (1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_7 + ((-1) * x_2_8)) ≤ 0) ↔ (((1) * x_2_7 + (-1) * x_2_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_8 + ((-1) * x_7_8)) ≤ 0) ↔ (((1) * x_2_8 + (-1) * x_7_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_7 + ((-1) * x_7_8)) ≤ (-1)) ↔ (((1) * x_2_7 + (-1) * x_7_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_2_7 + ((-1) * x_2_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_7 + (-1) * x_2_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_8 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_8 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3271 (t x_1_3 x_1_4 x_3_4 : ℝ) : (((((x_1_3 + ((-1) * x_1_4)) ≤ 0) ∧ ((x_1_4 + ((-1) * x_3_4)) ≤ 0) ∧ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1)) ∧ ((t + x_1_3 + ((-1) * x_1_4)) ≥ 1) ∧ ((t + x_1_4 + ((-1) * x_3_4)) ≥ 1)) ∨ (((x_1_4 + ((-1) * x_3_4)) ≥ 0) ∧ ((x_1_3 + ((-1) * x_1_4)) ≥ 0) ∧ ((x_1_3 + ((-1) * x_3_4)) ≥ 1) ∧ ((t + ((-1) * x_1_3) + x_1_4) ≥ 1) ∧ ((t + ((-1) * x_1_4) + x_3_4) ≥ 1))) ↔ ((¬ ((¬ ((x_1_3 + ((-1) * x_1_4)) ≤ 0)) ∨ (¬ ((x_1_4 + ((-1) * x_3_4)) ≤ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((t + x_1_3 + ((-1) * x_1_4)) ≥ 1)) ∨ (¬ ((t + x_1_4 + ((-1) * x_3_4)) ≥ 1)))) ∨ (¬ ((¬ ((t + ((-1) * x_1_4) + x_3_4) ≥ 1)) ∨ (¬ ((x_1_3 + ((-1) * x_1_4)) ≥ 0)) ∨ (¬ ((x_1_4 + ((-1) * x_3_4)) ≥ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_3) + x_1_4) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_3 + ((-1) * x_1_4)) ≤ 0) ↔ (((1) * x_1_3 + (-1) * x_1_4) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_4 + ((-1) * x_3_4)) ≤ 0) ↔ (((1) * x_1_4 + (-1) * x_3_4) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_3 + ((-1) * x_3_4)) ≤ (-1)) ↔ (((1) * x_1_3 + (-1) * x_3_4 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_1_3 + ((-1) * x_1_4)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_3 + (-1) * x_1_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_1_4 + ((-1) * x_3_4)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_4 + (-1) * x_3_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_3 + ((-1) * x_3_4)) ≥ 1) ↔ (¬ (((1) * x_1_3 + (-1) * x_3_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_4 + ((-1) * x_3_4)) ≥ 0) ↔ (¬ (((1) * x_1_4 + (-1) * x_3_4) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_3 + ((-1) * x_1_4)) ≥ 0) ↔ (¬ (((1) * x_1_3 + (-1) * x_1_4) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_3) + x_1_4) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_3 + (1) * x_1_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_4) + x_3_4) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_4 + (1) * x_3_4 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3273 (t x_7_10 x_7_9 x_9_10 : ℝ) : (((((x_7_9 + ((-1) * x_7_10)) ≤ 0) ∧ ((x_7_10 + ((-1) * x_9_10)) ≤ 0) ∧ ((x_7_9 + ((-1) * x_9_10)) ≤ (-1)) ∧ ((t + x_7_9 + ((-1) * x_7_10)) ≥ 1) ∧ ((t + x_7_10 + ((-1) * x_9_10)) ≥ 1)) ∨ (((x_7_10 + ((-1) * x_9_10)) ≥ 0) ∧ ((x_7_9 + ((-1) * x_7_10)) ≥ 0) ∧ ((x_7_9 + ((-1) * x_9_10)) ≥ 1) ∧ ((t + ((-1) * x_7_9) + x_7_10) ≥ 1) ∧ ((t + ((-1) * x_7_10) + x_9_10) ≥ 1))) ↔ ((¬ ((¬ ((x_7_10 + ((-1) * x_9_10)) ≤ 0)) ∨ (¬ ((x_7_9 + ((-1) * x_9_10)) ≤ (-1))) ∨ (¬ ((x_7_9 + ((-1) * x_7_10)) ≤ 0)) ∨ (¬ ((t + x_7_9 + ((-1) * x_7_10)) ≥ 1)) ∨ (¬ ((t + x_7_10 + ((-1) * x_9_10)) ≥ 1)))) ∨ (¬ ((¬ ((x_7_10 + ((-1) * x_9_10)) ≥ 0)) ∨ (¬ ((x_7_9 + ((-1) * x_7_10)) ≥ 0)) ∨ (¬ ((x_7_9 + ((-1) * x_9_10)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_7_9) + x_7_10) ≥ 1)) ∨ (¬ ((t + ((-1) * x_7_10) + x_9_10) ≥ 1)))))) := by
  classical
  have e0 : ((x_7_10 + ((-1) * x_9_10)) ≥ 0) ↔ (¬ (((1) * x_7_10 + (-1) * x_9_10) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_7_9 + ((-1) * x_7_10)) ≥ 0) ↔ (((1) * x_7_10 + (-1) * x_7_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_7_9 + ((-1) * x_9_10)) ≥ 1) ↔ (¬ (((1) * x_7_9 + (-1) * x_9_10 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_7_9) + x_7_10) ≥ 1) ↔ (¬ (((1) * t + (1) * x_7_10 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_7_10) + x_9_10) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_7_10 + (1) * x_9_10 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_7_9 + ((-1) * x_7_10)) ≤ 0) ↔ (¬ (((1) * x_7_10 + (-1) * x_7_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_7_10 + ((-1) * x_9_10)) ≤ 0) ↔ (((1) * x_7_10 + (-1) * x_9_10) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_7_9 + ((-1) * x_9_10)) ≤ (-1)) ↔ (((1) * x_7_9 + (-1) * x_9_10 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_7_9 + ((-1) * x_7_10)) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_7_10 + (1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_7_10 + ((-1) * x_9_10)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_7_10 + (-1) * x_9_10 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3274 (t x_0_2 x_2_6 x_6_7 x_7_9 x_9_10 : ℝ) : (¬ ((x_0_2 + ((-1) * x_2_6)) ≤ (-1))) ∨ (¬ (x_0_2 ≥ 0)) ∨ ((t + ((-1) * x_9_10)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ ((x_2_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_7_9 + ((-1) * x_9_10)) ≤ (-1))) ∨ (¬ ((x_6_7 + ((-1) * x_7_9)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3275 (t x_5_6 x_5_7 x_6_7 : ℝ) : (¬ ((x_5_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ (x_5_7 ≥ 0)) ∨ ((t + x_5_7 + ((-1) * x_6_7)) ≥ 1) ∨ ((t + ((-1) * x_5_6)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3276 (t x_0_2 x_2_6 x_6_7 x_7_8 x_8_9 : ℝ) : (t ≥ 4) ∨ (¬ (x_0_2 ≥ 0)) ∨ ((t + ((-1) * x_8_9)) ≤ 0) ∨ (¬ ((x_2_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_2_6)) ≤ (-1))) ∨ (¬ ((x_6_7 + ((-1) * x_7_8)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3277 (t x_2_3 x_2_6 x_3_6 : ℝ) : (((((x_2_3 + ((-1) * x_2_6)) ≤ 0) ∧ ((x_2_6 + ((-1) * x_3_6)) ≤ 0) ∧ ((x_2_3 + ((-1) * x_3_6)) ≤ (-1)) ∧ ((t + x_2_3 + ((-1) * x_2_6)) ≥ 1) ∧ ((t + x_2_6 + ((-1) * x_3_6)) ≥ 1)) ∨ (((x_2_6 + ((-1) * x_3_6)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_2_6)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_3_6)) ≥ 1) ∧ ((t + ((-1) * x_2_3) + x_2_6) ≥ 1) ∧ ((t + ((-1) * x_2_6) + x_3_6) ≥ 1))) ↔ ((¬ ((¬ ((x_2_6 + ((-1) * x_3_6)) ≤ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_2_6)) ≤ 0)) ∨ (¬ ((t + x_2_3 + ((-1) * x_2_6)) ≥ 1)) ∨ (¬ ((t + x_2_6 + ((-1) * x_3_6)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_6 + ((-1) * x_3_6)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_2_6)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_3) + x_2_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_6) + x_3_6) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_6 + ((-1) * x_3_6)) ≥ 0) ↔ (¬ (((1) * x_2_6 + (-1) * x_3_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_3 + ((-1) * x_2_6)) ≥ 0) ↔ (¬ (((1) * x_2_3 + (-1) * x_2_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_3 + ((-1) * x_3_6)) ≥ 1) ↔ (¬ (((1) * x_2_3 + (-1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_2_3) + x_2_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_3 + (1) * x_2_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_6) + x_3_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_6 + (1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_3 + ((-1) * x_2_6)) ≤ 0) ↔ (((1) * x_2_3 + (-1) * x_2_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_6 + ((-1) * x_3_6)) ≤ 0) ↔ (((1) * x_2_6 + (-1) * x_3_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_3 + ((-1) * x_3_6)) ≤ (-1)) ↔ (((1) * x_2_3 + (-1) * x_3_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_2_3 + ((-1) * x_2_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_3 + (-1) * x_2_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_6 + ((-1) * x_3_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_6 + (-1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3278 (x_0_3 x_0_6 x_2_3 x_3_6 : ℝ) : (¬ ((x_2_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_2_3)) ≤ 0)) ∨ (¬ ((x_0_6 + ((-1) * x_3_6)) ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_0_6)) ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3279 (t x_0_3 x_0_7 x_3_7 : ℝ) : (((((x_0_3 + ((-1) * x_0_7)) ≤ 0) ∧ ((x_0_7 + ((-1) * x_3_7)) ≤ 0) ∧ ((x_0_3 + ((-1) * x_3_7)) ≤ (-1)) ∧ ((t + x_0_3 + ((-1) * x_0_7)) ≥ 1) ∧ ((t + x_0_7 + ((-1) * x_3_7)) ≥ 1)) ∨ (((x_0_7 + ((-1) * x_3_7)) ≥ 0) ∧ ((x_0_3 + ((-1) * x_0_7)) ≥ 0) ∧ ((x_0_3 + ((-1) * x_3_7)) ≥ 1) ∧ ((t + ((-1) * x_0_3) + x_0_7) ≥ 1) ∧ ((t + ((-1) * x_0_7) + x_3_7) ≥ 1))) ↔ ((¬ ((¬ ((x_0_3 + ((-1) * x_3_7)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_0_7)) ≤ 0)) ∨ (¬ ((t + x_0_3 + ((-1) * x_0_7)) ≥ 1)) ∨ (¬ ((x_0_7 + ((-1) * x_3_7)) ≤ 0)) ∨ (¬ ((t + x_0_7 + ((-1) * x_3_7)) ≥ 1)))) ∨ (¬ ((¬ ((t + ((-1) * x_0_3) + x_0_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_7) + x_3_7) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_0_7)) ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_7)) ≥ 1)) ∨ (¬ ((x_0_7 + ((-1) * x_3_7)) ≥ 0)))))) := by
  classical
  have e0 : ((x_0_3 + ((-1) * x_3_7)) ≥ 1) ↔ (¬ (((1) * x_0_3 + (-1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((t + ((-1) * x_0_3) + x_0_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_3 + (1) * x_0_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + ((-1) * x_0_7) + x_3_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_7 + (1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_3 + ((-1) * x_0_7)) ≥ 0) ↔ (¬ (((1) * x_0_3 + (-1) * x_0_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_0_7 + ((-1) * x_3_7)) ≥ 0) ↔ (¬ (((1) * x_0_7 + (-1) * x_3_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_3 + ((-1) * x_0_7)) ≤ 0) ↔ (((1) * x_0_3 + (-1) * x_0_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_7 + ((-1) * x_3_7)) ≤ 0) ↔ (((1) * x_0_7 + (-1) * x_3_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_3 + ((-1) * x_3_7)) ≤ (-1)) ↔ (((1) * x_0_3 + (-1) * x_3_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_0_3 + ((-1) * x_0_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_3 + (-1) * x_0_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_0_7 + ((-1) * x_3_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_7 + (-1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3281 (x_0_3 x_1_3 x_1_4 x_3_4 : ℝ) : (¬ ((x_1_4 + ((-1) * x_3_4)) ≤ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_1_3)) ≤ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_1_4)) ≤ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3282 (t x_0_5 x_1_5 x_5_6 x_5_7 x_6_7 x_7_9 : ℝ) : (¬ (x_7_9 ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_6_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((x_5_7 + ((-1) * x_6_7)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_1_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((x_0_5 + ((-1) * x_5_6)) ≥ 1)) ∨ ((t + ((-1) * x_0_5)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3283 (t x_0_1 x_1_5 x_5_6 x_6_7 x_7_9 : ℝ) : (¬ ((x_5_6 + ((-1) * x_6_7)) ≥ 1)) ∨ ((t + ((-1) * x_0_1)) ≤ 0) ∨ (¬ ((x_1_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_0_1 + ((-1) * x_1_5)) ≥ 1)) ∨ (¬ ((x_6_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ (x_7_9 ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3284 (t x_2_6 x_2_8 x_6_8 : ℝ) : (((((x_2_6 + ((-1) * x_2_8)) ≤ 0) ∧ ((x_2_8 + ((-1) * x_6_8)) ≤ 0) ∧ ((x_2_6 + ((-1) * x_6_8)) ≤ (-1)) ∧ ((t + x_2_6 + ((-1) * x_2_8)) ≥ 1) ∧ ((t + x_2_8 + ((-1) * x_6_8)) ≥ 1)) ∨ (((x_2_8 + ((-1) * x_6_8)) ≥ 0) ∧ ((x_2_6 + ((-1) * x_2_8)) ≥ 0) ∧ ((x_2_6 + ((-1) * x_6_8)) ≥ 1) ∧ ((t + ((-1) * x_2_6) + x_2_8) ≥ 1) ∧ ((t + ((-1) * x_2_8) + x_6_8) ≥ 1))) ↔ ((¬ ((¬ ((x_2_8 + ((-1) * x_6_8)) ≤ 0)) ∨ (¬ ((x_2_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_2_6 + ((-1) * x_2_8)) ≤ 0)) ∨ (¬ ((t + x_2_6 + ((-1) * x_2_8)) ≥ 1)) ∨ (¬ ((t + x_2_8 + ((-1) * x_6_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_8 + ((-1) * x_6_8)) ≥ 0)) ∨ (¬ ((x_2_6 + ((-1) * x_2_8)) ≥ 0)) ∨ (¬ ((x_2_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_6) + x_2_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_8) + x_6_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_8 + ((-1) * x_6_8)) ≤ 0) ↔ (((1) * x_2_8 + (-1) * x_6_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_6 + ((-1) * x_6_8)) ≤ (-1)) ↔ (((1) * x_2_6 + (-1) * x_6_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_6 + ((-1) * x_2_8)) ≤ 0) ↔ (((1) * x_2_6 + (-1) * x_2_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_2_6 + ((-1) * x_2_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_6 + (-1) * x_2_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_2_8 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_8 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_6 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * x_2_6 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_8 + ((-1) * x_6_8)) ≥ 0) ↔ (¬ (((1) * x_2_8 + (-1) * x_6_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_6 + ((-1) * x_2_8)) ≥ 0) ↔ (¬ (((1) * x_2_6 + (-1) * x_2_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_2_6) + x_2_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_6 + (1) * x_2_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_2_8) + x_6_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_8 + (1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3285 (t x_0_1 x_1_2 x_2_6 x_6_8 x_8_9 : ℝ) : (t ≥ 4) ∨ ((t + ((-1) * x_0_1)) ≤ 0) ∨ (¬ ((x_0_1 + ((-1) * x_1_2)) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_2_6)) ≥ 1)) ∨ (¬ (x_8_9 ≥ 0)) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_2_6 + ((-1) * x_6_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3286 (t x_1_2 x_1_6 x_2_6 : ℝ) : (((((x_1_2 + ((-1) * x_1_6)) ≤ 0) ∧ ((x_1_6 + ((-1) * x_2_6)) ≤ 0) ∧ ((x_1_2 + ((-1) * x_2_6)) ≤ (-1)) ∧ ((t + x_1_2 + ((-1) * x_1_6)) ≥ 1) ∧ ((t + x_1_6 + ((-1) * x_2_6)) ≥ 1)) ∨ (((x_1_6 + ((-1) * x_2_6)) ≥ 0) ∧ ((x_1_2 + ((-1) * x_1_6)) ≥ 0) ∧ ((x_1_2 + ((-1) * x_2_6)) ≥ 1) ∧ ((t + ((-1) * x_1_2) + x_1_6) ≥ 1) ∧ ((t + ((-1) * x_1_6) + x_2_6) ≥ 1))) ↔ ((¬ ((¬ ((x_1_2 + ((-1) * x_2_6)) ≤ (-1))) ∨ (¬ ((x_1_2 + ((-1) * x_1_6)) ≤ 0)) ∨ (¬ ((t + x_1_6 + ((-1) * x_2_6)) ≥ 1)) ∨ (¬ ((x_1_6 + ((-1) * x_2_6)) ≤ 0)) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_6)) ≥ 1)))) ∨ (¬ ((¬ ((t + ((-1) * x_1_6) + x_2_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_6) ≥ 1)) ∨ (¬ ((x_1_6 + ((-1) * x_2_6)) ≥ 0)) ∨ (¬ ((x_1_2 + ((-1) * x_1_6)) ≥ 0)) ∨ (¬ ((x_1_2 + ((-1) * x_2_6)) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_2 + ((-1) * x_2_6)) ≥ 1) ↔ (¬ (((1) * x_1_2 + (-1) * x_2_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((t + ((-1) * x_1_6) + x_2_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_6 + (1) * x_2_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + ((-1) * x_1_2) + x_1_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_2 + (1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_1_6 + ((-1) * x_2_6)) ≥ 0) ↔ (¬ (((1) * x_1_6 + (-1) * x_2_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_1_2 + ((-1) * x_1_6)) ≥ 0) ↔ (¬ (((1) * x_1_2 + (-1) * x_1_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_2 + ((-1) * x_1_6)) ≤ 0) ↔ (((1) * x_1_2 + (-1) * x_1_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_6 + ((-1) * x_2_6)) ≤ 0) ↔ (((1) * x_1_6 + (-1) * x_2_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_2 + ((-1) * x_2_6)) ≤ (-1)) ↔ (((1) * x_1_2 + (-1) * x_2_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_1_2 + ((-1) * x_1_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_2 + (-1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_1_6 + ((-1) * x_2_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_6 + (-1) * x_2_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3287 (t x_1_2 x_1_5 x_2_5 : ℝ) : (((((x_1_2 + ((-1) * x_1_5)) ≤ 0) ∧ ((x_1_5 + ((-1) * x_2_5)) ≤ 0) ∧ ((x_1_2 + ((-1) * x_2_5)) ≤ (-1)) ∧ ((t + x_1_2 + ((-1) * x_1_5)) ≥ 1) ∧ ((t + x_1_5 + ((-1) * x_2_5)) ≥ 1)) ∨ (((x_1_5 + ((-1) * x_2_5)) ≥ 0) ∧ ((x_1_2 + ((-1) * x_1_5)) ≥ 0) ∧ ((x_1_2 + ((-1) * x_2_5)) ≥ 1) ∧ ((t + ((-1) * x_1_2) + x_1_5) ≥ 1) ∧ ((t + ((-1) * x_1_5) + x_2_5) ≥ 1))) ↔ ((¬ ((¬ ((x_1_2 + ((-1) * x_2_5)) ≤ (-1))) ∨ (¬ ((t + x_1_5 + ((-1) * x_2_5)) ≥ 1)) ∨ (¬ ((x_1_5 + ((-1) * x_2_5)) ≤ 0)) ∨ (¬ ((t + x_1_2 + ((-1) * x_1_5)) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_1_5)) ≤ 0)))) ∨ (¬ ((¬ ((t + ((-1) * x_1_5) + x_2_5) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_2) + x_1_5) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_1_5)) ≥ 0)) ∨ (¬ ((x_1_2 + ((-1) * x_2_5)) ≥ 1)) ∨ (¬ ((x_1_5 + ((-1) * x_2_5)) ≥ 0)))))) := by
  classical
  have e0 : ((x_1_2 + ((-1) * x_2_5)) ≥ 1) ↔ (¬ (((1) * x_1_2 + (-1) * x_2_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_2 + ((-1) * x_1_5)) ≤ 0) ↔ (((1) * x_1_2 + (-1) * x_1_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_5 + ((-1) * x_2_5)) ≤ 0) ↔ (((1) * x_1_5 + (-1) * x_2_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_1_2 + ((-1) * x_2_5)) ≤ (-1)) ↔ (((1) * x_1_2 + (-1) * x_2_5 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_1_2 + ((-1) * x_1_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_2 + (-1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_1_5 + ((-1) * x_2_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_5 + (-1) * x_2_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_5 + ((-1) * x_2_5)) ≥ 0) ↔ (¬ (((1) * x_1_5 + (-1) * x_2_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_2 + ((-1) * x_1_5)) ≥ 0) ↔ (¬ (((1) * x_1_2 + (-1) * x_1_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_2) + x_1_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_2 + (1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_5) + x_2_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_5 + (1) * x_2_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3288 (t x_2_4 x_2_5 x_4_5 : ℝ) : (((((x_2_4 + ((-1) * x_2_5)) ≤ 0) ∧ ((x_2_5 + ((-1) * x_4_5)) ≤ 0) ∧ ((x_2_4 + ((-1) * x_4_5)) ≤ (-1)) ∧ ((t + x_2_4 + ((-1) * x_2_5)) ≥ 1) ∧ ((t + x_2_5 + ((-1) * x_4_5)) ≥ 1)) ∨ (((x_2_5 + ((-1) * x_4_5)) ≥ 0) ∧ ((x_2_4 + ((-1) * x_2_5)) ≥ 0) ∧ ((x_2_4 + ((-1) * x_4_5)) ≥ 1) ∧ ((t + ((-1) * x_2_4) + x_2_5) ≥ 1) ∧ ((t + ((-1) * x_2_5) + x_4_5) ≥ 1))) ↔ ((¬ ((¬ ((x_2_5 + ((-1) * x_4_5)) ≤ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_2_5)) ≤ 0)) ∨ (¬ ((t + x_2_4 + ((-1) * x_2_5)) ≥ 1)) ∨ (¬ ((t + x_2_5 + ((-1) * x_4_5)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_5 + ((-1) * x_4_5)) ≥ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_2_5)) ≥ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_4_5)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_4) + x_2_5) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_5) + x_4_5) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_4 + ((-1) * x_2_5)) ≤ 0) ↔ (((1) * x_2_4 + (-1) * x_2_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_5 + ((-1) * x_4_5)) ≥ 0) ↔ (¬ (((1) * x_2_5 + (-1) * x_4_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_4 + ((-1) * x_2_5)) ≥ 0) ↔ (¬ (((1) * x_2_4 + (-1) * x_2_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_2_4 + ((-1) * x_4_5)) ≥ 1) ↔ (¬ (((1) * x_2_4 + (-1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_4) + x_2_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_4 + (1) * x_2_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + ((-1) * x_2_5) + x_4_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_5 + (1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_5 + ((-1) * x_4_5)) ≤ 0) ↔ (((1) * x_2_5 + (-1) * x_4_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_4 + ((-1) * x_4_5)) ≤ (-1)) ↔ (((1) * x_2_4 + (-1) * x_4_5 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_2_4 + ((-1) * x_2_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_4 + (-1) * x_2_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_5 + ((-1) * x_4_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_5 + (-1) * x_4_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3289 (t x_2_5 x_2_6 x_5_6 : ℝ) : (((((x_2_5 + ((-1) * x_2_6)) ≤ 0) ∧ ((x_2_6 + ((-1) * x_5_6)) ≤ 0) ∧ ((x_2_5 + ((-1) * x_5_6)) ≤ (-1)) ∧ ((t + x_2_5 + ((-1) * x_2_6)) ≥ 1) ∧ ((t + x_2_6 + ((-1) * x_5_6)) ≥ 1)) ∨ (((x_2_6 + ((-1) * x_5_6)) ≥ 0) ∧ ((x_2_5 + ((-1) * x_2_6)) ≥ 0) ∧ ((x_2_5 + ((-1) * x_5_6)) ≥ 1) ∧ ((t + ((-1) * x_2_5) + x_2_6) ≥ 1) ∧ ((t + ((-1) * x_2_6) + x_5_6) ≥ 1))) ↔ ((¬ ((¬ ((x_2_6 + ((-1) * x_5_6)) ≤ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_2_6)) ≤ 0)) ∨ (¬ ((t + x_2_5 + ((-1) * x_2_6)) ≥ 1)) ∨ (¬ ((t + x_2_6 + ((-1) * x_5_6)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_6 + ((-1) * x_5_6)) ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_2_6)) ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_5) + x_2_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_6) + x_5_6) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_5 + ((-1) * x_2_6)) ≤ 0) ↔ (((1) * x_2_5 + (-1) * x_2_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_5 + ((-1) * x_5_6)) ≤ (-1)) ↔ (((1) * x_2_5 + (-1) * x_5_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_6 + ((-1) * x_5_6)) ≤ 0) ↔ (((1) * x_2_6 + (-1) * x_5_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_2_5 + ((-1) * x_2_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_5 + (-1) * x_2_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_2_6 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_6 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_5 + ((-1) * x_5_6)) ≥ 1) ↔ (¬ (((1) * x_2_5 + (-1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_6 + ((-1) * x_5_6)) ≥ 0) ↔ (¬ (((1) * x_2_6 + (-1) * x_5_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_5 + ((-1) * x_2_6)) ≥ 0) ↔ (¬ (((1) * x_2_5 + (-1) * x_2_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_2_5) + x_2_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_5 + (1) * x_2_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_2_6) + x_5_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_6 + (1) * x_5_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3290 (t x_0_2 x_2_5 x_5_6 x_6_8 x_8_9 : ℝ) : (¬ ((x_0_2 + ((-1) * x_2_5)) ≥ 1)) ∨ (¬ ((x_6_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_5_6 + ((-1) * x_6_8)) ≥ 1)) ∨ ((t + ((-1) * x_0_2)) ≤ 0) ∨ (¬ ((x_2_5 + ((-1) * x_5_6)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ (x_8_9 ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3291 (t x_2_5 x_2_7 x_5_7 : ℝ) : (((((x_2_5 + ((-1) * x_2_7)) ≤ 0) ∧ ((x_2_7 + ((-1) * x_5_7)) ≤ 0) ∧ ((x_2_5 + ((-1) * x_5_7)) ≤ (-1)) ∧ ((t + x_2_5 + ((-1) * x_2_7)) ≥ 1) ∧ ((t + x_2_7 + ((-1) * x_5_7)) ≥ 1)) ∨ (((x_2_7 + ((-1) * x_5_7)) ≥ 0) ∧ ((x_2_5 + ((-1) * x_2_7)) ≥ 0) ∧ ((x_2_5 + ((-1) * x_5_7)) ≥ 1) ∧ ((t + ((-1) * x_2_5) + x_2_7) ≥ 1) ∧ ((t + ((-1) * x_2_7) + x_5_7) ≥ 1))) ↔ ((¬ ((¬ ((x_2_7 + ((-1) * x_5_7)) ≤ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_2_7)) ≤ 0)) ∨ (¬ ((t + x_2_5 + ((-1) * x_2_7)) ≥ 1)) ∨ (¬ ((t + x_2_7 + ((-1) * x_5_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_7 + ((-1) * x_5_7)) ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_2_7)) ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_5) + x_2_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_7) + x_5_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_5 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * x_2_5 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_7 + ((-1) * x_5_7)) ≥ 0) ↔ (¬ (((1) * x_2_7 + (-1) * x_5_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_5 + ((-1) * x_2_7)) ≥ 0) ↔ (¬ (((1) * x_2_5 + (-1) * x_2_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_2_5) + x_2_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_5 + (1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_7) + x_5_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_7 + (1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_5 + ((-1) * x_2_7)) ≤ 0) ↔ (((1) * x_2_5 + (-1) * x_2_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_7 + ((-1) * x_5_7)) ≤ 0) ↔ (((1) * x_2_7 + (-1) * x_5_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_5 + ((-1) * x_5_7)) ≤ (-1)) ↔ (((1) * x_2_5 + (-1) * x_5_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_2_5 + ((-1) * x_2_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_5 + (-1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_7 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_7 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3292 (x_0_5 x_2_5 x_5_7 : ℝ) : (¬ ((x_0_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_2_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_0_5 + ((-1) * x_2_5)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2⟩
  linarith

theorem theory3293 (t x_0_1 x_1_2 x_2_7 x_7_8 x_8_9 : ℝ) : (¬ ((x_2_7 + ((-1) * x_7_8)) ≥ 1)) ∨ ((t + ((-1) * x_0_1)) ≤ 0) ∨ (¬ (x_8_9 ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_1_2 + ((-1) * x_2_7)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_2)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3294 (t x_5_7 x_5_8 x_7_8 : ℝ) : (((((x_5_7 + ((-1) * x_5_8)) ≤ 0) ∧ ((x_5_8 + ((-1) * x_7_8)) ≤ 0) ∧ ((x_5_7 + ((-1) * x_7_8)) ≤ (-1)) ∧ ((t + x_5_7 + ((-1) * x_5_8)) ≥ 1) ∧ ((t + x_5_8 + ((-1) * x_7_8)) ≥ 1)) ∨ (((x_5_8 + ((-1) * x_7_8)) ≥ 0) ∧ ((x_5_7 + ((-1) * x_5_8)) ≥ 0) ∧ ((x_5_7 + ((-1) * x_7_8)) ≥ 1) ∧ ((t + ((-1) * x_5_7) + x_5_8) ≥ 1) ∧ ((t + ((-1) * x_5_8) + x_7_8) ≥ 1))) ↔ ((¬ ((¬ ((x_5_8 + ((-1) * x_7_8)) ≤ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((x_5_7 + ((-1) * x_5_8)) ≤ 0)) ∨ (¬ ((t + x_5_7 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((t + x_5_8 + ((-1) * x_7_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_5_8 + ((-1) * x_7_8)) ≥ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_5_8)) ≥ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_7) + x_5_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_8) + x_7_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_5_7 + ((-1) * x_5_8)) ≤ 0) ↔ (((1) * x_5_7 + (-1) * x_5_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_5_7 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * x_5_7 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_5_8 + ((-1) * x_7_8)) ≥ 0) ↔ (¬ (((1) * x_5_8 + (-1) * x_7_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_5_7 + ((-1) * x_5_8)) ≥ 0) ↔ (¬ (((1) * x_5_7 + (-1) * x_5_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_5_7) + x_5_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_7 + (1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + ((-1) * x_5_8) + x_7_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_8 + (1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_5_8 + ((-1) * x_7_8)) ≤ 0) ↔ (((1) * x_5_8 + (-1) * x_7_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_5_7 + ((-1) * x_7_8)) ≤ (-1)) ↔ (((1) * x_5_7 + (-1) * x_7_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_5_7 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_7 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_5_8 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_8 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3295 (t x_1_5 x_1_7 x_5_7 : ℝ) : (((((x_1_5 + ((-1) * x_1_7)) ≤ 0) ∧ ((x_1_7 + ((-1) * x_5_7)) ≤ 0) ∧ ((x_1_5 + ((-1) * x_5_7)) ≤ (-1)) ∧ ((t + x_1_5 + ((-1) * x_1_7)) ≥ 1) ∧ ((t + x_1_7 + ((-1) * x_5_7)) ≥ 1)) ∨ (((x_1_7 + ((-1) * x_5_7)) ≥ 0) ∧ ((x_1_5 + ((-1) * x_1_7)) ≥ 0) ∧ ((x_1_5 + ((-1) * x_5_7)) ≥ 1) ∧ ((t + ((-1) * x_1_5) + x_1_7) ≥ 1) ∧ ((t + ((-1) * x_1_7) + x_5_7) ≥ 1))) ↔ ((¬ ((¬ ((x_1_7 + ((-1) * x_5_7)) ≤ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_1_5 + ((-1) * x_1_7)) ≤ 0)) ∨ (¬ ((t + x_1_5 + ((-1) * x_1_7)) ≥ 1)) ∨ (¬ ((t + x_1_7 + ((-1) * x_5_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_7 + ((-1) * x_5_7)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_1_7)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_5) + x_1_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_7) + x_5_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_5 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * x_1_5 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_7 + ((-1) * x_5_7)) ≥ 0) ↔ (¬ (((1) * x_1_7 + (-1) * x_5_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_5 + ((-1) * x_1_7)) ≥ 0) ↔ (¬ (((1) * x_1_5 + (-1) * x_1_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_1_5) + x_1_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_5 + (1) * x_1_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_1_7) + x_5_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_7 + (1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_5 + ((-1) * x_1_7)) ≤ 0) ↔ (((1) * x_1_5 + (-1) * x_1_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_7 + ((-1) * x_5_7)) ≤ 0) ↔ (((1) * x_1_7 + (-1) * x_5_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_5 + ((-1) * x_5_7)) ≤ (-1)) ↔ (((1) * x_1_5 + (-1) * x_5_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_1_5 + ((-1) * x_1_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_5 + (-1) * x_1_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_1_7 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_7 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3296 (t x_3_5 x_3_7 x_5_7 : ℝ) : (((((x_3_5 + ((-1) * x_3_7)) ≤ 0) ∧ ((x_3_7 + ((-1) * x_5_7)) ≤ 0) ∧ ((x_3_5 + ((-1) * x_5_7)) ≤ (-1)) ∧ ((t + x_3_5 + ((-1) * x_3_7)) ≥ 1) ∧ ((t + x_3_7 + ((-1) * x_5_7)) ≥ 1)) ∨ (((x_3_7 + ((-1) * x_5_7)) ≥ 0) ∧ ((x_3_5 + ((-1) * x_3_7)) ≥ 0) ∧ ((x_3_5 + ((-1) * x_5_7)) ≥ 1) ∧ ((t + ((-1) * x_3_5) + x_3_7) ≥ 1) ∧ ((t + ((-1) * x_3_7) + x_5_7) ≥ 1))) ↔ ((¬ ((¬ ((x_3_7 + ((-1) * x_5_7)) ≤ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_3_5 + ((-1) * x_3_7)) ≤ 0)) ∨ (¬ ((t + x_3_5 + ((-1) * x_3_7)) ≥ 1)) ∨ (¬ ((t + x_3_7 + ((-1) * x_5_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_7 + ((-1) * x_5_7)) ≥ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_3_7)) ≥ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_5) + x_3_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_7) + x_5_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_7 + ((-1) * x_5_7)) ≥ 0) ↔ (¬ (((1) * x_3_7 + (-1) * x_5_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_5 + ((-1) * x_3_7)) ≥ 0) ↔ (¬ (((1) * x_3_5 + (-1) * x_3_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_5 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * x_3_5 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_3_5) + x_3_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_5 + (1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_3_7) + x_5_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_7 + (1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_3_5 + ((-1) * x_3_7)) ≤ 0) ↔ (((1) * x_3_5 + (-1) * x_3_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_7 + ((-1) * x_5_7)) ≤ 0) ↔ (((1) * x_3_7 + (-1) * x_5_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_5 + ((-1) * x_5_7)) ≤ (-1)) ↔ (((1) * x_3_5 + (-1) * x_5_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_3_5 + ((-1) * x_3_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_5 + (-1) * x_3_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_3_7 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_7 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3297 (t x_4_7 x_4_8 x_7_8 : ℝ) : (((((x_4_7 + ((-1) * x_4_8)) ≤ 0) ∧ ((x_4_8 + ((-1) * x_7_8)) ≤ 0) ∧ ((x_4_7 + ((-1) * x_7_8)) ≤ (-1)) ∧ ((t + x_4_7 + ((-1) * x_4_8)) ≥ 1) ∧ ((t + x_4_8 + ((-1) * x_7_8)) ≥ 1)) ∨ (((x_4_8 + ((-1) * x_7_8)) ≥ 0) ∧ ((x_4_7 + ((-1) * x_4_8)) ≥ 0) ∧ ((x_4_7 + ((-1) * x_7_8)) ≥ 1) ∧ ((t + ((-1) * x_4_7) + x_4_8) ≥ 1) ∧ ((t + ((-1) * x_4_8) + x_7_8) ≥ 1))) ↔ ((¬ ((¬ ((x_4_8 + ((-1) * x_7_8)) ≤ 0)) ∨ (¬ ((x_4_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((x_4_7 + ((-1) * x_4_8)) ≤ 0)) ∨ (¬ ((t + x_4_7 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((t + x_4_8 + ((-1) * x_7_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_8 + ((-1) * x_7_8)) ≥ 0)) ∨ (¬ ((x_4_7 + ((-1) * x_4_8)) ≥ 0)) ∨ (¬ ((x_4_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_7) + x_4_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_8) + x_7_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_4_8 + ((-1) * x_7_8)) ≥ 0) ↔ (¬ (((1) * x_4_8 + (-1) * x_7_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_7 + ((-1) * x_4_8)) ≥ 0) ↔ (¬ (((1) * x_4_7 + (-1) * x_4_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_7 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * x_4_7 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_4_7) + x_4_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_7 + (1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_4_8) + x_7_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_8 + (1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_4_7 + ((-1) * x_4_8)) ≤ 0) ↔ (((1) * x_4_7 + (-1) * x_4_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_4_8 + ((-1) * x_7_8)) ≤ 0) ↔ (((1) * x_4_8 + (-1) * x_7_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_4_7 + ((-1) * x_7_8)) ≤ (-1)) ↔ (((1) * x_4_7 + (-1) * x_7_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_4_7 + ((-1) * x_4_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_7 + (-1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_4_8 + ((-1) * x_7_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_8 + (-1) * x_7_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3298 (t x_0_3 x_1_3 x_3_4 x_3_7 x_4_7 x_7_8 : ℝ) : (¬ ((x_4_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ (x_1_3 ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_7)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_3_7 + ((-1) * x_4_7)) ≤ 0)) ∨ ((t + ((-1) * x_7_8)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3299 (t x_0_3 x_2_3 x_3_4 x_3_5 x_4_5 x_5_7 : ℝ) : (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) ∨ ((t + ((-1) * x_5_7)) ≤ 0) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ (x_2_3 ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_3_5 + ((-1) * x_4_5)) ≤ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_3_5)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_3_4)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3301 (t x_1_5 x_1_9 x_5_9 : ℝ) : (((((x_1_5 + ((-1) * x_1_9)) ≤ 0) ∧ ((x_1_9 + ((-1) * x_5_9)) ≤ 0) ∧ ((x_1_5 + ((-1) * x_5_9)) ≤ (-1)) ∧ ((t + x_1_5 + ((-1) * x_1_9)) ≥ 1) ∧ ((t + x_1_9 + ((-1) * x_5_9)) ≥ 1)) ∨ (((x_1_9 + ((-1) * x_5_9)) ≥ 0) ∧ ((x_1_5 + ((-1) * x_1_9)) ≥ 0) ∧ ((x_1_5 + ((-1) * x_5_9)) ≥ 1) ∧ ((t + ((-1) * x_1_5) + x_1_9) ≥ 1) ∧ ((t + ((-1) * x_1_9) + x_5_9) ≥ 1))) ↔ ((¬ ((¬ ((x_1_9 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_9)) ≤ (-1))) ∨ (¬ ((x_1_5 + ((-1) * x_1_9)) ≤ 0)) ∨ (¬ ((t + x_1_5 + ((-1) * x_1_9)) ≥ 1)) ∨ (¬ ((t + x_1_9 + ((-1) * x_5_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_9 + ((-1) * x_5_9)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_1_9)) ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_5) + x_1_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_9) + x_5_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_5 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * x_1_5 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_9 + ((-1) * x_5_9)) ≥ 0) ↔ (¬ (((1) * x_1_9 + (-1) * x_5_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_5 + ((-1) * x_1_9)) ≥ 0) ↔ (¬ (((1) * x_1_5 + (-1) * x_1_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_1_5) + x_1_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_5 + (1) * x_1_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_1_9) + x_5_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_9 + (1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_5 + ((-1) * x_1_9)) ≤ 0) ↔ (((1) * x_1_5 + (-1) * x_1_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_9 + ((-1) * x_5_9)) ≤ 0) ↔ (((1) * x_1_9 + (-1) * x_5_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_5 + ((-1) * x_5_9)) ≤ (-1)) ↔ (((1) * x_1_5 + (-1) * x_5_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_1_5 + ((-1) * x_1_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_5 + (-1) * x_1_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_1_9 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_9 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3302 (t x_1_5 x_4_5 x_5_6 x_5_7 x_5_9 : ℝ) : (¬ ((x_1_5 + ((-1) * x_5_7)) ≥ 1)) ∨ ((t + ((-1) * x_5_6)) ≤ 0) ∨ (¬ ((x_4_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((x_4_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ (x_5_7 ≥ 0)) ∨ (¬ ((x_1_5 + ((-1) * x_5_9)) ≤ (-1))) ∨ (t ≥ 4) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3303 (t x_4_5 x_4_9 x_5_9 : ℝ) : (((((x_4_5 + ((-1) * x_4_9)) ≤ 0) ∧ ((x_4_9 + ((-1) * x_5_9)) ≤ 0) ∧ ((x_4_5 + ((-1) * x_5_9)) ≤ (-1)) ∧ ((t + x_4_5 + ((-1) * x_4_9)) ≥ 1) ∧ ((t + x_4_9 + ((-1) * x_5_9)) ≥ 1)) ∨ (((x_4_9 + ((-1) * x_5_9)) ≥ 0) ∧ ((x_4_5 + ((-1) * x_4_9)) ≥ 0) ∧ ((x_4_5 + ((-1) * x_5_9)) ≥ 1) ∧ ((t + ((-1) * x_4_5) + x_4_9) ≥ 1) ∧ ((t + ((-1) * x_4_9) + x_5_9) ≥ 1))) ↔ ((¬ ((¬ ((x_4_9 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_9)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_4_9)) ≤ 0)) ∨ (¬ ((t + x_4_5 + ((-1) * x_4_9)) ≥ 1)) ∨ (¬ ((t + x_4_9 + ((-1) * x_5_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_4_9 + ((-1) * x_5_9)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_4_9)) ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_5) + x_4_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_4_9) + x_5_9) ≥ 1)))))) := by
  classical
  have e0 : ((t + x_4_5 + ((-1) * x_4_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_5 + (-1) * x_4_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_4_5 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * x_4_5 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_4_9 + ((-1) * x_5_9)) ≥ 0) ↔ (¬ (((1) * x_4_9 + (-1) * x_5_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_4_5 + ((-1) * x_4_9)) ≥ 0) ↔ (¬ (((1) * x_4_5 + (-1) * x_4_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_4_5) + x_4_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_5 + (1) * x_4_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + ((-1) * x_4_9) + x_5_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_4_9 + (1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_4_5 + ((-1) * x_4_9)) ≤ 0) ↔ (((1) * x_4_5 + (-1) * x_4_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_4_9 + ((-1) * x_5_9)) ≤ 0) ↔ (((1) * x_4_9 + (-1) * x_5_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((x_4_5 + ((-1) * x_5_9)) ≤ (-1)) ↔ (((1) * x_4_5 + (-1) * x_5_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_4_9 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_4_9 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3304 (t x_0_3 x_1_3 x_3_4 x_3_5 x_5_6 : ℝ) : (¬ (x_1_3 ≥ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (t ≥ 4) ∨ ((t + ((-1) * x_5_6)) ≤ 0) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_5)) ≤ (-1))) ∨ (¬ ((x_3_5 + ((-1) * x_5_6)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3305 (t x_1_3 x_1_5 x_3_5 : ℝ) : (((((x_1_3 + ((-1) * x_1_5)) ≤ 0) ∧ ((x_1_5 + ((-1) * x_3_5)) ≤ 0) ∧ ((x_1_3 + ((-1) * x_3_5)) ≤ (-1)) ∧ ((t + x_1_3 + ((-1) * x_1_5)) ≥ 1) ∧ ((t + x_1_5 + ((-1) * x_3_5)) ≥ 1)) ∨ (((x_1_5 + ((-1) * x_3_5)) ≥ 0) ∧ ((x_1_3 + ((-1) * x_1_5)) ≥ 0) ∧ ((x_1_3 + ((-1) * x_3_5)) ≥ 1) ∧ ((t + ((-1) * x_1_3) + x_1_5) ≥ 1) ∧ ((t + ((-1) * x_1_5) + x_3_5) ≥ 1))) ↔ ((¬ ((¬ ((x_1_3 + ((-1) * x_1_5)) ≤ 0)) ∨ (¬ ((t + x_1_3 + ((-1) * x_1_5)) ≥ 1)) ∨ (¬ ((x_1_5 + ((-1) * x_3_5)) ≤ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_5)) ≤ (-1))) ∨ (¬ ((t + x_1_5 + ((-1) * x_3_5)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_3 + ((-1) * x_3_5)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_3) + x_1_5) ≥ 1)) ∨ (¬ ((x_1_5 + ((-1) * x_3_5)) ≥ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_1_5)) ≥ 0)) ∨ (¬ ((t + ((-1) * x_1_5) + x_3_5) ≥ 1)))))) := by
  classical
  have e0 : ((t + x_1_3 + ((-1) * x_1_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_3 + (-1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((t + x_1_5 + ((-1) * x_3_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_5 + (-1) * x_3_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_3 + ((-1) * x_1_5)) ≤ 0) ↔ (((1) * x_1_3 + (-1) * x_1_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_1_5 + ((-1) * x_3_5)) ≤ 0) ↔ (((1) * x_1_5 + (-1) * x_3_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_1_3 + ((-1) * x_3_5)) ≤ (-1)) ↔ (((1) * x_1_3 + (-1) * x_3_5 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_3 + ((-1) * x_3_5)) ≥ 1) ↔ (¬ (((1) * x_1_3 + (-1) * x_3_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_5 + ((-1) * x_3_5)) ≥ 0) ↔ (¬ (((1) * x_1_5 + (-1) * x_3_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_3 + ((-1) * x_1_5)) ≥ 0) ↔ (¬ (((1) * x_1_3 + (-1) * x_1_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_3) + x_1_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_3 + (1) * x_1_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_5) + x_3_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_5 + (1) * x_3_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3306 (t x_5_6 x_5_7 x_6_7 : ℝ) : ((t + ((-1) * x_6_7)) ≤ 0) ∨ ((t + ((-1) * x_5_6) + x_5_7) ≥ 1) ∨ (¬ ((x_5_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ (¬ (x_5_7 ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3308 (t x_1_3 x_3_4 x_3_5 x_4_5 x_5_6 x_5_7 : ℝ) : (¬ ((x_4_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ ((t + ((-1) * x_5_6)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ (x_1_3 ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_3_4 + ((-1) * x_3_5)) ≤ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_7)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3309 (t x_0_4 x_1_3 x_3_4 x_4_5 x_5_7 x_7_8 : ℝ) : (¬ (x_1_3 ≥ 0)) ∨ ((t + ((-1) * x_7_8)) ≤ 0) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_0_4 + ((-1) * x_3_4)) ≥ 0)) ∨ (¬ ((x_0_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((x_5_7 + ((-1) * x_7_8)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3310 (t x_0_1 x_1_5 x_5_7 x_7_8 x_8_9 : ℝ) : (t ≥ 4) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≥ 1)) ∨ ((t + ((-1) * x_0_1)) ≤ 0) ∨ (¬ ((x_0_1 + ((-1) * x_1_5)) ≥ 1)) ∨ (¬ (x_8_9 ≥ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_7_8)) ≥ 1)) ∨ (¬ ((x_1_5 + ((-1) * x_5_7)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3311 (t x_2_3 x_2_8 x_3_8 : ℝ) : (((((x_2_3 + ((-1) * x_2_8)) ≤ 0) ∧ ((x_2_8 + ((-1) * x_3_8)) ≤ 0) ∧ ((x_2_3 + ((-1) * x_3_8)) ≤ (-1)) ∧ ((t + x_2_3 + ((-1) * x_2_8)) ≥ 1) ∧ ((t + x_2_8 + ((-1) * x_3_8)) ≥ 1)) ∨ (((x_2_8 + ((-1) * x_3_8)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_2_8)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_3_8)) ≥ 1) ∧ ((t + ((-1) * x_2_3) + x_2_8) ≥ 1) ∧ ((t + ((-1) * x_2_8) + x_3_8) ≥ 1))) ↔ ((¬ ((¬ ((x_2_8 + ((-1) * x_3_8)) ≤ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_8)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_2_8)) ≤ 0)) ∨ (¬ ((t + x_2_3 + ((-1) * x_2_8)) ≥ 1)) ∨ (¬ ((t + x_2_8 + ((-1) * x_3_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_8 + ((-1) * x_3_8)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_2_8)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_3) + x_2_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_8) + x_3_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_8 + ((-1) * x_3_8)) ≤ 0) ↔ (((1) * x_2_8 + (-1) * x_3_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_3 + ((-1) * x_3_8)) ≤ (-1)) ↔ (((1) * x_2_3 + (-1) * x_3_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_3 + ((-1) * x_2_8)) ≤ 0) ↔ (((1) * x_2_3 + (-1) * x_2_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_2_3 + ((-1) * x_2_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_3 + (-1) * x_2_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_2_8 + ((-1) * x_3_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_8 + (-1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_3 + ((-1) * x_3_8)) ≥ 1) ↔ (¬ (((1) * x_2_3 + (-1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_8 + ((-1) * x_3_8)) ≥ 0) ↔ (¬ (((1) * x_2_8 + (-1) * x_3_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_3 + ((-1) * x_2_8)) ≥ 0) ↔ (¬ (((1) * x_2_3 + (-1) * x_2_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_2_3) + x_2_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_3 + (1) * x_2_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_2_8) + x_3_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_8 + (1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3312 (t x_0_2 x_0_3 x_2_3 x_3_4 x_3_8 x_8_9 : ℝ) : (¬ ((x_2_3 + ((-1) * x_3_8)) ≥ 1)) ∨ (¬ (x_8_9 ≥ 0)) ∨ ((t + ((-1) * x_0_2)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ ((x_3_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((x_0_2 + ((-1) * x_0_3)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3313 (x_0_3 x_0_5 x_1_3 x_3_5 : ℝ) : (¬ ((x_1_3 + ((-1) * x_3_5)) ≤ (-1))) ∨ (¬ ((x_0_5 + ((-1) * x_3_5)) ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_0_5)) ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_1_3)) ≤ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3314 (t x_4_5 x_4_6 x_5_6 : ℝ) : (¬ (x_5_6 ≥ 0)) ∨ ((t + ((-1) * x_4_6)) ≤ 0) ∨ ((t + x_4_5 + ((-1) * x_4_6)) ≥ 1) ∨ (¬ ((x_4_5 + ((-1) * x_5_6)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3315 (t x_3_4 x_3_6 x_4_6 : ℝ) : (((((x_3_4 + ((-1) * x_3_6)) ≤ 0) ∧ ((x_3_6 + ((-1) * x_4_6)) ≤ 0) ∧ ((x_3_4 + ((-1) * x_4_6)) ≤ (-1)) ∧ ((t + x_3_4 + ((-1) * x_3_6)) ≥ 1) ∧ ((t + x_3_6 + ((-1) * x_4_6)) ≥ 1)) ∨ (((x_3_6 + ((-1) * x_4_6)) ≥ 0) ∧ ((x_3_4 + ((-1) * x_3_6)) ≥ 0) ∧ ((x_3_4 + ((-1) * x_4_6)) ≥ 1) ∧ ((t + ((-1) * x_3_4) + x_3_6) ≥ 1) ∧ ((t + ((-1) * x_3_6) + x_4_6) ≥ 1))) ↔ ((¬ ((¬ ((x_3_6 + ((-1) * x_4_6)) ≤ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_6)) ≤ (-1))) ∨ (¬ ((x_3_4 + ((-1) * x_3_6)) ≤ 0)) ∨ (¬ ((t + x_3_4 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((t + x_3_6 + ((-1) * x_4_6)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_6 + ((-1) * x_4_6)) ≥ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_3_6)) ≥ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_4) + x_3_6) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_6) + x_4_6) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_4 + ((-1) * x_3_6)) ≥ 0) ↔ (¬ (((1) * x_3_4 + (-1) * x_3_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_6 + ((-1) * x_4_6)) ≤ 0) ↔ (((1) * x_3_6 + (-1) * x_4_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_4 + ((-1) * x_4_6)) ≤ (-1)) ↔ (((1) * x_3_4 + (-1) * x_4_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_3_4 + ((-1) * x_3_6)) ≤ 0) ↔ (((1) * x_3_4 + (-1) * x_3_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_3_4 + ((-1) * x_3_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_4 + (-1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_3_6 + ((-1) * x_4_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_6 + (-1) * x_4_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_4 + ((-1) * x_4_6)) ≥ 1) ↔ (¬ (((1) * x_3_4 + (-1) * x_4_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_6 + ((-1) * x_4_6)) ≥ 0) ↔ (¬ (((1) * x_3_6 + (-1) * x_4_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_3_4) + x_3_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_4 + (1) * x_3_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_3_6) + x_4_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_6 + (1) * x_4_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3317 (t x_0_3 x_1_3 x_2_3 x_3_4 x_3_8 : ℝ) : ((t + ((-1) * x_2_3)) ≤ 0) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) ∨ (¬ (x_1_3 ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_2_3 + ((-1) * x_3_8)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_8)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3318 (t x_0_2 x_2_4 x_4_5 x_5_7 x_7_8 : ℝ) : (¬ (x_0_2 ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ ((t + ((-1) * x_7_8)) ≤ 0) ∨ (¬ ((x_5_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_0_2 + ((-1) * x_2_4)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3319 (t x_0_2 x_2_5 x_4_5 x_5_7 x_5_9 : ℝ) : (¬ (x_0_2 ≥ 0)) ∨ (t ≥ 4) ∨ (¬ ((x_4_5 + ((-1) * x_5_9)) ≤ (-1))) ∨ ((t + ((-1) * x_5_9)) ≤ 0) ∨ (¬ ((x_2_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_0_2 + ((-1) * x_2_5)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3320 (t x_0_5 x_0_7 x_5_7 : ℝ) : (((((x_0_5 + ((-1) * x_0_7)) ≤ 0) ∧ ((x_0_7 + ((-1) * x_5_7)) ≤ 0) ∧ ((x_0_5 + ((-1) * x_5_7)) ≤ (-1)) ∧ ((t + x_0_5 + ((-1) * x_0_7)) ≥ 1) ∧ ((t + x_0_7 + ((-1) * x_5_7)) ≥ 1)) ∨ (((x_0_7 + ((-1) * x_5_7)) ≥ 0) ∧ ((x_0_5 + ((-1) * x_0_7)) ≥ 0) ∧ ((x_0_5 + ((-1) * x_5_7)) ≥ 1) ∧ ((t + ((-1) * x_0_5) + x_0_7) ≥ 1) ∧ ((t + ((-1) * x_0_7) + x_5_7) ≥ 1))) ↔ ((¬ ((¬ ((t + x_0_5 + ((-1) * x_0_7)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_0_7)) ≤ 0)) ∨ (¬ ((t + x_0_7 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ (¬ ((x_0_7 + ((-1) * x_5_7)) ≤ 0)))) ∨ (¬ ((¬ ((t + ((-1) * x_0_5) + x_0_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_7) + x_5_7) ≥ 1)) ∨ (¬ ((x_0_5 + ((-1) * x_0_7)) ≥ 0)) ∨ (¬ ((x_0_5 + ((-1) * x_5_7)) ≥ 1)) ∨ (¬ ((x_0_7 + ((-1) * x_5_7)) ≥ 0)))))) := by
  classical
  have e0 : ((x_0_5 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * x_0_5 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_5 + ((-1) * x_5_7)) ≤ (-1)) ↔ (((1) * x_0_5 + (-1) * x_5_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + x_0_5 + ((-1) * x_0_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_5 + (-1) * x_0_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_0_5 + ((-1) * x_0_7)) ≤ 0) ↔ (((1) * x_0_5 + (-1) * x_0_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_0_7 + ((-1) * x_5_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_7 + (-1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_7 + ((-1) * x_5_7)) ≤ 0) ↔ (((1) * x_0_7 + (-1) * x_5_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_7 + ((-1) * x_5_7)) ≥ 0) ↔ (¬ (((1) * x_0_7 + (-1) * x_5_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_5 + ((-1) * x_0_7)) ≥ 0) ↔ (¬ (((1) * x_0_5 + (-1) * x_0_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_0_5) + x_0_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_5 + (1) * x_0_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_0_7) + x_5_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_7 + (1) * x_5_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3321 (t x_1_6 x_1_8 x_6_8 : ℝ) : (((((x_1_6 + ((-1) * x_1_8)) ≤ 0) ∧ ((x_1_8 + ((-1) * x_6_8)) ≤ 0) ∧ ((x_1_6 + ((-1) * x_6_8)) ≤ (-1)) ∧ ((t + x_1_6 + ((-1) * x_1_8)) ≥ 1) ∧ ((t + x_1_8 + ((-1) * x_6_8)) ≥ 1)) ∨ (((x_1_8 + ((-1) * x_6_8)) ≥ 0) ∧ ((x_1_6 + ((-1) * x_1_8)) ≥ 0) ∧ ((x_1_6 + ((-1) * x_6_8)) ≥ 1) ∧ ((t + ((-1) * x_1_6) + x_1_8) ≥ 1) ∧ ((t + ((-1) * x_1_8) + x_6_8) ≥ 1))) ↔ ((¬ ((¬ ((x_1_8 + ((-1) * x_6_8)) ≤ 0)) ∨ (¬ ((x_1_6 + ((-1) * x_6_8)) ≤ (-1))) ∨ (¬ ((x_1_6 + ((-1) * x_1_8)) ≤ 0)) ∨ (¬ ((t + x_1_6 + ((-1) * x_1_8)) ≥ 1)) ∨ (¬ ((t + x_1_8 + ((-1) * x_6_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_8 + ((-1) * x_6_8)) ≥ 0)) ∨ (¬ ((x_1_6 + ((-1) * x_1_8)) ≥ 0)) ∨ (¬ ((x_1_6 + ((-1) * x_6_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_6) + x_1_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_8) + x_6_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_6 + ((-1) * x_6_8)) ≤ (-1)) ↔ (((1) * x_1_6 + (-1) * x_6_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_8 + ((-1) * x_6_8)) ≤ 0) ↔ (((1) * x_1_8 + (-1) * x_6_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_6 + ((-1) * x_1_8)) ≤ 0) ↔ (((1) * x_1_6 + (-1) * x_1_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_1_6 + ((-1) * x_1_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_6 + (-1) * x_1_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_1_8 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_8 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_6 + ((-1) * x_6_8)) ≥ 1) ↔ (¬ (((1) * x_1_6 + (-1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_8 + ((-1) * x_6_8)) ≥ 0) ↔ (¬ (((1) * x_1_8 + (-1) * x_6_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_6 + ((-1) * x_1_8)) ≥ 0) ↔ (¬ (((1) * x_1_6 + (-1) * x_1_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_6) + x_1_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_6 + (1) * x_1_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_8) + x_6_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_8 + (1) * x_6_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3322 (t x_1_8 x_1_9 x_8_9 : ℝ) : (((((x_1_8 + ((-1) * x_1_9)) ≤ 0) ∧ ((x_1_9 + ((-1) * x_8_9)) ≤ 0) ∧ ((x_1_8 + ((-1) * x_8_9)) ≤ (-1)) ∧ ((t + x_1_8 + ((-1) * x_1_9)) ≥ 1) ∧ ((t + x_1_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (((x_1_9 + ((-1) * x_8_9)) ≥ 0) ∧ ((x_1_8 + ((-1) * x_1_9)) ≥ 0) ∧ ((x_1_8 + ((-1) * x_8_9)) ≥ 1) ∧ ((t + ((-1) * x_1_8) + x_1_9) ≥ 1) ∧ ((t + ((-1) * x_1_9) + x_8_9) ≥ 1))) ↔ ((¬ ((¬ ((x_1_9 + ((-1) * x_8_9)) ≤ 0)) ∨ (¬ ((x_1_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_1_8 + ((-1) * x_1_9)) ≤ 0)) ∨ (¬ ((t + x_1_8 + ((-1) * x_1_9)) ≥ 1)) ∨ (¬ ((t + x_1_9 + ((-1) * x_8_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_9 + ((-1) * x_8_9)) ≥ 0)) ∨ (¬ ((x_1_8 + ((-1) * x_1_9)) ≥ 0)) ∨ (¬ ((x_1_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_8) + x_1_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_9) + x_8_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_8 + ((-1) * x_8_9)) ≤ (-1)) ↔ (((1) * x_1_8 + (-1) * x_8_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_1_8 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * x_1_8 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_9 + ((-1) * x_8_9)) ≥ 0) ↔ (¬ (((1) * x_1_9 + (-1) * x_8_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_1_8 + ((-1) * x_1_9)) ≥ 0) ↔ (¬ (((1) * x_1_8 + (-1) * x_1_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_1_8) + x_1_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_8 + (1) * x_1_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + ((-1) * x_1_9) + x_8_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_9 + (1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_8 + ((-1) * x_1_9)) ≤ 0) ↔ (((1) * x_1_8 + (-1) * x_1_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_9 + ((-1) * x_8_9)) ≤ 0) ↔ (((1) * x_1_9 + (-1) * x_8_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_1_8 + ((-1) * x_1_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_8 + (-1) * x_1_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_1_9 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_9 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3324 (t x_3_4 x_3_8 x_4_8 : ℝ) : (((((x_3_4 + ((-1) * x_3_8)) ≤ 0) ∧ ((x_3_8 + ((-1) * x_4_8)) ≤ 0) ∧ ((x_3_4 + ((-1) * x_4_8)) ≤ (-1)) ∧ ((t + x_3_4 + ((-1) * x_3_8)) ≥ 1) ∧ ((t + x_3_8 + ((-1) * x_4_8)) ≥ 1)) ∨ (((x_3_8 + ((-1) * x_4_8)) ≥ 0) ∧ ((x_3_4 + ((-1) * x_3_8)) ≥ 0) ∧ ((x_3_4 + ((-1) * x_4_8)) ≥ 1) ∧ ((t + ((-1) * x_3_4) + x_3_8) ≥ 1) ∧ ((t + ((-1) * x_3_8) + x_4_8) ≥ 1))) ↔ ((¬ ((¬ ((x_3_8 + ((-1) * x_4_8)) ≤ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_8)) ≤ (-1))) ∨ (¬ ((x_3_4 + ((-1) * x_3_8)) ≤ 0)) ∨ (¬ ((t + x_3_4 + ((-1) * x_3_8)) ≥ 1)) ∨ (¬ ((t + x_3_8 + ((-1) * x_4_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_8 + ((-1) * x_4_8)) ≥ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_3_8)) ≥ 0)) ∨ (¬ ((x_3_4 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_4) + x_3_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_8) + x_4_8) ≥ 1)))))) := by
  classical
  have e0 : ((t + x_3_4 + ((-1) * x_3_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_4 + (-1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_8 + ((-1) * x_4_8)) ≥ 0) ↔ (¬ (((1) * x_3_8 + (-1) * x_4_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_4 + ((-1) * x_3_8)) ≥ 0) ↔ (¬ (((1) * x_3_4 + (-1) * x_3_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_3_4 + ((-1) * x_4_8)) ≥ 1) ↔ (¬ (((1) * x_3_4 + (-1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_3_4) + x_3_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_4 + (1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + ((-1) * x_3_8) + x_4_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_8 + (1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_4 + ((-1) * x_3_8)) ≤ 0) ↔ (((1) * x_3_4 + (-1) * x_3_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_8 + ((-1) * x_4_8)) ≤ 0) ↔ (((1) * x_3_8 + (-1) * x_4_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((x_3_4 + ((-1) * x_4_8)) ≤ (-1)) ↔ (((1) * x_3_4 + (-1) * x_4_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_3_8 + ((-1) * x_4_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_8 + (-1) * x_4_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3325 (t x_0_1 x_0_6 x_1_6 : ℝ) : (((((x_0_1 + ((-1) * x_0_6)) ≤ 0) ∧ ((x_0_6 + ((-1) * x_1_6)) ≤ 0) ∧ ((x_0_1 + ((-1) * x_1_6)) ≤ (-1)) ∧ ((t + x_0_1 + ((-1) * x_0_6)) ≥ 1) ∧ ((t + x_0_6 + ((-1) * x_1_6)) ≥ 1)) ∨ (((x_0_6 + ((-1) * x_1_6)) ≥ 0) ∧ ((x_0_1 + ((-1) * x_0_6)) ≥ 0) ∧ ((x_0_1 + ((-1) * x_1_6)) ≥ 1) ∧ ((t + ((-1) * x_0_1) + x_0_6) ≥ 1) ∧ ((t + ((-1) * x_0_6) + x_1_6) ≥ 1))) ↔ ((¬ ((¬ ((t + x_0_6 + ((-1) * x_1_6)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_6)) ≤ (-1))) ∨ (¬ ((x_0_6 + ((-1) * x_1_6)) ≤ 0)) ∨ (¬ ((t + x_0_1 + ((-1) * x_0_6)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_0_6)) ≤ 0)))) ∨ (¬ ((¬ ((t + ((-1) * x_0_6) + x_1_6) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_6)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_0_1) + x_0_6) ≥ 1)) ∨ (¬ ((x_0_6 + ((-1) * x_1_6)) ≥ 0)) ∨ (¬ ((x_0_1 + ((-1) * x_0_6)) ≥ 0)))))) := by
  classical
  have e0 : ((x_0_1 + ((-1) * x_0_6)) ≥ 0) ↔ (¬ (((1) * x_0_1 + (-1) * x_0_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_0_1 + ((-1) * x_1_6)) ≥ 1) ↔ (¬ (((1) * x_0_1 + (-1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((t + ((-1) * x_0_6) + x_1_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_6 + (1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_0_1) + x_0_6) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_0_1 + (1) * x_0_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((x_0_6 + ((-1) * x_1_6)) ≥ 0) ↔ (¬ (((1) * x_0_6 + (-1) * x_1_6) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_0_1 + ((-1) * x_0_6)) ≤ 0) ↔ (((1) * x_0_1 + (-1) * x_0_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_0_6 + ((-1) * x_1_6)) ≤ 0) ↔ (((1) * x_0_6 + (-1) * x_1_6) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_0_1 + ((-1) * x_1_6)) ≤ (-1)) ↔ (((1) * x_0_1 + (-1) * x_1_6 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_0_1 + ((-1) * x_0_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_1 + (-1) * x_0_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_0_6 + ((-1) * x_1_6)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_0_6 + (-1) * x_1_6 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3326 (t x_1_2 x_2_5 x_4_5 x_5_6 x_5_9 : ℝ) : (¬ (x_1_2 ≥ 0)) ∨ ((t + ((-1) * x_5_6)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ ((x_4_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_5_9)) ≤ (-1))) ∨ (¬ ((x_1_2 + ((-1) * x_2_5)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_5_9)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3327 (t x_2_5 x_2_9 x_5_9 : ℝ) : (((((x_2_5 + ((-1) * x_2_9)) ≤ 0) ∧ ((x_2_9 + ((-1) * x_5_9)) ≤ 0) ∧ ((x_2_5 + ((-1) * x_5_9)) ≤ (-1)) ∧ ((t + x_2_5 + ((-1) * x_2_9)) ≥ 1) ∧ ((t + x_2_9 + ((-1) * x_5_9)) ≥ 1)) ∨ (((x_2_9 + ((-1) * x_5_9)) ≥ 0) ∧ ((x_2_5 + ((-1) * x_2_9)) ≥ 0) ∧ ((x_2_5 + ((-1) * x_5_9)) ≥ 1) ∧ ((t + ((-1) * x_2_5) + x_2_9) ≥ 1) ∧ ((t + ((-1) * x_2_9) + x_5_9) ≥ 1))) ↔ ((¬ ((¬ ((x_2_9 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_9)) ≤ (-1))) ∨ (¬ ((x_2_5 + ((-1) * x_2_9)) ≤ 0)) ∨ (¬ ((t + x_2_5 + ((-1) * x_2_9)) ≥ 1)) ∨ (¬ ((t + x_2_9 + ((-1) * x_5_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_9 + ((-1) * x_5_9)) ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_2_9)) ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_5) + x_2_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_9) + x_5_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_5 + ((-1) * x_5_9)) ≤ (-1)) ↔ (((1) * x_2_5 + (-1) * x_5_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_9 + ((-1) * x_5_9)) ≤ 0) ↔ (((1) * x_2_9 + (-1) * x_5_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_5 + ((-1) * x_2_9)) ≤ 0) ↔ (((1) * x_2_5 + (-1) * x_2_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_2_5 + ((-1) * x_2_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_5 + (-1) * x_2_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_2_9 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_9 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_5 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * x_2_5 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_9 + ((-1) * x_5_9)) ≥ 0) ↔ (¬ (((1) * x_2_9 + (-1) * x_5_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_5 + ((-1) * x_2_9)) ≥ 0) ↔ (¬ (((1) * x_2_5 + (-1) * x_2_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_2_5) + x_2_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_5 + (1) * x_2_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_2_9) + x_5_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_9 + (1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3329 (t x_3_5 x_3_9 x_5_9 : ℝ) : (((((x_3_5 + ((-1) * x_3_9)) ≤ 0) ∧ ((x_3_9 + ((-1) * x_5_9)) ≤ 0) ∧ ((x_3_5 + ((-1) * x_5_9)) ≤ (-1)) ∧ ((t + x_3_5 + ((-1) * x_3_9)) ≥ 1) ∧ ((t + x_3_9 + ((-1) * x_5_9)) ≥ 1)) ∨ (((x_3_9 + ((-1) * x_5_9)) ≥ 0) ∧ ((x_3_5 + ((-1) * x_3_9)) ≥ 0) ∧ ((x_3_5 + ((-1) * x_5_9)) ≥ 1) ∧ ((t + ((-1) * x_3_5) + x_3_9) ≥ 1) ∧ ((t + ((-1) * x_3_9) + x_5_9) ≥ 1))) ↔ ((¬ ((¬ ((x_3_9 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_9)) ≤ (-1))) ∨ (¬ ((x_3_5 + ((-1) * x_3_9)) ≤ 0)) ∨ (¬ ((t + x_3_5 + ((-1) * x_3_9)) ≥ 1)) ∨ (¬ ((t + x_3_9 + ((-1) * x_5_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_9 + ((-1) * x_5_9)) ≥ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_3_9)) ≥ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_5) + x_3_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_9) + x_5_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_5 + ((-1) * x_5_9)) ≤ (-1)) ↔ (((1) * x_3_5 + (-1) * x_5_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_9 + ((-1) * x_5_9)) ≤ 0) ↔ (((1) * x_3_9 + (-1) * x_5_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_5 + ((-1) * x_3_9)) ≤ 0) ↔ (((1) * x_3_5 + (-1) * x_3_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_3_5 + ((-1) * x_3_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_5 + (-1) * x_3_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_3_9 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_9 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_3_5 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * x_3_5 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_9 + ((-1) * x_5_9)) ≥ 0) ↔ (¬ (((1) * x_3_9 + (-1) * x_5_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_5 + ((-1) * x_3_9)) ≥ 0) ↔ (¬ (((1) * x_3_5 + (-1) * x_3_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_3_5) + x_3_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_5 + (1) * x_3_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_3_9) + x_5_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_9 + (1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3330 (t x_5_6 x_5_9 x_6_9 : ℝ) : (((((x_5_6 + ((-1) * x_5_9)) ≤ 0) ∧ ((x_5_9 + ((-1) * x_6_9)) ≤ 0) ∧ ((x_5_6 + ((-1) * x_6_9)) ≤ (-1)) ∧ ((t + x_5_6 + ((-1) * x_5_9)) ≥ 1) ∧ ((t + x_5_9 + ((-1) * x_6_9)) ≥ 1)) ∨ (((x_5_9 + ((-1) * x_6_9)) ≥ 0) ∧ ((x_5_6 + ((-1) * x_5_9)) ≥ 0) ∧ ((x_5_6 + ((-1) * x_6_9)) ≥ 1) ∧ ((t + ((-1) * x_5_6) + x_5_9) ≥ 1) ∧ ((t + ((-1) * x_5_9) + x_6_9) ≥ 1))) ↔ ((¬ ((¬ ((x_5_9 + ((-1) * x_6_9)) ≤ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_6_9)) ≤ (-1))) ∨ (¬ ((x_5_6 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((t + x_5_6 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((t + x_5_9 + ((-1) * x_6_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_5_9 + ((-1) * x_6_9)) ≥ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_5_9)) ≥ 0)) ∨ (¬ ((x_5_6 + ((-1) * x_6_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_6) + x_5_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_9) + x_6_9) ≥ 1)))))) := by
  classical
  have e0 : ((t + ((-1) * x_5_6) + x_5_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_6 + (1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_5_9 + ((-1) * x_6_9)) ≤ 0) ↔ (((1) * x_5_9 + (-1) * x_6_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_5_6 + ((-1) * x_6_9)) ≤ (-1)) ↔ (((1) * x_5_6 + (-1) * x_6_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_5_6 + ((-1) * x_5_9)) ≤ 0) ↔ (((1) * x_5_6 + (-1) * x_5_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_5_6 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_6 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_5_9 + ((-1) * x_6_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_9 + (-1) * x_6_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_5_6 + ((-1) * x_6_9)) ≥ 1) ↔ (¬ (((1) * x_5_6 + (-1) * x_6_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_5_9 + ((-1) * x_6_9)) ≥ 0) ↔ (¬ (((1) * x_5_9 + (-1) * x_6_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((x_5_6 + ((-1) * x_5_9)) ≥ 0) ↔ (¬ (((1) * x_5_6 + (-1) * x_5_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_5_9) + x_6_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_9 + (1) * x_6_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3331 (t x_0_3 x_1_3 x_2_3 x_3_4 x_3_6 : ℝ) : (¬ ((x_0_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_3_6)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ (x_1_3 ≥ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ ((t + ((-1) * x_2_3)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3332 (t x_2_3 x_2_5 x_3_5 : ℝ) : (((((x_2_3 + ((-1) * x_2_5)) ≤ 0) ∧ ((x_2_5 + ((-1) * x_3_5)) ≤ 0) ∧ ((x_2_3 + ((-1) * x_3_5)) ≤ (-1)) ∧ ((t + x_2_3 + ((-1) * x_2_5)) ≥ 1) ∧ ((t + x_2_5 + ((-1) * x_3_5)) ≥ 1)) ∨ (((x_2_5 + ((-1) * x_3_5)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_2_5)) ≥ 0) ∧ ((x_2_3 + ((-1) * x_3_5)) ≥ 1) ∧ ((t + ((-1) * x_2_3) + x_2_5) ≥ 1) ∧ ((t + ((-1) * x_2_5) + x_3_5) ≥ 1))) ↔ ((¬ ((¬ ((x_2_5 + ((-1) * x_3_5)) ≤ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_5)) ≤ (-1))) ∨ (¬ ((x_2_3 + ((-1) * x_2_5)) ≤ 0)) ∨ (¬ ((t + x_2_3 + ((-1) * x_2_5)) ≥ 1)) ∨ (¬ ((t + x_2_5 + ((-1) * x_3_5)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_5 + ((-1) * x_3_5)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_2_5)) ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_5)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_3) + x_2_5) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_5) + x_3_5) ≥ 1)))))) := by
  classical
  have e0 : ((t + x_2_5 + ((-1) * x_3_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_5 + (-1) * x_3_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_3 + ((-1) * x_2_5)) ≥ 0) ↔ (¬ (((1) * x_2_3 + (-1) * x_2_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_5 + ((-1) * x_3_5)) ≥ 0) ↔ (¬ (((1) * x_2_5 + (-1) * x_3_5) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_2_3 + ((-1) * x_3_5)) ≥ 1) ↔ (¬ (((1) * x_2_3 + (-1) * x_3_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_3) + x_2_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_3 + (1) * x_2_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + ((-1) * x_2_5) + x_3_5) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_5 + (1) * x_3_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_3 + ((-1) * x_2_5)) ≤ 0) ↔ (((1) * x_2_3 + (-1) * x_2_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_5 + ((-1) * x_3_5)) ≤ 0) ↔ (((1) * x_2_5 + (-1) * x_3_5) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((x_2_3 + ((-1) * x_3_5)) ≤ (-1)) ↔ (((1) * x_2_3 + (-1) * x_3_5 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_3 + ((-1) * x_2_5)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_3 + (-1) * x_2_5 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3333 (t x_5_8 x_5_9 x_8_9 : ℝ) : (((((x_5_8 + ((-1) * x_5_9)) ≤ 0) ∧ ((x_5_9 + ((-1) * x_8_9)) ≤ 0) ∧ ((x_5_8 + ((-1) * x_8_9)) ≤ (-1)) ∧ ((t + x_5_8 + ((-1) * x_5_9)) ≥ 1) ∧ ((t + x_5_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (((x_5_9 + ((-1) * x_8_9)) ≥ 0) ∧ ((x_5_8 + ((-1) * x_5_9)) ≥ 0) ∧ ((x_5_8 + ((-1) * x_8_9)) ≥ 1) ∧ ((t + ((-1) * x_5_8) + x_5_9) ≥ 1) ∧ ((t + ((-1) * x_5_9) + x_8_9) ≥ 1))) ↔ ((¬ ((¬ ((x_5_9 + ((-1) * x_8_9)) ≤ 0)) ∨ (¬ ((x_5_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_5_8 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((t + x_5_8 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((t + x_5_9 + ((-1) * x_8_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_5_9 + ((-1) * x_8_9)) ≥ 0)) ∨ (¬ ((x_5_8 + ((-1) * x_5_9)) ≥ 0)) ∨ (¬ ((x_5_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_8) + x_5_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_9) + x_8_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_5_8 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * x_5_8 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_5_9 + ((-1) * x_8_9)) ≥ 0) ↔ (¬ (((1) * x_5_9 + (-1) * x_8_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_5_8 + ((-1) * x_5_9)) ≥ 0) ↔ (¬ (((1) * x_5_8 + (-1) * x_5_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_5_8 + ((-1) * x_8_9)) ≤ (-1)) ↔ (((1) * x_5_8 + (-1) * x_8_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_5_9) + x_8_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_9 + (1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + ((-1) * x_5_8) + x_5_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_8 + (1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_5_8 + ((-1) * x_5_9)) ≤ 0) ↔ (((1) * x_5_8 + (-1) * x_5_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_5_9 + ((-1) * x_8_9)) ≤ 0) ↔ (((1) * x_5_9 + (-1) * x_8_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_5_8 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_8 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_5_9 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_9 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3334 (t x_3_5 x_3_8 x_5_8 : ℝ) : (((((x_3_5 + ((-1) * x_3_8)) ≤ 0) ∧ ((x_3_8 + ((-1) * x_5_8)) ≤ 0) ∧ ((x_3_5 + ((-1) * x_5_8)) ≤ (-1)) ∧ ((t + x_3_5 + ((-1) * x_3_8)) ≥ 1) ∧ ((t + x_3_8 + ((-1) * x_5_8)) ≥ 1)) ∨ (((x_3_8 + ((-1) * x_5_8)) ≥ 0) ∧ ((x_3_5 + ((-1) * x_3_8)) ≥ 0) ∧ ((x_3_5 + ((-1) * x_5_8)) ≥ 1) ∧ ((t + ((-1) * x_3_5) + x_3_8) ≥ 1) ∧ ((t + ((-1) * x_3_8) + x_5_8) ≥ 1))) ↔ ((¬ ((¬ ((x_3_8 + ((-1) * x_5_8)) ≤ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (¬ ((x_3_5 + ((-1) * x_3_8)) ≤ 0)) ∨ (¬ ((t + x_3_5 + ((-1) * x_3_8)) ≥ 1)) ∨ (¬ ((t + x_3_8 + ((-1) * x_5_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_8 + ((-1) * x_5_8)) ≥ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_3_8)) ≥ 0)) ∨ (¬ ((x_3_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_5) + x_3_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_8) + x_5_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_8 + ((-1) * x_5_8)) ≤ 0) ↔ (((1) * x_3_8 + (-1) * x_5_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_5 + ((-1) * x_5_8)) ≤ (-1)) ↔ (((1) * x_3_5 + (-1) * x_5_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_5 + ((-1) * x_3_8)) ≤ 0) ↔ (((1) * x_3_5 + (-1) * x_3_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + x_3_5 + ((-1) * x_3_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_5 + (-1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_3_8 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_8 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_3_5 + ((-1) * x_5_8)) ≥ 1) ↔ (¬ (((1) * x_3_5 + (-1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_8 + ((-1) * x_5_8)) ≥ 0) ↔ (¬ (((1) * x_3_8 + (-1) * x_5_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_5 + ((-1) * x_3_8)) ≥ 0) ↔ (¬ (((1) * x_3_5 + (-1) * x_3_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_3_5) + x_3_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_5 + (1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_3_8) + x_5_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_8 + (1) * x_5_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3335 (t x_0_3 x_1_3 x_2_3 x_3_4 x_3_6 x_6_7 : ℝ) : (t ≥ 4) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) ∨ (¬ ((x_0_3 + ((-1) * x_2_3)) ≤ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ (x_1_3 ≥ 0)) ∨ (¬ ((x_2_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((x_3_6 + ((-1) * x_6_7)) ≤ (-1))) ∨ ((t + ((-1) * x_6_7)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6, h7⟩
  linarith

theorem theory3337 (x_0_3 x_1_3 x_1_6 x_3_6 : ℝ) : (¬ ((x_0_3 + ((-1) * x_3_6)) ≤ (-1))) ∨ (¬ ((x_1_3 + ((-1) * x_1_6)) ≥ 0)) ∨ (¬ ((x_0_3 + ((-1) * x_1_3)) ≥ 0)) ∨ (¬ ((x_1_6 + ((-1) * x_3_6)) ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3338 (t x_1_3 x_1_8 x_3_8 : ℝ) : (((((x_1_3 + ((-1) * x_1_8)) ≤ 0) ∧ ((x_1_8 + ((-1) * x_3_8)) ≤ 0) ∧ ((x_1_3 + ((-1) * x_3_8)) ≤ (-1)) ∧ ((t + x_1_3 + ((-1) * x_1_8)) ≥ 1) ∧ ((t + x_1_8 + ((-1) * x_3_8)) ≥ 1)) ∨ (((x_1_8 + ((-1) * x_3_8)) ≥ 0) ∧ ((x_1_3 + ((-1) * x_1_8)) ≥ 0) ∧ ((x_1_3 + ((-1) * x_3_8)) ≥ 1) ∧ ((t + ((-1) * x_1_3) + x_1_8) ≥ 1) ∧ ((t + ((-1) * x_1_8) + x_3_8) ≥ 1))) ↔ ((¬ ((¬ ((x_1_3 + ((-1) * x_3_8)) ≤ (-1))) ∨ (¬ ((t + x_1_3 + ((-1) * x_1_8)) ≥ 1)) ∨ (¬ ((x_1_3 + ((-1) * x_1_8)) ≤ 0)) ∨ (¬ ((x_1_8 + ((-1) * x_3_8)) ≤ 0)) ∨ (¬ ((t + x_1_8 + ((-1) * x_3_8)) ≥ 1)))) ∨ (¬ ((¬ ((x_1_8 + ((-1) * x_3_8)) ≥ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_1_8)) ≥ 0)) ∨ (¬ ((x_1_3 + ((-1) * x_3_8)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_3) + x_1_8) ≥ 1)) ∨ (¬ ((t + ((-1) * x_1_8) + x_3_8) ≥ 1)))))) := by
  classical
  have e0 : ((x_1_3 + ((-1) * x_3_8)) ≤ (-1)) ↔ (((1) * x_1_3 + (-1) * x_3_8 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((t + x_1_3 + ((-1) * x_1_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_3 + (-1) * x_1_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_1_3 + ((-1) * x_1_8)) ≤ 0) ↔ (((1) * x_1_3 + (-1) * x_1_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_1_8 + ((-1) * x_3_8)) ≤ 0) ↔ (((1) * x_1_8 + (-1) * x_3_8) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_1_8 + ((-1) * x_3_8)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_1_8 + (-1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_1_3 + ((-1) * x_3_8)) ≥ 1) ↔ (¬ (((1) * x_1_3 + (-1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_1_8 + ((-1) * x_3_8)) ≥ 0) ↔ (¬ (((1) * x_1_8 + (-1) * x_3_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_1_3 + ((-1) * x_1_8)) ≥ 0) ↔ (¬ (((1) * x_1_3 + (-1) * x_1_8) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_1_3) + x_1_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_3 + (1) * x_1_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_1_8) + x_3_8) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_1_8 + (1) * x_3_8 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3339 (t x_0_3 x_1_3 x_3_4 x_3_5 x_3_8 : ℝ) : (¬ (x_3_8 ≥ 0)) ∨ ((t + ((-1) * x_3_5)) ≤ 0) ∨ (¬ ((x_0_3 + ((-1) * x_3_5)) ≤ (-1))) ∨ (¬ ((x_0_3 + ((-1) * x_3_4)) ≥ 1)) ∨ (¬ ((x_1_3 + ((-1) * x_3_4)) ≤ (-1))) ∨ (¬ ((x_1_3 + ((-1) * x_3_8)) ≥ 1)) ∨ (t ≥ 4) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3341 (t x_1_4 x_2_4 x_4_5 x_4_7 x_5_6 : ℝ) : (¬ (x_1_4 ≥ 0)) ∨ (¬ ((x_1_4 + ((-1) * x_4_7)) ≤ (-1))) ∨ (¬ ((x_4_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_2_4 + ((-1) * x_4_5)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≥ 1)) ∨ ((t + ((-1) * x_5_6)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3342 (t x_2_4 x_2_7 x_4_7 : ℝ) : (((((x_2_4 + ((-1) * x_2_7)) ≤ 0) ∧ ((x_2_7 + ((-1) * x_4_7)) ≤ 0) ∧ ((x_2_4 + ((-1) * x_4_7)) ≤ (-1)) ∧ ((t + x_2_4 + ((-1) * x_2_7)) ≥ 1) ∧ ((t + x_2_7 + ((-1) * x_4_7)) ≥ 1)) ∨ (((x_2_7 + ((-1) * x_4_7)) ≥ 0) ∧ ((x_2_4 + ((-1) * x_2_7)) ≥ 0) ∧ ((x_2_4 + ((-1) * x_4_7)) ≥ 1) ∧ ((t + ((-1) * x_2_4) + x_2_7) ≥ 1) ∧ ((t + ((-1) * x_2_7) + x_4_7) ≥ 1))) ↔ ((¬ ((¬ ((x_2_7 + ((-1) * x_4_7)) ≤ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_2_7)) ≤ 0)) ∨ (¬ ((t + x_2_4 + ((-1) * x_2_7)) ≥ 1)) ∨ (¬ ((t + x_2_7 + ((-1) * x_4_7)) ≥ 1)))) ∨ (¬ ((¬ ((x_2_7 + ((-1) * x_4_7)) ≥ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_2_7)) ≥ 0)) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_4) + x_2_7) ≥ 1)) ∨ (¬ ((t + ((-1) * x_2_7) + x_4_7) ≥ 1)))))) := by
  classical
  have e0 : ((x_2_4 + ((-1) * x_4_7)) ≥ 1) ↔ (¬ (((1) * x_2_4 + (-1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_2_7 + ((-1) * x_4_7)) ≥ 0) ↔ (¬ (((1) * x_2_7 + (-1) * x_4_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_2_4 + ((-1) * x_2_7)) ≥ 0) ↔ (¬ (((1) * x_2_4 + (-1) * x_2_7) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_2_4) + x_2_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_4 + (1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_2_7) + x_4_7) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_2_7 + (1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_2_4 + ((-1) * x_2_7)) ≤ 0) ↔ (((1) * x_2_4 + (-1) * x_2_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_2_7 + ((-1) * x_4_7)) ≤ 0) ↔ (((1) * x_2_7 + (-1) * x_4_7) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_2_4 + ((-1) * x_4_7)) ≤ (-1)) ↔ (((1) * x_2_4 + (-1) * x_4_7 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_2_4 + ((-1) * x_2_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_4 + (-1) * x_2_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_2_7 + ((-1) * x_4_7)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_2_7 + (-1) * x_4_7 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3343 (t x_0_2 x_2_4 x_4_7 x_7_8 x_8_9 : ℝ) : ((t + ((-1) * x_8_9)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_2_4 + ((-1) * x_4_7)) ≤ (-1))) ∨ (¬ ((x_4_7 + ((-1) * x_7_8)) ≤ (-1))) ∨ (¬ (x_0_2 ≥ 0)) ∨ (¬ ((x_0_2 + ((-1) * x_2_4)) ≤ (-1))) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3344 (t x_0_2 x_2_5 x_5_8 x_7_8 x_8_9 : ℝ) : (¬ (x_0_2 ≥ 0)) ∨ (¬ ((x_2_5 + ((-1) * x_5_8)) ≤ (-1))) ∨ (t ≥ 4) ∨ (¬ ((x_0_2 + ((-1) * x_2_5)) ≤ (-1))) ∨ (¬ ((x_5_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≥ 1)) ∨ ((t + ((-1) * x_7_8)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3345 (x_0_5 x_0_9 x_5_8 x_5_9 : ℝ) : (¬ ((x_0_5 + ((-1) * x_5_8)) ≥ 1)) ∨ (¬ ((x_0_9 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((x_0_5 + ((-1) * x_0_9)) ≤ 0)) ∨ (¬ ((x_5_8 + ((-1) * x_5_9)) ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3348 (t x_3_7 x_4_5 x_5_6 x_5_7 x_7_9 : ℝ) : (¬ ((x_4_5 + ((-1) * x_5_6)) ≤ (-1))) ∨ ((t + ((-1) * x_5_6)) ≤ 0) ∨ (t ≥ 4) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((x_3_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ (x_3_7 ≥ 0)) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3349 (t x_5_7 x_5_9 x_7_9 : ℝ) : (((((x_5_7 + ((-1) * x_5_9)) ≤ 0) ∧ ((x_5_9 + ((-1) * x_7_9)) ≤ 0) ∧ ((x_5_7 + ((-1) * x_7_9)) ≤ (-1)) ∧ ((t + x_5_7 + ((-1) * x_5_9)) ≥ 1) ∧ ((t + x_5_9 + ((-1) * x_7_9)) ≥ 1)) ∨ (((x_5_9 + ((-1) * x_7_9)) ≥ 0) ∧ ((x_5_7 + ((-1) * x_5_9)) ≥ 0) ∧ ((x_5_7 + ((-1) * x_7_9)) ≥ 1) ∧ ((t + ((-1) * x_5_7) + x_5_9) ≥ 1) ∧ ((t + ((-1) * x_5_9) + x_7_9) ≥ 1))) ↔ ((¬ ((¬ ((x_5_9 + ((-1) * x_7_9)) ≤ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≤ (-1))) ∨ (¬ ((x_5_7 + ((-1) * x_5_9)) ≤ 0)) ∨ (¬ ((t + x_5_7 + ((-1) * x_5_9)) ≥ 1)) ∨ (¬ ((t + x_5_9 + ((-1) * x_7_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_5_9 + ((-1) * x_7_9)) ≥ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_5_9)) ≥ 0)) ∨ (¬ ((x_5_7 + ((-1) * x_7_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_7) + x_5_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_5_9) + x_7_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_5_7 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * x_5_7 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_5_9 + ((-1) * x_7_9)) ≥ 0) ↔ (¬ (((1) * x_5_9 + (-1) * x_7_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_5_7 + ((-1) * x_5_9)) ≥ 0) ↔ (¬ (((1) * x_5_7 + (-1) * x_5_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((t + ((-1) * x_5_7) + x_5_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_7 + (1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + ((-1) * x_5_9) + x_7_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_5_9 + (1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((x_5_7 + ((-1) * x_5_9)) ≤ 0) ↔ (((1) * x_5_7 + (-1) * x_5_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_5_9 + ((-1) * x_7_9)) ≤ 0) ↔ (((1) * x_5_9 + (-1) * x_7_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_5_7 + ((-1) * x_7_9)) ≤ (-1)) ↔ (((1) * x_5_7 + (-1) * x_7_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + x_5_7 + ((-1) * x_5_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_7 + (-1) * x_5_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + x_5_9 + ((-1) * x_7_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_5_9 + (-1) * x_7_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

theorem theory3350 (t x_4_5 x_4_7 x_5_7 : ℝ) : (¬ (x_4_5 ≥ 0)) ∨ ((t + ((-1) * x_4_7) + x_5_7) ≥ 1) ∨ (¬ ((x_4_5 + ((-1) * x_5_7)) ≤ (-1))) ∨ ((t + ((-1) * x_4_7)) ≤ 0) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3⟩
  linarith

theorem theory3351 (t x_0_1 x_1_6 x_6_7 x_7_8 x_8_9 : ℝ) : ((t + ((-1) * x_0_1)) ≤ 0) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ (x_8_9 ≥ 0)) ∨ (¬ ((x_1_6 + ((-1) * x_6_7)) ≥ 1)) ∨ (¬ ((x_0_1 + ((-1) * x_1_6)) ≥ 1)) ∨ (t ≥ 4) ∨ (¬ ((x_6_7 + ((-1) * x_7_8)) ≥ 1)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3352 (t x_0_4 x_4_6 x_4_8 x_7_8 x_8_9 : ℝ) : (t ≥ 4) ∨ ((t + ((-1) * x_4_6)) ≤ 0) ∨ (¬ ((x_7_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_0_4 + ((-1) * x_4_8)) ≥ 1)) ∨ (¬ ((x_0_4 + ((-1) * x_4_6)) ≤ (-1))) ∨ (¬ ((x_4_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ (x_7_8 ≥ 0)) := by
  classical
  by_contra h
  push Not at h
  rcases h with ⟨h0, h1, h2, h3, h4, h5, h6⟩
  linarith

theorem theory3353 (t x_3_8 x_3_9 x_8_9 : ℝ) : (((((x_3_8 + ((-1) * x_3_9)) ≤ 0) ∧ ((x_3_9 + ((-1) * x_8_9)) ≤ 0) ∧ ((x_3_8 + ((-1) * x_8_9)) ≤ (-1)) ∧ ((t + x_3_8 + ((-1) * x_3_9)) ≥ 1) ∧ ((t + x_3_9 + ((-1) * x_8_9)) ≥ 1)) ∨ (((x_3_9 + ((-1) * x_8_9)) ≥ 0) ∧ ((x_3_8 + ((-1) * x_3_9)) ≥ 0) ∧ ((x_3_8 + ((-1) * x_8_9)) ≥ 1) ∧ ((t + ((-1) * x_3_8) + x_3_9) ≥ 1) ∧ ((t + ((-1) * x_3_9) + x_8_9) ≥ 1))) ↔ ((¬ ((¬ ((x_3_9 + ((-1) * x_8_9)) ≤ 0)) ∨ (¬ ((x_3_8 + ((-1) * x_8_9)) ≤ (-1))) ∨ (¬ ((x_3_8 + ((-1) * x_3_9)) ≤ 0)) ∨ (¬ ((t + x_3_8 + ((-1) * x_3_9)) ≥ 1)) ∨ (¬ ((t + x_3_9 + ((-1) * x_8_9)) ≥ 1)))) ∨ (¬ ((¬ ((x_3_9 + ((-1) * x_8_9)) ≥ 0)) ∨ (¬ ((x_3_8 + ((-1) * x_3_9)) ≥ 0)) ∨ (¬ ((x_3_8 + ((-1) * x_8_9)) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_8) + x_3_9) ≥ 1)) ∨ (¬ ((t + ((-1) * x_3_9) + x_8_9) ≥ 1)))))) := by
  classical
  have e0 : ((x_3_8 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * x_3_8 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e1 : ((x_3_8 + ((-1) * x_3_9)) ≤ 0) ↔ (((1) * x_3_8 + (-1) * x_3_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e2 : ((x_3_9 + ((-1) * x_8_9)) ≤ 0) ↔ (((1) * x_3_9 + (-1) * x_8_9) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e3 : ((x_3_8 + ((-1) * x_8_9)) ≤ (-1)) ↔ (((1) * x_3_8 + (-1) * x_8_9 + (1)) ≤ 0) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e4 : ((t + x_3_8 + ((-1) * x_3_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_8 + (-1) * x_3_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e5 : ((t + x_3_9 + ((-1) * x_8_9)) ≥ 1) ↔ (¬ (((1) * t + (1) * x_3_9 + (-1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e6 : ((x_3_9 + ((-1) * x_8_9)) ≥ 0) ↔ (¬ (((1) * x_3_9 + (-1) * x_8_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e7 : ((x_3_8 + ((-1) * x_3_9)) ≥ 0) ↔ (¬ (((1) * x_3_8 + (-1) * x_3_9) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e8 : ((t + ((-1) * x_3_8) + x_3_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_8 + (1) * x_3_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  have e9 : ((t + ((-1) * x_3_9) + x_8_9) ≥ 1) ↔ (¬ (((1) * t + (-1) * x_3_9 + (1) * x_8_9 + (-1)) < 0)) := by
    constructor <;> intro h <;> (try simp only [not_lt, not_le] at h ⊢) <;> linarith only [h]
  try simp only [e0, e1, e2, e3, e4, e5, e6, e7, e8, e9]
  all_goals clear e0 e1 e2 e3 e4 e5 e6 e7 e8 e9
  all_goals tauto

end ElevenTheory
